[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Varför trivs danska utvecklare bättre på jobbet än svenska?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:05",
    "line": "Jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:00:08",
    "line": "Det är daily stand-up."
  },
  {
    "speaker": null,
    "timestamp": "00:00:10",
    "line": "Aaaaah, det är bättre i göteborgskan, mycket bättre."
  },
  {
    "speaker": null,
    "timestamp": "00:00:19",
    "line": "Aj, jag skrattar så jag mår under bröstet."
  },
  {
    "speaker": null,
    "timestamp": "00:00:21",
    "line": "Aj, det skulle vara tråkigt om man får någon typ av hjärtinfarkt här och gör någon typ av rockstjärne-exit."
  },
  {
    "speaker": null,
    "timestamp": "00:00:28",
    "line": "Du är ju inte 27."
  },
  {
    "speaker": null,
    "timestamp": "00:00:33",
    "line": "Nej, det är sant. Det är lite för sent. Skulle det varit tidigare på den bollen så hade det varit mer värt det."
  },
  {
    "speaker": null,
    "timestamp": "00:00:37",
    "line": "Tack till Fredrik Björman för skämtet som jag uppskattade enormt mycket. Jag tyckte det var väldigt kul. Ett av de bästa på länge."
  },
  {
    "speaker": null,
    "timestamp": "00:00:48",
    "line": "Ja, jag vet inte om det är bara för att du tycker att du själv är så rolig när du försöker dig på en dialekt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:56",
    "line": "Nej, jag tycker att det är ganska bra."
  },
  {
    "speaker": null,
    "timestamp": "00:00:58",
    "line": "Du tycker inte att det är så roligt, du tycker att du är så bra."
  },
  {
    "speaker": null,
    "timestamp": "00:01:04",
    "line": "Ja, jag tror att jag är bättre på danska än på göteborgska, absolut."
  },
  {
    "speaker": null,
    "timestamp": "00:01:08",
    "line": "Ja, det får man ändå säga. Där är vi enade."
  },
  {
    "speaker": null,
    "timestamp": "00:01:15",
    "line": "Kanske ska jag snacka danska hela det här avsnittet."
  },
  {
    "speaker": null,
    "timestamp": "00:01:19",
    "line": "Där tappade du det, fullständigt. Vi är klara."
  },
  {
    "speaker": null,
    "timestamp": "00:01:26",
    "line": "Ja, okej."
  },
  {
    "speaker": null,
    "timestamp": "00:01:31",
    "line": "Hur är det?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:34",
    "line": "Hur mår du?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:36",
    "line": "Jag låter som att jag är hundra år gammal."
  },
  {
    "speaker": null,
    "timestamp": "00:01:44",
    "line": "Jag är trött. Tackar som frågar. Hur mår du?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:48",
    "line": "Jag mår toppen ändå. Det är mycket att göra, men snart tror jag att det är december och då är allting lugnt igen."
  },
  {
    "speaker": null,
    "timestamp": "00:01:54",
    "line": "Så det brukar vara."
  },
  {
    "speaker": null,
    "timestamp": "00:01:57",
    "line": "Absolut. Jag hoppas ni alla andra mår bra."
  },
  {
    "speaker": null,
    "timestamp": "00:02:02",
    "line": "Vad är det för intro nu?"
  },
  {
    "speaker": null,
    "timestamp": "00:02:05",
    "line": "Jag vet inte. Jag säger det, jag är lite sliten. Jag är väldigt sliten."
  },
  {
    "speaker": null,
    "timestamp": "00:02:10",
    "line": "Då tycker du att det är en bra idé att vi ska prata om cashning."
  },
  {
    "speaker": null,
    "timestamp": "00:02:14",
    "line": "Ja, men det är ju en del av varför jag är sliten."
  },
  {
    "speaker": null,
    "timestamp": "00:02:17",
    "line": "Berätta allt. Tell me more, som de hungrig grease eller vad fan det är."
  },
  {
    "speaker": null,
    "timestamp": "00:02:22",
    "line": "Nej, men jag har bara blivit väldigt tvungen, tvingad att tänka alldeles för mycket på cashning på sistone."
  },
  {
    "speaker": null,
    "timestamp": "00:02:31",
    "line": "Och det är saker som jag har undvikit mycket tidigare."
  },
  {
    "speaker": null,
    "timestamp": "00:02:39",
    "line": "Och så här, okej, cash, inte cash, vad fan vet jag, vad fan bryr jag mig."
  },
  {
    "speaker": null,
    "timestamp": "00:02:43",
    "line": "Men nu har det blivit så här, okej, men vi ska göra vissa sak och då måste vi spara det i en cash."
  },
  {
    "speaker": null,
    "timestamp": "00:02:52",
    "line": "Dels för att vi använder upplevelsen och dels för att vi inte kan göra jättemånga anrop mot tredje part hela tiden."
  },
  {
    "speaker": null,
    "timestamp": "00:03:01",
    "line": "Och också för att göra det här anropet så måste vi ha information från ett tidigare anrop."
  },
  {
    "speaker": null,
    "timestamp": "00:03:09",
    "line": "Och då skulle det kunna vara så här att vi skickar upp det till fronten, fronten skickar tillbaka det ner till BFFen och sen använder vi det."
  },
  {
    "speaker": null,
    "timestamp": "00:03:17",
    "line": "Men det visade sig att det blev jävligt mycket information och det blev också ganska sånk att lägga det i session storage."
  },
  {
    "speaker": null,
    "timestamp": "00:03:23",
    "line": "Så då diskuterar vi fram att, ja men då cashar vi den första responsen också."
  },
  {
    "speaker": null,
    "timestamp": "00:03:30",
    "line": "Och sen så blev det som så att okej, men i tredje responsen vi ska göra det här flödet, då behöver vi också massa data då från den här, dels den första respons-cashen."
  },
  {
    "speaker": null,
    "timestamp": "00:03:41",
    "line": "Och sen så behöver vi egentligen ha data från den andra som egentligen bara har en två minuter time to live."
  },
  {
    "speaker": null,
    "timestamp": "00:03:50",
    "line": "För att vi kan inte casha det hur länge som helst för att saker förändras liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:03:55",
    "line": "Och då blev det så här, ja men då kan vi skicka ner den här informationen från fronten men då blev det också okej, men vad händer med säkerheten då?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:04",
    "line": "Det funkar inte, så det vi gör nu är att vi har en till cash efter två minuters cashen där vi kopierar över allting som vi skickar upp och den cashen har en time to live på en timme."
  },
  {
    "speaker": null,
    "timestamp": "00:04:15",
    "line": "Och sen så använder vi också React Query och React Query cashar ju också responsen."
  },
  {
    "speaker": null,
    "timestamp": "00:04:22",
    "line": "Så det är så jävla mycket cash att hålla reda på och jag kan inte sluta fråga mig själv, vad fan håller vi på med?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:32",
    "line": "Och behöver man verkligen så här jävla mycket cash? Eller det skapar bara problem, eller?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:39",
    "line": "Ja, alltså lite känner jag att alla de här jävla responsen som ni cashar i BFFen, är det cash eller är det mer att ni vill hålla ett state där?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:53",
    "line": "Eller jag fattar liksom inte, alltså jag antar att det är någon typ av flöde som man går igenom och sen vill du att så här, ja men först får du se de här sakerna och så ska vi svara upp eller använda det här till någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:05:05",
    "line": "Och sen nästa steg, ska du gå igenom nästa steg i flödet så måste du kanske använda de tidigare sakerna för att ta fram de andra sakerna, de nya."
  },
  {
    "speaker": null,
    "timestamp": "00:05:13",
    "line": "Precis, jag skulle säga två estate men två minuter lever, hur jag får säga, två minuter är en riktig cash."
  },
  {
    "speaker": null,
    "timestamp": "00:05:24",
    "line": "Men mycket är ju state. Och för att hantera det här statet har vi då bestämt oss för att använda Redis."
  },
  {
    "speaker": null,
    "timestamp": "00:05:32",
    "line": "Och sen för det sista så bara orkade vi inte dra upp en mongo. Och jag tror dessutom inte vi ska köra en mongo utan vi ska köra Cosmos i Azure och du hör ju, du hör ju."
  },
  {
    "speaker": null,
    "timestamp": "00:05:45",
    "line": "Du låter så som en verkandeutvecklare nu."
  },
  {
    "speaker": null,
    "timestamp": "00:05:49",
    "line": "Men sluta."
  },
  {
    "speaker": null,
    "timestamp": "00:05:52",
    "line": "Inte för att det är en självsord på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:05:56",
    "line": "Nej, absolut inte. Absolut inte. Men jag säger det, det här uppdraget har ju liksom långsamt tagit. Du vet som när det kommer tentakler ur vattnet, bara grabbartag i fotleden och drar."
  },
  {
    "speaker": null,
    "timestamp": "00:06:12",
    "line": "Det är vad som har hänt mig."
  },
  {
    "speaker": null,
    "timestamp": "00:06:15",
    "line": "Ner i back-end-djupet."
  },
  {
    "speaker": null,
    "timestamp": "00:06:18",
    "line": "Ja, ungefär så. Ner i cash-hålet."
  },
  {
    "speaker": null,
    "timestamp": "00:06:22",
    "line": "Ja, men det är ju spännande. Men vad skulle ni använda mongon eller Cosmosen till?"
  },
  {
    "speaker": null,
    "timestamp": "00:06:29",
    "line": "Ja, men då skulle det ju i stället vara för att spara informationen där i stället för att spara det i en Redis."
  },
  {
    "speaker": null,
    "timestamp": "00:06:35",
    "line": "Men det kände vi var lite okill. Eller jag kände att det, fan då måste vi ju dra upp en till infrastruktur-greja och då måste vi terraforma lite mer och så."
  },
  {
    "speaker": null,
    "timestamp": "00:06:46",
    "line": "Ja, det låter lite onödigt spontant."
  },
  {
    "speaker": null,
    "timestamp": "00:06:52",
    "line": "Ja, exakt. Därför har vi ju en Redis-cash."
  },
  {
    "speaker": null,
    "timestamp": "00:06:55",
    "line": "Sen är väl, är inte Cosmos pissdyrt för fan mig?"
  },
  {
    "speaker": null,
    "timestamp": "00:07:02",
    "line": "Jag har ingen aning."
  },
  {
    "speaker": null,
    "timestamp": "00:07:03",
    "line": "Eller bland det ihop med något annat."
  },
  {
    "speaker": null,
    "timestamp": "00:07:04",
    "line": "Men alltså, Redis är inte så jävla billigt heller."
  },
  {
    "speaker": null,
    "timestamp": "00:07:06",
    "line": "Nej, nej, så kan det väl vara. Men, jag tycker det känns som att det är, alltså det här skulle man kunna self-hosta och så är det ganska billigt."
  },
  {
    "speaker": null,
    "timestamp": "00:07:13",
    "line": "Cosmos går väl typ inte att self-hosta. Och så är det bara pissdyrt i Asher."
  },
  {
    "speaker": null,
    "timestamp": "00:07:18",
    "line": "Jag tror det handlar om, kanske du vet att man har Asher-paketet."
  },
  {
    "speaker": null,
    "timestamp": "00:07:23",
    "line": "Jo."
  },
  {
    "speaker": null,
    "timestamp": "00:07:24",
    "line": "Faderullan."
  },
  {
    "speaker": null,
    "timestamp": "00:07:25",
    "line": "Och då?"
  },
  {
    "speaker": null,
    "timestamp": "00:07:26",
    "line": "Och då skulle man använda en Cosmos i stället för en Mongo."
  },
  {
    "speaker": null,
    "timestamp": "00:07:28",
    "line": "Ja, men ja, absolut."
  },
  {
    "speaker": null,
    "timestamp": "00:07:30",
    "line": "För då är Mongo dyrt."
  },
  {
    "speaker": null,
    "timestamp": "00:07:31",
    "line": "Absolut. Men det känns som att både Mongo eller Cosmos för den delen hade varit onödigt i det här fallet."
  },
  {
    "speaker": null,
    "timestamp": "00:07:36",
    "line": "Okej, men det är för mycket cash. Vad skulle du ha i stället för en cash?"
  },
  {
    "speaker": null,
    "timestamp": "00:07:43",
    "line": "Varför kan du inte lägga det i Redis bara?"
  },
  {
    "speaker": null,
    "timestamp": "00:07:45",
    "line": "Men det är ju i Redis."
  },
  {
    "speaker": null,
    "timestamp": "00:07:49",
    "line": "Ja, det är väl jättebra."
  },
  {
    "speaker": null,
    "timestamp": "00:07:50",
    "line": "Men det är väl överens?"
  },
  {
    "speaker": null,
    "timestamp": "00:07:53",
    "line": "Det är för mycket cash."
  },
  {
    "speaker": null,
    "timestamp": "00:07:54",
    "line": "Varför då?"
  },
  {
    "speaker": null,
    "timestamp": "00:07:56",
    "line": "Ja, jag förstår. För det känns fruktansvärt. Och så uppdaterar vi den här med liksom, vi hämtar resultat per datum."
  },
  {
    "speaker": null,
    "timestamp": "00:08:05",
    "line": "Och då måste vi lopa igenom cash. Okej, har vi redan det här datumet? Annars släng in det i cashen."
  },
  {
    "speaker": null,
    "timestamp": "00:08:10",
    "line": "Och det blev en så himla grej."
  },
  {
    "speaker": null,
    "timestamp": "00:08:14",
    "line": "Och sen så pratar vi lite mer om det här. Och de bara, ja men det här ändras jättemycket."
  },
  {
    "speaker": null,
    "timestamp": "00:08:18",
    "line": "Okej, så vi cashar det här i två minuter värt."
  },
  {
    "speaker": null,
    "timestamp": "00:08:21",
    "line": "Ja, det beror ju på hur mycket trafik det är."
  },
  {
    "speaker": null,
    "timestamp": "00:08:24",
    "line": "Ja, det kommer nog också vara, du vet det är ett system som är inget eller jättemycket."
  },
  {
    "speaker": null,
    "timestamp": "00:08:35",
    "line": "Eller jättemycket jag säger. Men inget eller allt på en gång."
  },
  {
    "speaker": null,
    "timestamp": "00:08:38",
    "line": "Jag fattar det."
  },
  {
    "speaker": null,
    "timestamp": "00:08:39",
    "line": "Troligtvis."
  },
  {
    "speaker": null,
    "timestamp": "00:08:40",
    "line": "Ja, jag ser väl inga problem. Jag är väl inte heller någon cash-expert. Men jag ser väl inga problem med att lägga allt det där skiten i redis."
  },
  {
    "speaker": null,
    "timestamp": "00:08:56",
    "line": "Men alltså känns det som, men helt läskigt så tycker jag bara att man försätter sig i trubbel med, okej har vi fått gammal data nu?"
  },
  {
    "speaker": null,
    "timestamp": "00:09:08",
    "line": "Eller inte? Fast det är mycket mer react query-cashen tycker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:09:11",
    "line": "Ja, så kan det vara."
  },
  {
    "speaker": null,
    "timestamp": "00:09:13",
    "line": "Ja, men hur fan sen får vi till det? Och den här har en time to live på fem minuter."
  },
  {
    "speaker": null,
    "timestamp": "00:09:17",
    "line": "Den här har en time to live på två minuter."
  },
  {
    "speaker": null,
    "timestamp": "00:09:19",
    "line": "Den här har en time to live på en timme."
  },
  {
    "speaker": null,
    "timestamp": "00:09:21",
    "line": "Den här kan ha expirat. Och den andra cashen, den borde vi kanske egentligen sätta samma time to live som den första."
  },
  {
    "speaker": null,
    "timestamp": "00:09:28",
    "line": "Och har cashen expirat, då måste vi ju liksom kasta tillbaka användaren igen."
  },
  {
    "speaker": null,
    "timestamp": "00:09:34",
    "line": "För kör inte react query också, SWR, alltså stale while revalidate typ. Eller vad fan det nu står för."
  },
  {
    "speaker": null,
    "timestamp": "00:09:42",
    "line": "Jo det gör de det."
  },
  {
    "speaker": null,
    "timestamp": "00:09:45",
    "line": "Alltså att du får ett gammalt svar, om det inte finns i cashen, eller om det är cashat men den har gått ut, så får du det gamla svaret och sen hämtar du det nya i bakgrunden."
  },
  {
    "speaker": null,
    "timestamp": "00:09:56",
    "line": "Säkert."
  },
  {
    "speaker": null,
    "timestamp": "00:09:57",
    "line": "Kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:09:58",
    "line": "Säkert, jag vet inte, jag stängde av den på de flesta."
  },
  {
    "speaker": null,
    "timestamp": "00:10:03",
    "line": "Ja, jag satte på något."
  },
  {
    "speaker": null,
    "timestamp": "00:10:04",
    "line": "Jo men grejen är att vi skickar ju liksom samma parametrar, och jag vill ha ny data."
  },
  {
    "speaker": null,
    "timestamp": "00:10:12",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:10:13",
    "line": "Jag vill ha min andra cashade data, jag vill inte ha den här jävla fronten cashade datan."
  },
  {
    "speaker": null,
    "timestamp": "00:10:19",
    "line": "Alltså jag bara känner, jag förstår inte hur jag hamnade här."
  },
  {
    "speaker": null,
    "timestamp": "00:10:24",
    "line": "Plus att jag liksom just nu är så här, det är inte som att jag kodar, jag bara sitter och pratar, och pratar och ritar på papper för att lyfta ut vad fan vi ska göra, och sen är det så här, ja men vi cashar det här också."
  },
  {
    "speaker": null,
    "timestamp": "00:10:37",
    "line": "Och då känner jag hela tiden, vem är jag? Var är min identitet som utvecklar, vad fan har hänt?"
  },
  {
    "speaker": null,
    "timestamp": "00:10:44",
    "line": "Nej men det här är väl en stor del av att vara utvecklare eller? Att sitta och prata om massa skit som man inte egentligen riktigt bryr sig om."
  },
  {
    "speaker": null,
    "timestamp": "00:10:52",
    "line": "Jo, absolut, men jag brukar ju också få koda. Det är inte så att jag sitter och pratar om skit jag inte riktigt bryr mig om, och sen går jag in i ett möte i fyra timmar, och sen kommer jag ut och då måste jag prata om annan skit jag inte bryr mig om."
  },
  {
    "speaker": null,
    "timestamp": "00:11:06",
    "line": "Jag såg något, vi är ju en liten passus, men vi är ju aktiva på Blue Sky nu."
  },
  {
    "speaker": null,
    "timestamp": "00:11:14",
    "line": "Jag säger vi är aktiva, du skriver fan mer på Blue Sky än vad jag gör."
  },
  {
    "speaker": null,
    "timestamp": "00:11:20",
    "line": "Jag är uppe i fem poster eller någonting tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:11:23",
    "line": "Ja exakt, något sånt. Så gå in och följ oss där, vi kan lägga en länk i beskrivningen."
  },
  {
    "speaker": null,
    "timestamp": "00:11:29",
    "line": "Men det jag skulle säga var att jag såg att du skrev någonting om att du kände att du långsamt konverterade till en pio, eller vad fan var det du skrev?"
  },
  {
    "speaker": null,
    "timestamp": "00:11:38",
    "line": "Ja, nej jag säger att om jag någonsin yttrar orden, jaha, men du, man kanske skulle bli pio."
  },
  {
    "speaker": null,
    "timestamp": "00:11:48",
    "line": "Just det."
  },
  {
    "speaker": null,
    "timestamp": "00:11:49",
    "line": "Det är då du får släppa mig med en ål tydligen, fast det är äckligt, jag vill inte."
  },
  {
    "speaker": null,
    "timestamp": "00:11:56",
    "line": "Det är ju en riktig internetklassiker, eelslap.com är det va? Som jag när jag letade fram den upptäckte att den var gjord av en svensk, eller ett par svenskar."
  },
  {
    "speaker": null,
    "timestamp": "00:12:08",
    "line": "Som driver någon, det är fan ett reklambyrå antar jag. Och det är ändå lite kul."
  },
  {
    "speaker": null,
    "timestamp": "00:12:15",
    "line": "Ja, är det där ungefär som när andra svenskar träffar andra svenskar på resan?"
  },
  {
    "speaker": null,
    "timestamp": "00:12:21",
    "line": "Är du också från Sverige?"
  },
  {
    "speaker": null,
    "timestamp": "00:12:23",
    "line": "Är du också från Sverige?"
  },
  {
    "speaker": null,
    "timestamp": "00:12:24",
    "line": "Nej, är det sant? Du med?"
  },
  {
    "speaker": null,
    "timestamp": "00:12:25",
    "line": "Bästa kompisar, direkt."
  },
  {
    "speaker": null,
    "timestamp": "00:12:27",
    "line": "Två svenskar på internet träffar varandra, bästa kompisar direkt."
  },
  {
    "speaker": null,
    "timestamp": "00:12:30",
    "line": "Har ju kanske visat sig inte i din stämma, men ja."
  },
  {
    "speaker": null,
    "timestamp": "00:12:34",
    "line": "Nej men det var den känslan jag fick nu."
  },
  {
    "speaker": null,
    "timestamp": "00:12:36",
    "line": "Ja, nej, alltså jag, det är, jag har gått ut för."
  },
  {
    "speaker": null,
    "timestamp": "00:12:41",
    "line": "Eller vad man ska säga, alltså, jag sitter bara i möten, diskuterar bara problem, diskuterar bara projekt-saker, sitter i andra möten,"
  },
  {
    "speaker": null,
    "timestamp": "00:12:51",
    "line": "diskuterar med QA-teamet, diskuterar med min riktiga produktägare, diskuterar med team om affärsregler som vi måste implementera,"
  },
  {
    "speaker": null,
    "timestamp": "00:12:59",
    "line": "diskuterar med, ah, alltså det är..."
  },
  {
    "speaker": null,
    "timestamp": "00:13:02",
    "line": "...fruktansvärt."
  },
  {
    "speaker": null,
    "timestamp": "00:13:06",
    "line": "Jag är så fruktansvärt dålig på det också. Du ska se min Jira-board."
  },
  {
    "speaker": null,
    "timestamp": "00:13:09",
    "line": "Jag tycker liksom synd om andra människor som måste läsa det."
  },
  {
    "speaker": null,
    "timestamp": "00:13:12",
    "line": "Din Jira-board? Har du liksom en personlig?"
  },
  {
    "speaker": null,
    "timestamp": "00:13:15",
    "line": "Nej, inte min Jira-board, men den som jag har satt upp, den epiken jag har skapat med alla tickets i och skit."
  },
  {
    "speaker": null,
    "timestamp": "00:13:22",
    "line": "För ticketsen är inte såhär bra med just stories och definition of done."
  },
  {
    "speaker": null,
    "timestamp": "00:13:26",
    "line": "Det är typ en bråkdel som har det, när jag orkade anstränga mig, jag försökte vara snäll mot testarna."
  },
  {
    "speaker": null,
    "timestamp": "00:13:32",
    "line": "Men annars är det typ såhär, one-liner, add day-time validation."
  },
  {
    "speaker": null,
    "timestamp": "00:13:36",
    "line": "Jo, men alltså hade det varit perfekt, och liksom allting var uppsatt, det var estimator, det var definition of done,"
  },
  {
    "speaker": null,
    "timestamp": "00:13:43",
    "line": "då hade jag blivit orolig. Då hade du fått en ill slap."
  },
  {
    "speaker": null,
    "timestamp": "00:13:46",
    "line": "Alltså då hade du..."
  },
  {
    "speaker": null,
    "timestamp": "00:13:48",
    "line": "Då hade du don-tid fast tagit slint."
  },
  {
    "speaker": null,
    "timestamp": "00:13:52",
    "line": "Ja, men det är lite som att det har nu. Jag har aldrig estimerat, men definition of done så har jag gjort."
  },
  {
    "speaker": null,
    "timestamp": "00:13:59",
    "line": "Men jag bara känner, du vet såhär, helt plötsligt sitter jag och diskuterar arkitektur."
  },
  {
    "speaker": null,
    "timestamp": "00:14:04",
    "line": "Och jag menar, jag har ingen koll på hur bra eller dålig den här är."
  },
  {
    "speaker": null,
    "timestamp": "00:14:07",
    "line": "Det vi bygger är liksom också att vi bygger inte ett fristående flöd, eller vad man ska säga."
  },
  {
    "speaker": null,
    "timestamp": "00:14:14",
    "line": "Alltså vi bygger ett system som sitter ovanpå en motor som konfigurerar värden från affärsregeltim."
  },
  {
    "speaker": null,
    "timestamp": "00:14:23",
    "line": "Så vi måste hela tiden bygga så att vi jobbar med dem, så att vi kan hantera att de här värdena kan förändras"
  },
  {
    "speaker": null,
    "timestamp": "00:14:30",
    "line": "och bubbla upp till appen. Så vi försöker sätta så lite som möjligt i våra egna kod."
  },
  {
    "speaker": null,
    "timestamp": "00:14:35",
    "line": "Och det har gjort saker till viss del jävligt komplexa."
  },
  {
    "speaker": null,
    "timestamp": "00:14:40",
    "line": "Till exempel att vi ska söka efter saker, men beroende på tid så måste vi söka på ett sätt eller ett annat sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:50",
    "line": "Och resultaten kommer olika. Antingen får vi ett resultat, där vi får ett resultat över ett antal dagar."
  },
  {
    "speaker": null,
    "timestamp": "00:14:57",
    "line": "Eller så måste vi söka per dag. Och de ska vi försöka casha tillsammans om de sker samtidigt."
  },
  {
    "speaker": null,
    "timestamp": "00:15:04",
    "line": "Alltså det är mycket. Och så helt plötsligt sitter jag där, diskuterar back-end-arkitektur."
  },
  {
    "speaker": null,
    "timestamp": "00:15:13",
    "line": "Och skriver tickets med definition of done och user stories."
  },
  {
    "speaker": null,
    "timestamp": "00:15:17",
    "line": "Alltså min identitet, vet du jag saknar CSS."
  },
  {
    "speaker": null,
    "timestamp": "00:15:21",
    "line": "Jo, men du har väl alltid gillat CSS?"
  },
  {
    "speaker": null,
    "timestamp": "00:15:24",
    "line": "Ehh, nej."
  },
  {
    "speaker": null,
    "timestamp": "00:15:29",
    "line": "Du ska inte CSS för att få massa oförtjänt skit här känner jag."
  },
  {
    "speaker": null,
    "timestamp": "00:15:32",
    "line": "Nej, jag har inte alltid gillat CSS, men sen så vände det liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:15:36",
    "line": "Och sen så visade det sig att jag brann för CSS. Jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:15:40",
    "line": "Jag tror aldrig du har hört dig säga att du brinner för något. Men nu, där, klipper jag ut."
  },
  {
    "speaker": null,
    "timestamp": "00:15:44",
    "line": "Nej, jag menar med att när vi pratar om CSS någon gång så blir det som att jag höll ett litet brandtal."
  },
  {
    "speaker": null,
    "timestamp": "00:15:50",
    "line": "Ja, det är sant. Det jag tänkte säga var att känns det inte kul på något sätt?"
  },
  {
    "speaker": null,
    "timestamp": "00:16:01",
    "line": "Alltså att du gör saker som du inte kan. Eller som du utmanas i."
  },
  {
    "speaker": null,
    "timestamp": "00:16:07",
    "line": "Jag vet inte vad jag försöker komma, jag försöker hitta någon typ av silver lining i det här. Någon guldkant på det här."
  },
  {
    "speaker": null,
    "timestamp": "00:16:14",
    "line": "PO-grejerna? Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:16:20",
    "line": "Du vet det finns väl alltid en viss grej i det på ett sätt. Jag har ju fått fin feedback från vissa håll och det är väl alltid kul att känna att jag skapar värde."
  },
  {
    "speaker": null,
    "timestamp": "00:16:30",
    "line": "Men mitt problem är också att det finns vissa kommunikationer mellan alla instanser är inte så himla lätt."
  },
  {
    "speaker": null,
    "timestamp": "00:16:37",
    "line": "Och till slut blir det som att det är di mot dom och dom mot oss och dom mot dom."
  },
  {
    "speaker": null,
    "timestamp": "00:16:42",
    "line": "Och jag bara känner att okej, men inte hela poängen att vi ska bygga ett värde eller skapa ett flöde för en slutanvändare som är bra tillsammans."
  },
  {
    "speaker": null,
    "timestamp": "00:16:52",
    "line": "Är inte det hela vårt mål? Och just nu så känns det inte som det. Just nu känns det bara som att det är dålig stämning."
  },
  {
    "speaker": null,
    "timestamp": "00:16:57",
    "line": "Och det är inte så kul. Och där är säkert det bidrar jag till."
  },
  {
    "speaker": null,
    "timestamp": "00:17:02",
    "line": "Men också att ingenting blir gjort. Ingenting händer. Och då tycker jag verkligen inte om mig själv just nu."
  },
  {
    "speaker": null,
    "timestamp": "00:17:13",
    "line": "Men då kan du kliva in i din PO-roll där och styra upp det där."
  },
  {
    "speaker": null,
    "timestamp": "00:17:18",
    "line": "Men jag har ju en PO. Hon får styra."
  },
  {
    "speaker": null,
    "timestamp": "00:17:22",
    "line": "Det får man hoppas."
  },
  {
    "speaker": null,
    "timestamp": "00:17:25",
    "line": "Ja, men det är inte så att jag uppskattar att gå till jobbet och vara helt frustrerad och lite ilsken."
  },
  {
    "speaker": null,
    "timestamp": "00:17:35",
    "line": "Och sen komma hem och vara helt förstörd."
  },
  {
    "speaker": null,
    "timestamp": "00:17:38",
    "line": "Nej, det förstår jag."
  },
  {
    "speaker": null,
    "timestamp": "00:17:40",
    "line": "Men back-end-grejerna, det är som att jag, nu vet inte jag, för jag har ju också kanske en tech-lead som kommer komma och säga"
  },
  {
    "speaker": null,
    "timestamp": "00:17:48",
    "line": "Vad fan har ni gjort? Och då säger jag Titta inte. Titta inte. Vi har gjort vårt bästa."
  },
  {
    "speaker": null,
    "timestamp": "00:17:54",
    "line": "Det var inte jag."
  },
  {
    "speaker": null,
    "timestamp": "00:17:56",
    "line": "Du ser inte mitt namn då."
  },
  {
    "speaker": null,
    "timestamp": "00:18:00",
    "line": "Det var de här juniora personerna jag var med."
  },
  {
    "speaker": null,
    "timestamp": "00:18:03",
    "line": "Exakt. Nej, men till viss del så kan det väl kännas kul."
  },
  {
    "speaker": null,
    "timestamp": "00:18:07",
    "line": "Alltså jag är ju tvingats tänka på system på ett annat sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:18:11",
    "line": "Och jag har ju faktiskt börjat inse också att jag klarar av vissa saker."
  },
  {
    "speaker": null,
    "timestamp": "00:18:16",
    "line": "Att jag kan tänka logiskt kring saker och integrationer."
  },
  {
    "speaker": null,
    "timestamp": "00:18:19",
    "line": "Att jag förstår ganska mycket nu för tiden."
  },
  {
    "speaker": null,
    "timestamp": "00:18:22",
    "line": "Och det är ju lite kul."
  },
  {
    "speaker": null,
    "timestamp": "00:18:25",
    "line": "Men jag känner ju också att jag är helt eftersatt i front-end-bitarna."
  },
  {
    "speaker": null,
    "timestamp": "00:18:29",
    "line": "Helt plötsligt sitter jag där med chatt-GPT och bara Hur funkar en error boundary?"
  },
  {
    "speaker": null,
    "timestamp": "00:18:35",
    "line": "Jo, men det kan man ju göra. Man kan ju inte hålla allt i huvudet där."
  },
  {
    "speaker": null,
    "timestamp": "00:18:39",
    "line": "Jag tror inte att du är så eftersatt i front-end-en egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:18:43",
    "line": "Jo, jo. Fråga mig. Jag kan ingenting om front-end-en."
  },
  {
    "speaker": null,
    "timestamp": "00:18:46",
    "line": "Det var också som att vi hade en accessibility-intro."
  },
  {
    "speaker": null,
    "timestamp": "00:18:50",
    "line": "Och de var så här Ja, men säg gärna hur mycket accessibility ni kan."
  },
  {
    "speaker": null,
    "timestamp": "00:18:54",
    "line": "Och jag kan väl Ja, men jag kan väl grunderna liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:18:57",
    "line": "Och så sa en massa andra det också."
  },
  {
    "speaker": null,
    "timestamp": "00:18:59",
    "line": "Och sen, du vet, började jag veva."
  },
  {
    "speaker": null,
    "timestamp": "00:19:01",
    "line": "Ja, men vi har ju tyvärr lite så här att vi har font-size i pixlar och spacing i rem."
  },
  {
    "speaker": null,
    "timestamp": "00:19:06",
    "line": "Och det är ju inte alls bra."
  },
  {
    "speaker": null,
    "timestamp": "00:19:08",
    "line": "Jo, men om du ändrar font-storleken så vill jag att fonten ska ändras."
  },
  {
    "speaker": null,
    "timestamp": "00:19:12",
    "line": "Men du vill ju inte att whitespacing ska ändras."
  },
  {
    "speaker": null,
    "timestamp": "00:19:14",
    "line": "För då har du begränsat synfält så kommer du inte se nånting då."
  },
  {
    "speaker": null,
    "timestamp": "00:19:17",
    "line": "Det är ju kaos liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:19:19",
    "line": "Och line-height borde ju vara minimum 1,5."
  },
  {
    "speaker": null,
    "timestamp": "00:19:22",
    "line": "Eller bla bla bla bla bla."
  },
  {
    "speaker": null,
    "timestamp": "00:19:24",
    "line": "Och då insåg jag att jag kanske har mer än bas-knowledge i accessibility också."
  },
  {
    "speaker": null,
    "timestamp": "00:19:28",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:19:29",
    "line": "Vad skönt det känns att jag inte behöver sitta här och vara en motpool som säger Du kan visst saker."
  },
  {
    "speaker": null,
    "timestamp": "00:19:34",
    "line": "Utan du sitter själv och säger Fan, det visade sig att jag kan saker."
  },
  {
    "speaker": null,
    "timestamp": "00:19:37",
    "line": "Kan jag ganska mycket saker, fast det?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:39",
    "line": "Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:19:40",
    "line": "Det här är en del av min identitetskris nu. Hur fan är jag liksom?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:44",
    "line": "Utan min ångest är jag ingenting."
  },
  {
    "speaker": null,
    "timestamp": "00:19:46",
    "line": "Du har liksom gått från att ha världens imposter-syndrom och inte tro att du kan nånting"
  },
  {
    "speaker": null,
    "timestamp": "00:19:51",
    "line": "till att nu bara knacka massa backend-grejer och ta arkitekturbeslut och inse att du kan massa saker."
  },
  {
    "speaker": null,
    "timestamp": "00:19:58",
    "line": "Ja, det är fruktansvärt."
  },
  {
    "speaker": null,
    "timestamp": "00:20:00",
    "line": "Fruktansvärt, men cash fortfarande. Jag gillar inte cash."
  },
  {
    "speaker": null,
    "timestamp": "00:20:03",
    "line": "Nej, men det där, ni, jag, så här, du får ju min stampa för provad. Det låter som att ni löser jättebra."
  },
  {
    "speaker": null,
    "timestamp": "00:20:10",
    "line": "Men du hatar ju backend."
  },
  {
    "speaker": null,
    "timestamp": "00:20:12",
    "line": "Nej, jag hatar inte alls backend. Jag sitter ganska mycket i en backend."
  },
  {
    "speaker": null,
    "timestamp": "00:20:15",
    "line": "Jaja, men du uppskattar ju inte backend."
  },
  {
    "speaker": null,
    "timestamp": "00:20:18",
    "line": "Nej, men jag uppskattar inte backend som i att bara sitta och skriva massa affärslogik."
  },
  {
    "speaker": null,
    "timestamp": "00:20:28",
    "line": "Jag gillar backend som i att bygga produkt och bara lösa problem."
  },
  {
    "speaker": null,
    "timestamp": "00:20:35",
    "line": "Ja, jag sitter ju och bygger affärsregler. Nej, jag bygger, ska vi säga, små tunnlar så att affärsreglerna ska kunna trickla igenom upp till frontenen."
  },
  {
    "speaker": null,
    "timestamp": "00:20:49",
    "line": "Ja, och det kan säkert vara kul. Jag sitter ju också och ska bygga typ en BFF eller en gateway. Eller det har väl exploderat inte massa saker nu."
  },
  {
    "speaker": null,
    "timestamp": "00:20:59",
    "line": "Och sitter också och ska casha skit. Kan du låta mig casha GraphQL-grejer?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:04",
    "line": "Är det där hårigt alltså?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:07",
    "line": "Ja, det är lite hårigt."
  },
  {
    "speaker": null,
    "timestamp": "00:21:09",
    "line": "GraphQL är ju, alltså jag var jävligt taggad i början. Och sen nu känner jag att det var en fluga. Och jag är rätt glad att slippa GraphQL, ärligt talat."
  },
  {
    "speaker": null,
    "timestamp": "00:21:22",
    "line": "Ja, jag håller med dig. Men nu ska jag skriva ett GraphQL-API. Så det ska man väl lösa."
  },
  {
    "speaker": null,
    "timestamp": "00:21:29",
    "line": "Nej, men det är i för sig i det här fallet är lite vettigt. För att det är typ en app som ska integrera mot ett CMS och lite annan affärslogik."
  },
  {
    "speaker": null,
    "timestamp": "00:21:41",
    "line": "Och typ ett separat rest-API som sen ska då, alltså jag ska koppla ihop alla de här API-erna i en liten gateway som slår ihop allting."
  },
  {
    "speaker": null,
    "timestamp": "00:21:48",
    "line": "Och sen ska det använda GraphQL för att appen ska slippa hämta all data."
  },
  {
    "speaker": null,
    "timestamp": "00:21:54",
    "line": "Ja, absolut. Och då börjar man ju känna att det finns en poäng med GraphQL. Men om det är ett vanligt, du vet, hämta datorn, visa."
  },
  {
    "speaker": null,
    "timestamp": "00:22:01",
    "line": "Vad fasen ska det vara GraphQL för? Det är bara problem."
  },
  {
    "speaker": null,
    "timestamp": "00:22:04",
    "line": "Nej, det håller jag verkligen med om."
  },
  {
    "speaker": null,
    "timestamp": "00:22:07",
    "line": "Men är inte hela grejen med GraphQL också att man kan hamna i performance-trubbel om man inte håller tungan rätt i mun så att säga?"
  },
  {
    "speaker": null,
    "timestamp": "00:22:14",
    "line": "Jo, det beror helt på hur du bygger dina resolvers och vilka queries som exponeras."
  },
  {
    "speaker": null,
    "timestamp": "00:22:23",
    "line": "För att det kan ju bli att en query så inser folk att här kan jag hämta all data jag vill."
  },
  {
    "speaker": null,
    "timestamp": "00:22:28",
    "line": "Och så hämtar de all data och så visar det sig att i bakgrunden så är det liksom 17 anrop till olika API-er som sen måste slås ihop på olika sätt och lite sådana saker."
  },
  {
    "speaker": null,
    "timestamp": "00:22:36",
    "line": "Och sen finns ju den här grafen också."
  },
  {
    "speaker": null,
    "timestamp": "00:22:40",
    "line": "Så jag skulle gärna vilja slå ihop de här två graferna och hämta ett set av data från dem."
  },
  {
    "speaker": null,
    "timestamp": "00:22:46",
    "line": "Vi skulle uppskatta om du inte gjorde så, för det är ungefär 21 anrop i bakgrunden."
  },
  {
    "speaker": null,
    "timestamp": "00:22:52",
    "line": "Vi har byggt om till ett rest-API, varsågod."
  },
  {
    "speaker": null,
    "timestamp": "00:22:55",
    "line": "Det började versioneras. Vi är på v3 nu."
  },
  {
    "speaker": null,
    "timestamp": "00:23:02",
    "line": "Ja, man har varit med många gånger när man har kört GraphQL och på Jina så har man så här, här har du orderentiteten, här har du order v2-entiteten och här har du order v3-entiteten."
  },
  {
    "speaker": null,
    "timestamp": "00:23:14",
    "line": "Jag bara, ja! Perfekt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:18",
    "line": "Och sådant här borde inte jag veta."
  },
  {
    "speaker": null,
    "timestamp": "00:23:21",
    "line": "Nej, men det gör du för att du har bra koll och är duktig på ditt jobb."
  },
  {
    "speaker": null,
    "timestamp": "00:23:25",
    "line": "Nej, men jag är PO. Lämna mig i fred, jag kan inget tekniskt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:32",
    "line": "Vilken t-shirt-storlek skulle du säga att det här tar?"
  },
  {
    "speaker": null,
    "timestamp": "00:23:37",
    "line": "Vi jobbar inte med t-shirt-storlekar faktiskt. Vi tycker att det är lite, jag försöker komma på någon typ av ism som det bara händer."
  },
  {
    "speaker": null,
    "timestamp": "00:23:46",
    "line": "Det är fullplatt, tyvärr."
  },
  {
    "speaker": null,
    "timestamp": "00:23:49",
    "line": "Det är inte inkluderande för att alla t-shirt-storlekar är inte med."
  },
  {
    "speaker": null,
    "timestamp": "00:23:53",
    "line": "Exakt, exakt. Någonting sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:56",
    "line": "Vem vet."
  },
  {
    "speaker": null,
    "timestamp": "00:23:59",
    "line": "Åh, Gud."
  },
  {
    "speaker": null,
    "timestamp": "00:24:01",
    "line": "Det låter ju snarare som att ni är lite ute ur kärsningsträsket nu då, eller?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:07",
    "line": "Ja, men det här är ju också, det är träsk vi stampar runt i. Vi har tagit oss ut från det, men inte skogen."
  },
  {
    "speaker": null,
    "timestamp": "00:24:20",
    "line": "Kanske. Ja, fan vet jag. Det var också någon som drog en kommentar. Ja, vi såg din PR här. Undrar vad fan håller ni på med?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:31",
    "line": "Var det någon som sa det?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:34",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:24:35",
    "line": "På skämt?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:38",
    "line": "Nä, en sanning med skämtsam ton."
  },
  {
    "speaker": null,
    "timestamp": "00:24:43",
    "line": "De ville liksom linda in det lite grann, så det lät lite bättre än vad det var."
  },
  {
    "speaker": null,
    "timestamp": "00:24:49",
    "line": "Ja, det är oklart. Han gillar, han spär inte sina ord, så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:24:57",
    "line": "Nej, det kan man uppskatta ibland."
  },
  {
    "speaker": null,
    "timestamp": "00:25:02",
    "line": "Ja, men det tog ett tag att lära sig. Alltså först ville jag alltid bara gå hem och gråta."
  },
  {
    "speaker": null,
    "timestamp": "00:25:08",
    "line": "Ja, det är inte en startsträcka man vill ha, kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:25:12",
    "line": "Nej, sen var det också en annan som bara aldrig lyssnade på vad jag sa. Alltså, det gick vitt om jag skrev eller sa någonting, lyssnade inte på frågan utan bara sa någonting helt annat."
  },
  {
    "speaker": null,
    "timestamp": "00:25:21",
    "line": "Och då blev jag så här upprörd tills jag insåg att, ja, men det är som mot alla. Då är det ok."
  },
  {
    "speaker": null,
    "timestamp": "00:25:26",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:25:27",
    "line": "Det ska vara jämnt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:28",
    "line": "Antingen ska det vara piss för alla, eller ska det inte bara vara piss för mig."
  },
  {
    "speaker": null,
    "timestamp": "00:25:33",
    "line": "Om jag har det dåligt, ska alla ha det dåligt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:37",
    "line": "Nej, inte så. Om du behandlar bara mig dåligt, då är det ditt problem. Men om du bara kommunicerar så här, mot alla, då är vi i alla fall på samma plats. Då känns det ok."
  },
  {
    "speaker": null,
    "timestamp": "00:25:48",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:25:49",
    "line": "Ja, det är väl spännande då. Det är väl kul. Jag ska också sitta lite grann med kärsning snart, så vi kanske får återkomma till det."
  },
  {
    "speaker": null,
    "timestamp": "00:25:58",
    "line": "Se om jag kanske blir såld på GraphQL också efter det här."
  },
  {
    "speaker": null,
    "timestamp": "00:26:02",
    "line": "Shit. Det har varit konstigt. Men det är också så här, jag är ledsen. Det blir ju alltid så här när jag ska prata om någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:26:09",
    "line": "Jag har liksom ingenting att prata om egentligen. Du har skrivit upp ett litet historikschema över den här konflikten."
  },
  {
    "speaker": null,
    "timestamp": "00:26:16",
    "line": "Och jag är mer så här, här sitter jag och skriver."
  },
  {
    "speaker": null,
    "timestamp": "00:26:18",
    "line": "Det har inte en gång jag skrivit ner ett fint historikschema på, jag vet inte, hur länge har vi pratat? Fyra år?"
  },
  {
    "speaker": null,
    "timestamp": "00:26:25",
    "line": "Det är liksom inte så att jag kommer varje avsnitt med något jävla förberett dokument jag ska gå igenom."
  },
  {
    "speaker": null,
    "timestamp": "00:26:34",
    "line": "Jo, han sitter med manus, han sitter med en teleprompter framför sig."
  },
  {
    "speaker": null,
    "timestamp": "00:26:40",
    "line": "Exakt. Avslöja inte det här lite, att man lyssnar får leva i vilfarelsen att jag improviserar allt vettigt jag säger."
  },
  {
    "speaker": null,
    "timestamp": "00:26:48",
    "line": "Men du har ju alltid en mental liten lista. Jag har ingenting. Jag har bara kaos."
  },
  {
    "speaker": null,
    "timestamp": "00:26:55",
    "line": "Jo, men det är en del av det här."
  },
  {
    "speaker": null,
    "timestamp": "00:26:59",
    "line": "Jag tycker det är synd om dem också, när jag har varit så här, dem har kört och jag bara, nej vi gör så här."
  },
  {
    "speaker": null,
    "timestamp": "00:27:04",
    "line": "Nej vi gör så här förresten. Nej jag tror vi gör så här. Nej gå tillbaka, gå tillbaka, gå tillbaka."
  },
  {
    "speaker": null,
    "timestamp": "00:27:09",
    "line": "Det låter också som en utveckling, bara punkt."
  },
  {
    "speaker": null,
    "timestamp": "00:27:15",
    "line": "Det känner vi helt fruktansvärd som människa."
  },
  {
    "speaker": null,
    "timestamp": "00:27:19",
    "line": "Ja, men så kan det vara ibland."
  },
  {
    "speaker": null,
    "timestamp": "00:27:22",
    "line": "Innan vi avslutar det här så inser jag också att det här är väl kanske årets sista avsnitt, där man hör oss."
  },
  {
    "speaker": null,
    "timestamp": "00:27:32",
    "line": "Ja, om vi har kommit överens om det. Näst sista kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:27:35",
    "line": "Ja, vi får se. Det beror på feeling."
  },
  {
    "speaker": null,
    "timestamp": "00:27:38",
    "line": "För på söndag så är det ju första advent och vi är tillbaka med en till julkalender även i år."
  },
  {
    "speaker": null,
    "timestamp": "00:27:48",
    "line": "Förra året körde vi ju lyssnafrågor, väldigt kul måste jag säga. Året innan där körde vi tips."
  },
  {
    "speaker": null,
    "timestamp": "00:27:58",
    "line": "Och i år blir det någonting helt nytt, som jag tänker att vi behöver inte spoila det nu. Man märker på söndag helt enkelt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:07",
    "line": "Ja, om inte alla redan vet."
  },
  {
    "speaker": null,
    "timestamp": "00:28:10",
    "line": "Nej, jag tror inte någon vet."
  },
  {
    "speaker": null,
    "timestamp": "00:28:13",
    "line": "Några vet."
  },
  {
    "speaker": null,
    "timestamp": "00:28:15",
    "line": "Det jag ska säga innan det här, nu sätter jag lite press på mig själv och vill göra klart det här också."
  },
  {
    "speaker": null,
    "timestamp": "00:28:19",
    "line": "Men jag tycker att på söndag, det här släpps i morgon på fredag, men på söndag så tycker jag att man ska gå in på vår hemsida och titta på julkalendern där."
  },
  {
    "speaker": null,
    "timestamp": "00:28:29",
    "line": "Den har fått lite extra kärlek i år, om jag hinner klart den. Annars får man gå in på måndag kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:28:37",
    "line": "Den tojt deadline nu alltså, jäklar."
  },
  {
    "speaker": null,
    "timestamp": "00:28:40",
    "line": "Jo, men nu måste jag sätta lite press på mig själv. Jag har bedömt att det är ungefär 50% kvar nu kanske. Så jag måste lägga några timmar."
  },
  {
    "speaker": null,
    "timestamp": "00:28:50",
    "line": "Men också att det här störde mig jättemycket, för du sa att det är en julkalender för det första advent på söndag. Och jag vill bara säga det för att det är första december också. Gud vad störigt."
  },
  {
    "speaker": null,
    "timestamp": "00:29:00",
    "line": "Ja, just det. Första advent är inte alltid på första december."
  },
  {
    "speaker": null,
    "timestamp": "00:29:07",
    "line": "Nej, det är första söndag, alltså det är söndagen fyra söndagar innan jul."
  },
  {
    "speaker": null,
    "timestamp": "00:29:15",
    "line": "Just det, det är fan sant. Vad sjukt. Det har jag aldrig tänkt på."
  },
  {
    "speaker": null,
    "timestamp": "00:29:21",
    "line": "Att man ska behöva förklara det här för en 33-åring."
  },
  {
    "speaker": null,
    "timestamp": "00:29:25",
    "line": "Alltså det var lite mind blown här faktiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:29:29",
    "line": "Nej, gud."
  },
  {
    "speaker": null,
    "timestamp": "00:29:31",
    "line": "Av någon anledning har jag också tänkt att fjärde advent alltid är på julafton, men det kan ju inte stämma."
  },
  {
    "speaker": null,
    "timestamp": "00:29:36",
    "line": "Nej, åh herregud. Herregud."
  },
  {
    "speaker": null,
    "timestamp": "00:29:41",
    "line": "Nej, det stämmer. Du har en poäng."
  },
  {
    "speaker": null,
    "timestamp": "00:29:45",
    "line": "Ja, hörni. Vi hörs förmodligen igen 2025. Kom ihåg julkalendern, den kommer på söndag. Gå in på hemsidan och titta."
  },
  {
    "speaker": null,
    "timestamp": "00:29:55",
    "line": "Jag är fan lite stolt, fast jag inte har gjort klart skiten än."
  },
  {
    "speaker": null,
    "timestamp": "00:30:00",
    "line": "Jag är mest stolt, fast jag inte har gjort klart den."
  },
  {
    "speaker": null,
    "timestamp": "00:30:04",
    "line": "Toppen, toppen hörni. Vi hörs igen. Ha det så bra. Trevlig helg."
  },
  {
    "speaker": null,
    "timestamp": "00:30:09",
    "line": "Hej då!"
  }
]
