[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Vad gör infrateamet på metalkonsert?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:04",
    "line": "För det kommer på saker man gör på ett metalkonsert."
  },
  {
    "speaker": null,
    "timestamp": "00:00:08",
    "line": "Jag har ingen aning."
  },
  {
    "speaker": null,
    "timestamp": "00:00:10",
    "line": "En mesh-pit?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:12",
    "line": "Nej men..."
  },
  {
    "speaker": null,
    "timestamp": "00:00:14",
    "line": "Det är så jävla nisch."
  },
  {
    "speaker": null,
    "timestamp": "00:00:16",
    "line": "Det är så jävla nischat."
  },
  {
    "speaker": null,
    "timestamp": "00:00:18",
    "line": "Ja men, vadå?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:20",
    "line": "Det är ju nischat och så nischar det lite i nischade."
  },
  {
    "speaker": null,
    "timestamp": "00:00:24",
    "line": "Alltså man måste ju liksom veta vad man gör på ett metalkonsert."
  },
  {
    "speaker": null,
    "timestamp": "00:00:27",
    "line": "Men det är mosh pit känns det ändå allmänt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:30",
    "line": "Ja, kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:00:31",
    "line": "Du måste veta vad en mesh är för något."
  },
  {
    "speaker": null,
    "timestamp": "00:00:34",
    "line": "Du måste veta att infra sysslar med sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:37",
    "line": "Ja, men får väl googla lite?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:40",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:00:41",
    "line": "Okej, guggla mosh pit, mesh och infra."
  },
  {
    "speaker": null,
    "timestamp": "00:00:45",
    "line": "Där har vi det."
  },
  {
    "speaker": null,
    "timestamp": "00:00:47",
    "line": "Okej."
  },
  {
    "speaker": null,
    "timestamp": "00:00:48",
    "line": "Nej, Gud försvara, jag har knäckt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:50",
    "line": "Det börjar bli svårt att hitta skämten, okej?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:53",
    "line": "Jag måste ta inspiration från många håll."
  },
  {
    "speaker": null,
    "timestamp": "00:00:55",
    "line": "Jag förstår det."
  },
  {
    "speaker": null,
    "timestamp": "00:00:56",
    "line": "- Ja, hej och välkomna till ASTF. - Ja, ett nytt avsnitt."
  },
  {
    "speaker": null,
    "timestamp": "00:01:02",
    "line": "- Idag tänkte vi prata lite om att gå på konsert."
  },
  {
    "speaker": null,
    "timestamp": "00:01:10",
    "line": "Nej, vi tänkte prata lite om hur en kommer in i teamet, nya team."
  },
  {
    "speaker": null,
    "timestamp": "00:01:17",
    "line": "- Både vi har gjort det relativt nyligen ändå och ett antal gånger."
  },
  {
    "speaker": null,
    "timestamp": "00:01:23",
    "line": "Och även som konsult så blir det ju oftare skulle jag säga, än andra förhoppningsvis i alla fall."
  },
  {
    "speaker": null,
    "timestamp": "00:01:28",
    "line": "Om man är liksom fast anställd på ett produktbolag eller sådär."
  },
  {
    "speaker": null,
    "timestamp": "00:01:31",
    "line": "Men jag tänkte lite på det här om veckan, för jag kände att jag hade haft ganska svårt."
  },
  {
    "speaker": null,
    "timestamp": "00:01:38",
    "line": "Jag kan väl börja, alltså det är såhär, jag är väldigt mycket en face to face person."
  },
  {
    "speaker": null,
    "timestamp": "00:01:41",
    "line": "Alltså jag är väldigt mycket såhär, hänga på kontoret, prata lite skit när man går och hämtar kaffe fast jag inte dricker kaffe."
  },
  {
    "speaker": null,
    "timestamp": "00:01:46",
    "line": "men liksom att de här små interaktionerna är liksom de som för mig är de viktigaste"
  },
  {
    "speaker": null,
    "timestamp": "00:01:53",
    "line": "och att det har varit så oerhört svårt nu när man har varit helt remote i stort sett"
  },
  {
    "speaker": null,
    "timestamp": "00:01:57",
    "line": "att liksom på något sätt komma in i teamet och få lite skärgång"
  },
  {
    "speaker": null,
    "timestamp": "00:02:01",
    "line": "eller liksom att plocka upp saker och sådär."
  },
  {
    "speaker": null,
    "timestamp": "00:02:03",
    "line": "Men jag vet inte hur du har känt."
  },
  {
    "speaker": null,
    "timestamp": "00:02:07",
    "line": "- Jo, alltså jag vet inte riktigt. Jag är väl kanske lite likadan eller"
  },
  {
    "speaker": null,
    "timestamp": "00:02:14",
    "line": "Jag är inte säker på att det måste vara face to face, men jag är mycket mer på att plocka upp de här lite små grejerna."
  },
  {
    "speaker": null,
    "timestamp": "00:02:19",
    "line": "Och det är det ju såklart lättare face to face, men i och med de här digitala mötena så är det lite lättare att rymma också."
  },
  {
    "speaker": null,
    "timestamp": "00:02:25",
    "line": "Så det finns en, vad heter det, en guldkant i det att jag slipper när det är face to face, så står man där och så blir det obehagligt tyst."
  },
  {
    "speaker": null,
    "timestamp": "00:02:36",
    "line": "Och så har jag ingenstans att ta vägen."
  },
  {
    "speaker": null,
    "timestamp": "00:02:38",
    "line": "De slipper jag ju lite digitalt. Men annars håller jag med."
  },
  {
    "speaker": null,
    "timestamp": "00:02:42",
    "line": "De här små grejerna, känna av stämningen, lite se hur personers kroppsspråk är, sådana saker."
  },
  {
    "speaker": null,
    "timestamp": "00:02:48",
    "line": "Ja, men precis. För mig handlar det väldigt mycket om att kunna prata med folk om annat som är en jobb."
  },
  {
    "speaker": null,
    "timestamp": "00:02:56",
    "line": "Så att man kan lära känna folk lite mer än bara jobbet."
  },
  {
    "speaker": null,
    "timestamp": "00:03:00",
    "line": "Och det är ju så oerhört svårt tycker jag, när man bara ringer upp någon på ett möte för att man ska ha ett möte."
  },
  {
    "speaker": null,
    "timestamp": "00:03:06",
    "line": "så kommer du alldeles in i mötet och så bara \"okej, nu sätter vi igång\""
  },
  {
    "speaker": null,
    "timestamp": "00:03:09",
    "line": "och så kör man mötet och sen \"hejdå\" och så lägger man på"
  },
  {
    "speaker": null,
    "timestamp": "00:03:12",
    "line": "och så sitter man där själv igen."
  },
  {
    "speaker": null,
    "timestamp": "00:03:15",
    "line": "- Ja, det beror på..."
  },
  {
    "speaker": null,
    "timestamp": "00:03:19",
    "line": "Nu när jag mobbar ganska mycket så hittar man sedan tillfällen"
  },
  {
    "speaker": null,
    "timestamp": "00:03:23",
    "line": "att snacka lite skit eller sådana saker."
  },
  {
    "speaker": null,
    "timestamp": "00:03:26",
    "line": "Annars blir det ofta så här att om man är tidig in i ett möte"
  },
  {
    "speaker": null,
    "timestamp": "00:03:29",
    "line": "och så är det en annan person där och så börjar man prata lite,"
  },
  {
    "speaker": null,
    "timestamp": "00:03:32",
    "line": "snacka lite skit och så fortsätter det"
  },
  {
    "speaker": null,
    "timestamp": "00:03:34",
    "line": "tills det har kommit in tre till. Då är det för awkward att hålla kvar den konversationen."
  },
  {
    "speaker": null,
    "timestamp": "00:03:38",
    "line": "Så då blir det bara tyst istället."
  },
  {
    "speaker": null,
    "timestamp": "00:03:40",
    "line": "Ja, verkligen. Det blir väldigt mycket att man sitter."
  },
  {
    "speaker": null,
    "timestamp": "00:03:45",
    "line": "Jag har också gjort det några gånger. Man sitter och börjar prata lite skit."
  },
  {
    "speaker": null,
    "timestamp": "00:03:48",
    "line": "Så kommer in någon ny och bara \"Tjena!\"."
  },
  {
    "speaker": null,
    "timestamp": "00:03:50",
    "line": "Då kan man inte fortsätta på det man var inne på."
  },
  {
    "speaker": null,
    "timestamp": "00:03:52",
    "line": "För de har ju ingen aning."
  },
  {
    "speaker": null,
    "timestamp": "00:03:54",
    "line": "Det känns mycket konstigare än om man skulle göra det på ett riktigt möte."
  },
  {
    "speaker": null,
    "timestamp": "00:03:57",
    "line": "Säg att man kommer först till mötesrummet, pratar lite skit och så kommer in någon annan."
  },
  {
    "speaker": null,
    "timestamp": "00:04:01",
    "line": "Det är inte lika lätt att bjuda in den personen i samtalet tycker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:04:05",
    "line": "Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:04:07",
    "line": "Det blir helt klart lite, det är många nya sociala situationer i det här digitala möten."
  },
  {
    "speaker": null,
    "timestamp": "00:04:15",
    "line": "Vi kanske ska börja med, hur gjorde man innan corona? För min del, det var väldigt mycket plocka upp de små grejerna när man går och hämtar kaffe."
  },
  {
    "speaker": null,
    "timestamp": "00:04:25",
    "line": "Men sen är det ju oerhört mycket att det skedde mer grejer utanför jobbet, så att säga, inom situationstecken."
  },
  {
    "speaker": null,
    "timestamp": "00:04:32",
    "line": "Att man kanske hängde kvar litegrann efter att man slötte jobba för att prata lite skit."
  },
  {
    "speaker": null,
    "timestamp": "00:04:37",
    "line": "Eller det var avs och det var hela den biten som jag tycker har försvunnit extremt mycket nu när man sitter hemma."
  },
  {
    "speaker": null,
    "timestamp": "00:04:45",
    "line": "- Ja, och bara en sån sak som lunch. - Ja, verkligen."
  },
  {
    "speaker": null,
    "timestamp": "00:04:49",
    "line": "För det var ju ofta en så här, folk som, ja men vissa kanske har låda och vissa kanske vill ut och käka."
  },
  {
    "speaker": null,
    "timestamp": "00:04:56",
    "line": "Och så bildas det små gäng och där är det ju mycket att man snackar lite allmänt."
  },
  {
    "speaker": null,
    "timestamp": "00:05:01",
    "line": "Det kan vara relaterat till saker vi sitter med nu men det kan också vara att man lär känna varandra lite."
  },
  {
    "speaker": null,
    "timestamp": "00:05:05",
    "line": "Ja gud, jag kan verkligen verkligen sakna lunchsällskap."
  },
  {
    "speaker": null,
    "timestamp": "00:05:09",
    "line": "Jag vet att i början på hela jobba hemifrån, då gjorde vi ett litet försök på konsultbolaget."
  },
  {
    "speaker": null,
    "timestamp": "00:05:14",
    "line": "att man så här drog igång ett möte på Slackenband som jag ens skulle hoppa in i."
  },
  {
    "speaker": null,
    "timestamp": "00:05:18",
    "line": "Och så att man ibland körde den på lunchen och ibland hade man bara igång"
  },
  {
    "speaker": null,
    "timestamp": "00:05:21",
    "line": "då man inte hade något bättre för sig. Så att man kunde få lite sällskap så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:05:25",
    "line": "Och det var en väldigt bra idé. Det kanske vi borde göra igen."
  },
  {
    "speaker": null,
    "timestamp": "00:05:30",
    "line": "Känner jag när jag säger det nu liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:05:32",
    "line": "Ja, men det var ganska trevligt att bara kunna hoppa in, säga hej."
  },
  {
    "speaker": null,
    "timestamp": "00:05:37",
    "line": "Däremot så tycker jag det är svårare att äta mat remote med folk."
  },
  {
    "speaker": null,
    "timestamp": "00:05:42",
    "line": "För live är det ändå så här, jag äter och så pratar jag när jag har tid att prata."
  },
  {
    "speaker": null,
    "timestamp": "00:05:48",
    "line": "Men nu är det så här, jag vill ändå mjuta för jag vill inte att folk ska behöva ISM Mara lyssna på när jag tuggar typ."
  },
  {
    "speaker": null,
    "timestamp": "00:05:56",
    "line": "Ja, exakt. Jag vet inte. Jag känner att det är mycket svårare nu. Jag ser verkligen fram emot att kunna komma in i ett team"
  },
  {
    "speaker": null,
    "timestamp": "00:06:07",
    "line": "Där man liksom bara \"Ja men man kan åka in till kontoret och lära känna dem där\""
  },
  {
    "speaker": null,
    "timestamp": "00:06:11",
    "line": "Nu är vi tillbaka på det här med att du inte vill tillbaka till kontor"
  },
  {
    "speaker": null,
    "timestamp": "00:06:13",
    "line": "Och jag vill det verkligen"
  },
  {
    "speaker": null,
    "timestamp": "00:06:15",
    "line": "Men den konversationen kanske ska lämnas därhen"
  },
  {
    "speaker": null,
    "timestamp": "00:06:18",
    "line": "Men jag kände verkligen att när jag började nu remote-dås i april"
  },
  {
    "speaker": null,
    "timestamp": "00:06:23",
    "line": "Och sen att jag liksom första gången var in på kontoret och jobbade någon dag där i somras"
  },
  {
    "speaker": null,
    "timestamp": "00:06:27",
    "line": "Så var det liksom, det var först då jag kände att okej nu kommer jag verkligen med i teamet"
  },
  {
    "speaker": null,
    "timestamp": "00:06:33",
    "line": "Alltså nu känner jag mig liksom som att jag har lite självkommunikation med folk"
  },
  {
    "speaker": null,
    "timestamp": "00:06:36",
    "line": "Så att man kan prata med folk om saker som inte är jobb bara."
  },
  {
    "speaker": null,
    "timestamp": "00:06:40",
    "line": "- Ja, alltså inte för att vi ska komma in på det igen, men just att jag spar energi på remote absolut."
  },
  {
    "speaker": null,
    "timestamp": "00:06:49",
    "line": "Men jag har faktiskt också börjat känna den här bristen på att snacka skit med folk på ett ganska avslappnat sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:06:58",
    "line": "För det är också intressant när man liksom får lite bättre kontakt med folk i teamet."
  },
  {
    "speaker": null,
    "timestamp": "00:07:04",
    "line": "i teamet. Det är också då man får mer nyheter och information och också skvaller om man ska vara sån."
  },
  {
    "speaker": null,
    "timestamp": "00:07:13",
    "line": "Men man får liksom lite mera helhet på vart man befinner sig och håller på med. Man blir inbjuden i interna skämt"
  },
  {
    "speaker": null,
    "timestamp": "00:07:21",
    "line": "som \"annars går den över huvudet\" och sådana saker. Den saknar jag faktiskt. Plus att det kan också vara om..."
  },
  {
    "speaker": null,
    "timestamp": "00:07:28",
    "line": "Jag är ju som sagt väldigt ängslig av mig, men om man till exempel går på en avie med någon och så får man lyfta de här ängsliga sakerna och så får man veta att det är inte bara du eller det är inte det här, det här."
  },
  {
    "speaker": null,
    "timestamp": "00:07:38",
    "line": "Det är en sån otroligt skön känsla också att inte vara helt själv."
  },
  {
    "speaker": null,
    "timestamp": "00:07:43",
    "line": "Ja, men verkligen."
  },
  {
    "speaker": null,
    "timestamp": "00:07:44",
    "line": "Nej, men det är ju väldigt sant liksom att avias särskilt kanske är ett väldigt bra tillfälle att kunna prata med folk och vädra saker."
  },
  {
    "speaker": null,
    "timestamp": "00:07:53",
    "line": "Ofta är det saker som dyker upp som man inte har tänkt på att man kanske vill prata om."
  },
  {
    "speaker": null,
    "timestamp": "00:07:58",
    "line": "Eller att man tänker att det här hände och sen råkar man säga det."
  },
  {
    "speaker": null,
    "timestamp": "00:08:01",
    "line": "Och så någon mer som känner igen sig och så bara, plötsligt står man där och pratar om det."
  },
  {
    "speaker": null,
    "timestamp": "00:08:04",
    "line": "Och väldigt mycket bondar över det."
  },
  {
    "speaker": null,
    "timestamp": "00:08:06",
    "line": "- Ja, eller man bara inte..."
  },
  {
    "speaker": null,
    "timestamp": "00:08:09",
    "line": "Som du säger, man måler på någonting i bakhuvudet som man aldrig hade vågat städa upp på arbetstid."
  },
  {
    "speaker": null,
    "timestamp": "00:08:16",
    "line": "- Nej, sen tycker jag..."
  },
  {
    "speaker": null,
    "timestamp": "00:08:20",
    "line": "Men jag tycker att i alla fall i Stockholm så är ju alkoholkulturen bland it-bolag inte optimal."
  },
  {
    "speaker": null,
    "timestamp": "00:08:28",
    "line": "Nej, den är självklar."
  },
  {
    "speaker": null,
    "timestamp": "00:08:32",
    "line": "Ja, exakt. Det är väldigt mycket. Jag har tänkt på hur mycket det var nu."
  },
  {
    "speaker": null,
    "timestamp": "00:08:39",
    "line": "Nu när man jobbar hemma och det inte är så mycket så har det satt i perspektiv hur mycket det var innan."
  },
  {
    "speaker": null,
    "timestamp": "00:08:45",
    "line": "Alla events finns det alkohol på. Oavsett om man går på en meetup eller om man har en av med jobbet eller med konsultbolaget eller om man har en av med kunden."
  },
  {
    "speaker": null,
    "timestamp": "00:09:00",
    "line": "Oavsett vilket it-bolag jag är på så finns det alltid alkohol som är bara att ta i stort sett."
  },
  {
    "speaker": null,
    "timestamp": "00:09:06",
    "line": "Ja, det är verkligen normen. Jag kommer ihåg att det skulle anordnas ett meetup och så skulle inte serveras alkohol."
  },
  {
    "speaker": null,
    "timestamp": "00:09:14",
    "line": "Because reasons. Och det var verkligen så här, okej, jag tror ändå att vi kanske ska tydliggöra att det inte kommer serveras alkohol."
  },
  {
    "speaker": null,
    "timestamp": "00:09:23",
    "line": "Inte för att det är ett problem, men jag tror att det är för att förvänta när det är där. Och om man inte förvarnar om det så kommer folk kanske bli lite så här,"
  },
  {
    "speaker": null,
    "timestamp": "00:09:30",
    "line": "kanske inte upprörda, men det blir ändå en sån här grej, tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:09:34",
    "line": "Ja, och det talar väl om att det har blivit lite skevt ändå."
  },
  {
    "speaker": null,
    "timestamp": "00:09:39",
    "line": "Alltså så här, att om man säger att man ska hosta ett event riktat till utvecklare"
  },
  {
    "speaker": null,
    "timestamp": "00:09:44",
    "line": "och man inte ska servera alkohol, så får man känslan att \"ska vi inte förtydliga det här?\""
  },
  {
    "speaker": null,
    "timestamp": "00:09:49",
    "line": "Ja, precis."
  },
  {
    "speaker": null,
    "timestamp": "00:09:51",
    "line": "För att verkligen, liksom, defaulten är att \"ja, det finns alkohol\"."
  },
  {
    "speaker": null,
    "timestamp": "00:09:55",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:09:55",
    "line": "Sen är det ju också så här, för min del så är det ju sällan jag ser något problem"
  },
  {
    "speaker": null,
    "timestamp": "00:10:01",
    "line": "på event som serverar alkohol. Det är ju inte sällan det blir liksom"
  },
  {
    "speaker": null,
    "timestamp": "00:10:05",
    "line": "att det spårar ut totalt medan folk är superfulla."
  },
  {
    "speaker": null,
    "timestamp": "00:10:09",
    "line": "Jag kan inte påstå att jag har sett det någon gång liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:10:11",
    "line": "Men samtidigt så vet man ju att det skapar en otryggare miljö"
  },
  {
    "speaker": null,
    "timestamp": "00:10:16",
    "line": "för andra liksom. Alltså så här, för min del så påverkar det inte så mycket för jag gör det inte."
  },
  {
    "speaker": null,
    "timestamp": "00:10:21",
    "line": "Men säg för kvinnor till exempel eller för andra så kan det ju påverka väldigt mycket att man"
  },
  {
    "speaker": null,
    "timestamp": "00:10:25",
    "line": "vet att okej, det serveras alkohol, folk blir lite mer lössläppta."
  },
  {
    "speaker": null,
    "timestamp": "00:10:29",
    "line": "Och det i sig kan ju vara en tröskel för att ens gå på väntet."
  },
  {
    "speaker": null,
    "timestamp": "00:10:34",
    "line": "Ja, absolut."
  },
  {
    "speaker": null,
    "timestamp": "00:10:36",
    "line": "Och jag menar, det är ju inte, alltså, också hur du påverkar en själv."
  },
  {
    "speaker": null,
    "timestamp": "00:10:40",
    "line": "För att jag är ganska lättpåverkad, men några av mina värsta,"
  },
  {
    "speaker": null,
    "timestamp": "00:10:45",
    "line": "liksom, vad ska man säga, i bakfyller blir det väl,"
  },
  {
    "speaker": null,
    "timestamp": "00:10:50",
    "line": "men är sådana som har varit helt oväntade, för det kommer en oväntad avve."
  },
  {
    "speaker": null,
    "timestamp": "00:10:53",
    "line": "Och sen så åt inte jag någonting på hela dagen."
  },
  {
    "speaker": null,
    "timestamp": "00:10:55",
    "line": "Och sen så var det inte så att jag var dödspackad, men hela min kropp reagerade på att du inte ätit någonting och nu dricker du alkohol."
  },
  {
    "speaker": null,
    "timestamp": "00:11:02",
    "line": "Och det hade du inte planerat att göra. Så nu är de två nästkommande dagarna ner i förräkningen."
  },
  {
    "speaker": null,
    "timestamp": "00:11:08",
    "line": "Ja, men exakt. Och det är väldigt enkelt att falla tillbaka på argumentet att vi är vuxna människor."
  },
  {
    "speaker": null,
    "timestamp": "00:11:16",
    "line": "Vilket självklart är en poäng i det här."
  },
  {
    "speaker": null,
    "timestamp": "00:11:19",
    "line": "Men det är ju som med allt annat som blir strukturellt."
  },
  {
    "speaker": null,
    "timestamp": "00:11:23",
    "line": "Att det kan ju påverka en ändå fast man inte tänker på det."
  },
  {
    "speaker": null,
    "timestamp": "00:11:27",
    "line": "Om normen är att man dricker alkohol, då kanske man dricker alkohol fast man inte 100% vill det själv."
  },
  {
    "speaker": null,
    "timestamp": "00:11:33",
    "line": "- Ja, och jag tror i många sådana här saker så tror jag aldrig att vi egentligen kan glömma bort hur stark gruppkulturen är."
  },
  {
    "speaker": null,
    "timestamp": "00:11:40",
    "line": "Alltså, människor är ju flockdjur."
  },
  {
    "speaker": null,
    "timestamp": "00:11:42",
    "line": "Vi vill inte bli uteslutna i flocken."
  },
  {
    "speaker": null,
    "timestamp": "00:11:44",
    "line": "så vi vill inte sticka ut, vi vill göra det som andra gör för att bli accepterade."
  },
  {
    "speaker": null,
    "timestamp": "00:11:47",
    "line": "Jag tänker så mycket på det, det var någon reklam för, om ni minns, en IQ för alkoholtestgrej,"
  },
  {
    "speaker": null,
    "timestamp": "00:11:53",
    "line": "när det var folk som trugade på kakor."
  },
  {
    "speaker": null,
    "timestamp": "00:11:56",
    "line": "\"Ska du inte ta en? Ta en då, du vill ingen, vad var det? Sharing?\""
  },
  {
    "speaker": null,
    "timestamp": "00:12:02",
    "line": "Det är ju kanske inte så det låter nu, men det blir ju en sån där \"men det är klart du ska ha en öl\"."
  },
  {
    "speaker": null,
    "timestamp": "00:12:07",
    "line": "\"Ta en öl, slappna av lite, sluta koda nu, nu är det dags för öl\"."
  },
  {
    "speaker": null,
    "timestamp": "00:12:12",
    "line": "Ja, verkligen. Det finns ju den kulturen att nu är det fredag, nu tar vi en öl och så pratar vi lite skit istället."
  },
  {
    "speaker": null,
    "timestamp": "00:12:21",
    "line": "Ja, eller vi ska fira någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:12:23",
    "line": "Ja, exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:12:24",
    "line": "Det gör vi också med alkohol."
  },
  {
    "speaker": null,
    "timestamp": "00:12:26",
    "line": "Ja, verkligen. Jag vet kanske inte vad lösningen är på det här. Jag har inget bra alternativ."
  },
  {
    "speaker": null,
    "timestamp": "00:12:33",
    "line": "Det alternativet som finns är att ha fler events utan alkohol."
  },
  {
    "speaker": null,
    "timestamp": "00:12:37",
    "line": "Och kanske inte gå till alkoholen som standard när man ska göra någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:12:42",
    "line": "Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:12:43",
    "line": "Men det är en svår grej."
  },
  {
    "speaker": null,
    "timestamp": "00:12:45",
    "line": "Jag skulle ljuga om jag sa att jag själv inte är en sån som..."
  },
  {
    "speaker": null,
    "timestamp": "00:12:48",
    "line": "Okej, men då kör vi en av."
  },
  {
    "speaker": null,
    "timestamp": "00:12:50",
    "line": "Och på av så dricker man typ alkohol."
  },
  {
    "speaker": null,
    "timestamp": "00:12:53",
    "line": "Jag vet att för ett tag sedan så drack jag julmust."
  },
  {
    "speaker": null,
    "timestamp": "00:12:56",
    "line": "Och då blev det så här..."
  },
  {
    "speaker": null,
    "timestamp": "00:12:57",
    "line": "\"Dricker du julmust?\""
  },
  {
    "speaker": null,
    "timestamp": "00:12:59",
    "line": "Ja, verkligen."
  },
  {
    "speaker": null,
    "timestamp": "00:13:01",
    "line": "Jag är ju 100% skyldig till att driva den här problematiken framåt också."
  },
  {
    "speaker": null,
    "timestamp": "00:13:07",
    "line": "Jag har garanterat sagt sådana saker som \"Jaha, dricker du jul mest?\" utan att tänka på det."
  },
  {
    "speaker": null,
    "timestamp": "00:13:13",
    "line": "För att det är normen att man dricker alkohol."
  },
  {
    "speaker": null,
    "timestamp": "00:13:15",
    "line": "Sen tror jag att det är bättre på det idag än förut."
  },
  {
    "speaker": null,
    "timestamp": "00:13:17",
    "line": "Men definitivt att man ändå tänker, om jag ska gå på en meetup så tänker jag \"Det finns nog öl där\"."
  },
  {
    "speaker": null,
    "timestamp": "00:13:23",
    "line": "- Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:13:24",
    "line": "Det är så sjukt varje gång jag känner själv hur jag reagerar på att någon inte dricker alkohol."
  },
  {
    "speaker": null,
    "timestamp": "00:13:29",
    "line": "Innan ni hinner stoppa det ur munnen så kanske det kommer en sån här \"Jasså?\""
  },
  {
    "speaker": null,
    "timestamp": "00:13:33",
    "line": "Ja, exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:13:35",
    "line": "Men varför?"
  },
  {
    "speaker": null,
    "timestamp": "00:13:37",
    "line": "Och så kan man komma på sig själv och bara \"Varför sa jag ens det där för?\""
  },
  {
    "speaker": null,
    "timestamp": "00:13:39",
    "line": "Ja, och så måste de försvara det. \"Ja men jag kör.\""
  },
  {
    "speaker": null,
    "timestamp": "00:13:41",
    "line": "Det spelar väl ingen roll. Du behöver inte dricka alkohol om du inte vill göra det."
  },
  {
    "speaker": null,
    "timestamp": "00:13:45",
    "line": "Jag ska inte komma och kommentera på det."
  },
  {
    "speaker": null,
    "timestamp": "00:13:47",
    "line": "Nej, det är så jävla skevt på något sätt att vi har hamnat där."
  },
  {
    "speaker": null,
    "timestamp": "00:13:53",
    "line": "Det är såklart ett större problem, även utanför it-bolag förmodligen."
  },
  {
    "speaker": null,
    "timestamp": "00:13:58",
    "line": "Men jag tror ändå att det är extra starkt bland it-bolag."
  },
  {
    "speaker": null,
    "timestamp": "00:14:00",
    "line": "Det blir en \"perk\" bland bolag, att \"vi har en ölkyl\"."
  },
  {
    "speaker": null,
    "timestamp": "00:14:05",
    "line": "Det är definitivt något som lockade mig när jag bytte till vårt bolag."
  },
  {
    "speaker": null,
    "timestamp": "00:14:10",
    "line": "\"Ja, men det finns en kyl.\""
  },
  {
    "speaker": null,
    "timestamp": "00:14:12",
    "line": "Men det trycktes ju inte på att \"vi har en ölkyl\"."
  },
  {
    "speaker": null,
    "timestamp": "00:14:16",
    "line": "Det gjorde det inte, utan den fanns med där."
  },
  {
    "speaker": null,
    "timestamp": "00:14:19",
    "line": "Men det var ju inte så att jag inte tänkte att \"ah, ölkyl\"."
  },
  {
    "speaker": null,
    "timestamp": "00:14:23",
    "line": "Sen kan det ju också vara för att mitt förra bolag inte hade."
  },
  {
    "speaker": null,
    "timestamp": "00:14:25",
    "line": "Och då blev det liksom som så här gräset i grönare på andra sidan-grej."
  },
  {
    "speaker": null,
    "timestamp": "00:14:29",
    "line": "Att \"ja, de har ölkyl\". Det är lite hippt och coolt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:32",
    "line": "I själva verket har alla det, i stort sett."
  },
  {
    "speaker": null,
    "timestamp": "00:14:34",
    "line": "Men jag tror ändå att det är en problematik man ska behöva prata om mer."
  },
  {
    "speaker": null,
    "timestamp": "00:14:39",
    "line": "Inte för att folk ska ta bort ölkylarna."
  },
  {
    "speaker": null,
    "timestamp": "00:14:43",
    "line": "Det är liksom inte det här jag vill."
  },
  {
    "speaker": null,
    "timestamp": "00:14:44",
    "line": "Utan mer att man pratar om att det är okej att inte dricka alkohol åt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:48",
    "line": "Man ska normalisera det här lite mer än vad vi har gjort."
  },
  {
    "speaker": null,
    "timestamp": "00:14:50",
    "line": "Ja, precis. Att vi kommer bort från att det är vårt default."
  },
  {
    "speaker": null,
    "timestamp": "00:14:54",
    "line": "Nu hade jag något jag skulle säga, men jag tappade bort det här fullständigt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:58",
    "line": "Nej, men jag håller med. Man ska komma bort från att man inte ska behöva skriva att det finns ingen alkohol på det här väntet."
  },
  {
    "speaker": null,
    "timestamp": "00:15:06",
    "line": "Just det."
  },
  {
    "speaker": null,
    "timestamp": "00:15:08",
    "line": "Så här. Nu blev det jätteosammanhängande."
  },
  {
    "speaker": null,
    "timestamp": "00:15:13",
    "line": "Men det jag tänkte på var att det inte ska vara det fålt."
  },
  {
    "speaker": null,
    "timestamp": "00:15:17",
    "line": "Och det kanske inte är så att det ska behövas så."
  },
  {
    "speaker": null,
    "timestamp": "00:15:19",
    "line": "Men jag tycker det är sorgligt nog så, men ofta känner jag ibland när det är"
  },
  {
    "speaker": null,
    "timestamp": "00:15:24",
    "line": "folk jag inte känner eller en mingelevent eller någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:15:28",
    "line": "Då tycker jag ändå att det är lite skönt att det kommer till lite alkohol."
  },
  {
    "speaker": null,
    "timestamp": "00:15:32",
    "line": "För att folk slappnar av mer och för att det inte är lika jobbigt."
  },
  {
    "speaker": null,
    "timestamp": "00:15:37",
    "line": "Ja, men verkligen. För att generalisera så är det ju så att"
  },
  {
    "speaker": null,
    "timestamp": "00:15:40",
    "line": "får folk i sig en öl eller två, eller vad man nu dricker"
  },
  {
    "speaker": null,
    "timestamp": "00:15:44",
    "line": "så kommer det förmodligen vara liksom"
  },
  {
    "speaker": null,
    "timestamp": "00:15:47",
    "line": "folk kommer uppskatta eventet mer."
  },
  {
    "speaker": null,
    "timestamp": "00:15:49",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:15:51",
    "line": "Och det är ju också sorgligt i sig. Men, men"
  },
  {
    "speaker": null,
    "timestamp": "00:15:53",
    "line": "jag tror ändå att man ska försöka liksom att"
  },
  {
    "speaker": null,
    "timestamp": "00:15:56",
    "line": "just för kanske att liksom så här"
  },
  {
    "speaker": null,
    "timestamp": "00:15:58",
    "line": "förenkla för att liksom undvika grupptrycket"
  },
  {
    "speaker": null,
    "timestamp": "00:16:01",
    "line": "och allting sånt så vill man liksom bara så här"
  },
  {
    "speaker": null,
    "timestamp": "00:16:04",
    "line": "\"Kör något alkoholfritt event då och då, utan att skriva till Alkoholfritt för den delen.\""
  },
  {
    "speaker": null,
    "timestamp": "00:16:09",
    "line": "\"Bara kör eventen och sen behöver man inte servera alkohol på varenda mingel.\""
  },
  {
    "speaker": null,
    "timestamp": "00:16:13",
    "line": "\"Utan det tror jag är ett ganska bra steg att göra.\""
  },
  {
    "speaker": null,
    "timestamp": "00:16:17",
    "line": "- Ja, jag undrar hur det slår."
  },
  {
    "speaker": null,
    "timestamp": "00:16:21",
    "line": "- Ja, gud ja. Men det kan ju vara en smäll man kan ta."
  },
  {
    "speaker": null,
    "timestamp": "00:16:25",
    "line": "Man kan ju ta den smällen för att..."
  },
  {
    "speaker": null,
    "timestamp": "00:16:27",
    "line": "Om man tänker att folk inte uppskattar det så kan man ju säga att"
  },
  {
    "speaker": null,
    "timestamp": "00:16:31",
    "line": "\"Nej, det finns ingen alkohol. Vi hoppar vidare idag.\""
  },
  {
    "speaker": null,
    "timestamp": "00:16:33",
    "line": "Och visst att folk kanske tycker..."
  },
  {
    "speaker": null,
    "timestamp": "00:16:38",
    "line": "Det beror lite på vad syftet med eventet är såklart."
  },
  {
    "speaker": null,
    "timestamp": "00:16:40",
    "line": "Men säg att det är ett rekryteringsevent, då skulle jag ju känna..."
  },
  {
    "speaker": null,
    "timestamp": "00:16:44",
    "line": "Ja, men om du är en person som måste ha alkohol varje event..."
  },
  {
    "speaker": null,
    "timestamp": "00:16:49",
    "line": "Du behöver inte börja jobba här."
  },
  {
    "speaker": null,
    "timestamp": "00:16:51",
    "line": "Alltså, helt ärligt."
  },
  {
    "speaker": null,
    "timestamp": "00:16:53",
    "line": "Tycker man liksom att..."
  },
  {
    "speaker": null,
    "timestamp": "00:16:56",
    "line": "Ja, men okej. Då är det ju fine."
  },
  {
    "speaker": null,
    "timestamp": "00:16:58",
    "line": "Och då kanske det funkar."
  },
  {
    "speaker": null,
    "timestamp": "00:16:59",
    "line": "Men absolut att man kanske tappar folk på det."
  },
  {
    "speaker": null,
    "timestamp": "00:17:02",
    "line": "Ja, det är en intressant sak. Jag tycker du har helt rätt att vi ska ha fler event utan det."
  },
  {
    "speaker": null,
    "timestamp": "00:17:12",
    "line": "Men det blir också en sån statement nu."
  },
  {
    "speaker": null,
    "timestamp": "00:17:18",
    "line": "Ja, exakt. Men det betyder också inte att man kan tänka på att det finns jättemycket alkoholfria alternativ idag."
  },
  {
    "speaker": null,
    "timestamp": "00:17:25",
    "line": "Det betyder ju inte att ta bort ölen eller vinet eller vad som helst."
  },
  {
    "speaker": null,
    "timestamp": "00:17:29",
    "line": "att servera alkoholfritt bara."
  },
  {
    "speaker": null,
    "timestamp": "00:17:31",
    "line": "Och då kommer det inte, alltså,"
  },
  {
    "speaker": null,
    "timestamp": "00:17:33",
    "line": "visst, folk kommer reagera på att det är alkoholfritt,"
  },
  {
    "speaker": null,
    "timestamp": "00:17:35",
    "line": "men det kommer se likadant ut fortfarande."
  },
  {
    "speaker": null,
    "timestamp": "00:17:37",
    "line": "Folk kommer stå där med sina öl,"
  },
  {
    "speaker": null,
    "timestamp": "00:17:39",
    "line": "eller med sitt glas vin, eller vad man nu dricker."
  },
  {
    "speaker": null,
    "timestamp": "00:17:41",
    "line": "Och så kommer man liksom köra på det."
  },
  {
    "speaker": null,
    "timestamp": "00:17:43",
    "line": "Men det är absolut att det kommer uppfattas som ett statement."
  },
  {
    "speaker": null,
    "timestamp": "00:17:45",
    "line": "Även ännu mer om man bara har alkoholfri alternativ, kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:17:48",
    "line": "- Ja, men det är också kul, för att även om man säger att man tar bilder på det där, liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:17:52",
    "line": "Alltså, folk har firat att du bara har druckit alkoholfritt bubbel,"
  },
  {
    "speaker": null,
    "timestamp": "00:17:55",
    "line": "och så lägger man upp det."
  },
  {
    "speaker": null,
    "timestamp": "00:17:57",
    "line": "- Men alkoholfritt så ser det ju ut kanske. Sen sänder det ut vissa signaler, en viss image."
  },
  {
    "speaker": null,
    "timestamp": "00:18:03",
    "line": "- Ja, gud ja. Det är väldigt, väldigt sant. Det är också tänkt på att även om man dricker alkoholfritt en tisdag eftermiddag och skålar i."
  },
  {
    "speaker": null,
    "timestamp": "00:18:12",
    "line": "Och så lägger man upp en bild på det här, då kommer folk att tro att de dricker bubbel på en tisdag."
  },
  {
    "speaker": null,
    "timestamp": "00:18:16",
    "line": "- Ja. - Ja, nej, det är inte riktigt sant, men absolut."
  },
  {
    "speaker": null,
    "timestamp": "00:18:20",
    "line": "Och det talar det också för hela den här normen som vi pratar om. Det är defaulten att det är alkohol."
  },
  {
    "speaker": null,
    "timestamp": "00:18:25",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:18:26",
    "line": "Ja, för att knyta tillbaka litegrann till det vi pratade om att komma in i team"
  },
  {
    "speaker": null,
    "timestamp": "00:18:31",
    "line": "så tror jag att liksom"
  },
  {
    "speaker": null,
    "timestamp": "00:18:32",
    "line": "de här eventsen, alltså A-V sånt, är ändå sjukt viktiga"
  },
  {
    "speaker": null,
    "timestamp": "00:18:37",
    "line": "för att komma in i teamen."
  },
  {
    "speaker": null,
    "timestamp": "00:18:39",
    "line": "Alltså såhär, jag tycker att jag lär känna mest folk när man sitter och dricker en öl"
  },
  {
    "speaker": null,
    "timestamp": "00:18:43",
    "line": "tillsammans."
  },
  {
    "speaker": null,
    "timestamp": "00:18:44",
    "line": "Sen behöver det kanske då inte vara en öl för att"
  },
  {
    "speaker": null,
    "timestamp": "00:18:48",
    "line": "för att fortsätta hålla min poäng utan att bara ändra mig för fem sekunder."
  },
  {
    "speaker": null,
    "timestamp": "00:18:52",
    "line": "Men liksom"
  },
  {
    "speaker": null,
    "timestamp": "00:18:54",
    "line": "Jag tror ändå att det är där jag lär känna folk."
  },
  {
    "speaker": null,
    "timestamp": "00:18:56",
    "line": "Inte när man kanske skriver så mycket kåt tillsammans."
  },
  {
    "speaker": null,
    "timestamp": "00:18:58",
    "line": "Alltså visst, då jobbar man ihop och man fattar hur man kanske funkar mer."
  },
  {
    "speaker": null,
    "timestamp": "00:19:02",
    "line": "Men att lära känna en person så man kan prata med den och skämta med den och sådana saker"
  },
  {
    "speaker": null,
    "timestamp": "00:19:05",
    "line": "så handlar det för min del mer om att, liksom, ja, prata skit."
  },
  {
    "speaker": null,
    "timestamp": "00:19:11",
    "line": "- Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:19:13",
    "line": "Men tycker du, eller har du väldigt lätt för att komma in i team?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:16",
    "line": "Tycker du alltid att du kommer in i teamet, liksom?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:19",
    "line": "Ja, hittills i alla fall skulle jag kanske säga."
  },
  {
    "speaker": null,
    "timestamp": "00:19:24",
    "line": "Men jag är också en väldigt..."
  },
  {
    "speaker": null,
    "timestamp": "00:19:26",
    "line": "Jag har lätt att skämta, jag har lätt att driva med mig själv, vilket jag tror är ett bra sätt att avdramatisera situationer."
  },
  {
    "speaker": null,
    "timestamp": "00:19:36",
    "line": "Om folk märker att jag driver med mig själv, att jag har självdistans, så vågar de också skämta med mig."
  },
  {
    "speaker": null,
    "timestamp": "00:19:41",
    "line": "Och då tror jag att man bondar ganska mycket över det här."
  },
  {
    "speaker": null,
    "timestamp": "00:19:44",
    "line": "Sen är det klart att man klickar inte alltid med alla."
  },
  {
    "speaker": null,
    "timestamp": "00:19:46",
    "line": "Men ofta ska man hitta de människor man känner att \"ja men nu har jag liksom\""
  },
  {
    "speaker": null,
    "timestamp": "00:19:51",
    "line": "ändå, de behandlar mig som en i teamet."
  },
  {
    "speaker": null,
    "timestamp": "00:19:53",
    "line": "- Ja det är intressant det där."
  },
  {
    "speaker": null,
    "timestamp": "00:19:59",
    "line": "Just att du skämtar med dig själv och det gör det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:02",
    "line": "För att jag gör ju också det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:04",
    "line": "Det är ju som någon typ av försvarsmekanism tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:20:08",
    "line": "Och det kan ju ibland göra att jag inte kommer in i teamet istället."
  },
  {
    "speaker": null,
    "timestamp": "00:20:13",
    "line": "Ja, hur vill du utveckla?"
  },
  {
    "speaker": null,
    "timestamp": "00:20:17",
    "line": "Nej men jag tror, oftast så funkar det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:19",
    "line": "Men det är också när jag blir riktigt nervös, då märker jag att jag gör det lite för mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:20:24",
    "line": "Och då blir det snarare så att folk vet inte vad de ska göra av sig själva om jag har sagt att jag är dålig 500 gånger."
  },
  {
    "speaker": null,
    "timestamp": "00:20:29",
    "line": "Ja, det här menar jag absolut."
  },
  {
    "speaker": null,
    "timestamp": "00:20:32",
    "line": "Men där är det också, är det verkligen helt samma sak som att du skämtar med dig själv?"
  },
  {
    "speaker": null,
    "timestamp": "00:20:38",
    "line": "Ja men typ såhär, ja men jag fattar ingenting."
  },
  {
    "speaker": null,
    "timestamp": "00:20:43",
    "line": "Nej men kontextuellt, nu är det tagit i kontext."
  },
  {
    "speaker": null,
    "timestamp": "00:20:47",
    "line": "Men om någon frågar, är allting glasklart?"
  },
  {
    "speaker": null,
    "timestamp": "00:20:51",
    "line": "Ja nej, det är ingenting som är glasklart."
  },
  {
    "speaker": null,
    "timestamp": "00:20:54",
    "line": "Ja men jag förstår."
  },
  {
    "speaker": null,
    "timestamp": "00:20:56",
    "line": "Ja men absolut, då kanske de känner såhär, oj."
  },
  {
    "speaker": null,
    "timestamp": "00:21:00",
    "line": "De kanske känner det som mer kritik mot sig själv också."
  },
  {
    "speaker": null,
    "timestamp": "00:21:04",
    "line": "Ja, kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:21:07",
    "line": "Som sagt, vi kan inte kontexten riktigt här."
  },
  {
    "speaker": null,
    "timestamp": "00:21:11",
    "line": "- Det är ett jättedåligt exempel. - Det är lättkänt så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:21:17",
    "line": "Jag förstår ändå vad du menar. Det handlar också om vad man räknar som att komma in i teamet."
  },
  {
    "speaker": null,
    "timestamp": "00:21:25",
    "line": "För min del handlar det mycket om att jag känner att jag har en bra jargong mellan de jag jobbar med."
  },
  {
    "speaker": null,
    "timestamp": "00:21:31",
    "line": "att jag inkluderas i vad vi ska göra och sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:21:34",
    "line": "Att man inte blir personen som \"du sitter där och vi pratar över dig\"."
  },
  {
    "speaker": null,
    "timestamp": "00:21:40",
    "line": "Utan det är mer att man är med i diskussionerna,"
  },
  {
    "speaker": null,
    "timestamp": "00:21:43",
    "line": "även om man kanske inte fattar allt."
  },
  {
    "speaker": null,
    "timestamp": "00:21:44",
    "line": "Man är med i diskussionerna och åsikten värderas."
  },
  {
    "speaker": null,
    "timestamp": "00:21:48",
    "line": "- Känner du någonsin att du formar om dig för att passa in i teamet?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:53",
    "line": "- Nej, jag försöker väl undvika det i alla fall."
  },
  {
    "speaker": null,
    "timestamp": "00:21:59",
    "line": "Jag tror inte att jag gjort det hittills."
  },
  {
    "speaker": null,
    "timestamp": "00:22:02",
    "line": "Det är alltid svårt att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:22:07",
    "line": "När jag började med att programmera till exempel"
  },
  {
    "speaker": null,
    "timestamp": "00:22:09",
    "line": "Då kanske man fick anpassa sig lite grann efter det arbetssättet mer"
  },
  {
    "speaker": null,
    "timestamp": "00:22:13",
    "line": "Och hur det teamet funkar ihop."
  },
  {
    "speaker": null,
    "timestamp": "00:22:16",
    "line": "I vanliga fall kanske jag skämtar ännu mer"
  },
  {
    "speaker": null,
    "timestamp": "00:22:18",
    "line": "när jag jobbar nära någon"
  },
  {
    "speaker": null,
    "timestamp": "00:22:20",
    "line": "än vad jag gjorde då"
  },
  {
    "speaker": null,
    "timestamp": "00:22:22",
    "line": "Men i och med att man sitter och jobbar så pass mycket"
  },
  {
    "speaker": null,
    "timestamp": "00:22:23",
    "line": "Då sitter man ju verkligen tillsammans och jobbar"
  },
  {
    "speaker": null,
    "timestamp": "00:22:26",
    "line": "Då kan inte jag dra en massa skämt hela tiden"
  },
  {
    "speaker": null,
    "timestamp": "00:22:28",
    "line": "Utan då kanske man får dra tillbaka det lite grann."
  },
  {
    "speaker": null,
    "timestamp": "00:22:30",
    "line": "Och det tog det väl ett tag att komma in i."
  },
  {
    "speaker": null,
    "timestamp": "00:22:32",
    "line": "Men det handlar ju mest om att teamen ska hålla fokus."
  },
  {
    "speaker": null,
    "timestamp": "00:22:37",
    "line": "Och det är väl samma sak när man parprogrammerar till exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:22:40",
    "line": "Men annars tror jag inte att det har anpassat mig så mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:22:42",
    "line": "- Jag tycker bara att det är intressant för att jag har märkt det."
  },
  {
    "speaker": null,
    "timestamp": "00:22:48",
    "line": "Jag har funderat ganska mycket på det på sistone."
  },
  {
    "speaker": null,
    "timestamp": "00:22:50",
    "line": "att det är tydligt för mig att jag belyser vissa aspekter i mitt liv när jag kommer in i ett visst typ av team."
  },
  {
    "speaker": null,
    "timestamp": "00:22:59",
    "line": "Säg att jag kommer in i ett team som är väldigt traditionellt snubbigt och pratar om väldigt traditionellt,"
  },
  {
    "speaker": null,
    "timestamp": "00:23:08",
    "line": "alltså ur genusperspektiv, saker som anses snubbiga eller manliga intressen."
  },
  {
    "speaker": null,
    "timestamp": "00:23:15",
    "line": "Det kan vara bilar, det kan vara whisky, det kan vara styrketräning."
  },
  {
    "speaker": null,
    "timestamp": "00:23:19",
    "line": "Då märker jag väldigt tydligt att om jag fokuserar på dem, då kan jag vara med i diskussionen."
  },
  {
    "speaker": null,
    "timestamp": "00:23:25",
    "line": "Men om jag pratar om någonting som inte är riktigt lika allmänt vedertaget för dem, då är jag ute."
  },
  {
    "speaker": null,
    "timestamp": "00:23:33",
    "line": "Ja, för det där känns ju också som en helt annan utmaning som jag aldrig har."
  },
  {
    "speaker": null,
    "timestamp": "00:23:38",
    "line": "Just för att traditionella utvecklare och team är ju väldigt snubbiga, så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:23:45",
    "line": "Och det är ju en kontext jag smälter in i väldigt enkelt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:51",
    "line": "Även om jag kanske själv inte beskriver mig som så snubbig."
  },
  {
    "speaker": null,
    "timestamp": "00:23:54",
    "line": "Så är det ju väldigt lätt för alla män att klara sig i en kontext som är snubbig i stort sett."
  },
  {
    "speaker": null,
    "timestamp": "00:24:00",
    "line": "Och det är en utmaning jag aldrig har. Jag är så oerhört privilegierad."
  },
  {
    "speaker": null,
    "timestamp": "00:24:07",
    "line": "Jag är vit man, snart medelålders kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:24:12",
    "line": "Medelålders?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:14",
    "line": "Jag vet inte riktigt var gränsen går där."
  },
  {
    "speaker": null,
    "timestamp": "00:24:16",
    "line": "Men jag är lång, rätt rolig."
  },
  {
    "speaker": null,
    "timestamp": "00:24:19",
    "line": "Och det är en utmaning jag aldrig behöver ta mig över."
  },
  {
    "speaker": null,
    "timestamp": "00:24:26",
    "line": "för många andra, som dig till exempel, så blir det ju att man måste ta sig över den tröskeln också för att komma in i teamet."
  },
  {
    "speaker": null,
    "timestamp": "00:24:33",
    "line": "Alltså du måste också, du kanske kommer in i teamet och inte identifierar dig alls med någon i teamet."
  },
  {
    "speaker": null,
    "timestamp": "00:24:37",
    "line": "Medan för mig så finns det ofta, alltid någon som är lik mig så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:24:42",
    "line": "Ja just det, det är intressant. Det har jag inte tänkt på. Det är väldigt sällan jag hittar någon specifikt och identifierar mig med i ett team."
  },
  {
    "speaker": null,
    "timestamp": "00:24:51",
    "line": "Men det blir, ja, det är svårt för jag har ju också befunnit mig i världen med få kvinnor,"
  },
  {
    "speaker": null,
    "timestamp": "00:25:05",
    "line": "och i Sverige där jag kanske inte ser ut att komma från Sverige alltid och sådana saker."
  },
  {
    "speaker": null,
    "timestamp": "00:25:12",
    "line": "Jag tror att jag anpassar mig väldigt mycket till kontexten som vi befinner oss i på gott och ont."
  },
  {
    "speaker": null,
    "timestamp": "00:25:21",
    "line": "Dels så här, belysa de intressena och prata om dem."
  },
  {
    "speaker": null,
    "timestamp": "00:25:24",
    "line": "Då brer jag gärna på och snubbar på."
  },
  {
    "speaker": null,
    "timestamp": "00:25:27",
    "line": "Det är inte heller något jag är stolt över att jag gör."
  },
  {
    "speaker": null,
    "timestamp": "00:25:30",
    "line": "Ibland kommer det ut opassande skämt ur mig."
  },
  {
    "speaker": null,
    "timestamp": "00:25:34",
    "line": "Då måste jag gräva ner mig och fundera på, har jag tappat bort mig själv här nu?"
  },
  {
    "speaker": null,
    "timestamp": "00:25:38",
    "line": "Var det värt det?"
  },
  {
    "speaker": null,
    "timestamp": "00:25:41",
    "line": "- Ja, men exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:43",
    "line": "Det känns som att..."
  },
  {
    "speaker": null,
    "timestamp": "00:25:45",
    "line": "Din fråga som du ställde till mig innan, om jag förändrar mig för Tim, det känns som att du kanske lättare hamnar där."
  },
  {
    "speaker": null,
    "timestamp": "00:25:50",
    "line": "För att du..."
  },
  {
    "speaker": null,
    "timestamp": "00:25:51",
    "line": "Som sagt, inte har någon att identifiera med."
  },
  {
    "speaker": null,
    "timestamp": "00:25:54",
    "line": "Du kanske kommer in i en kontext där du inte är normen."
  },
  {
    "speaker": null,
    "timestamp": "00:25:57",
    "line": "Men för mig behöver jag inte förändra mig så mycket, för att jag kommer in och..."
  },
  {
    "speaker": null,
    "timestamp": "00:26:00",
    "line": "Ja, de förväntar sig ungefär att jag är som jag är."
  },
  {
    "speaker": null,
    "timestamp": "00:26:02",
    "line": "Och jag passar liksom in i den gruppen människor automatiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:26:05",
    "line": "- Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:26:07",
    "line": "- Och det är ju också jävligt trist."
  },
  {
    "speaker": null,
    "timestamp": "00:26:10",
    "line": "Fan."
  },
  {
    "speaker": null,
    "timestamp": "00:26:11",
    "line": "- Ja, men vissa gånger är det kanske också i mitt egna huvud att det känns som att jag inte passar in."
  },
  {
    "speaker": null,
    "timestamp": "00:26:17",
    "line": "För att man har fått feedback på att \"ja, men det känns som att du verkligen kom in och blev en i gänget\"."
  },
  {
    "speaker": null,
    "timestamp": "00:26:21",
    "line": "Jag har ått lunch själv här borta, men okej."
  },
  {
    "speaker": null,
    "timestamp": "00:26:25",
    "line": "- Ja, så är det absolut. Men det kan också vara för att du blir lite betingad."
  },
  {
    "speaker": null,
    "timestamp": "00:26:30",
    "line": "Säg att det oftast är så. Om du känner att du inte passar in så kanske det är sant."
  },
  {
    "speaker": null,
    "timestamp": "00:26:36",
    "line": "Och då blir det ju ofta så att varje gång du tänker det så är det sant."
  },
  {
    "speaker": null,
    "timestamp": "00:26:40",
    "line": "Medan det kanske inte är så alltid."
  },
  {
    "speaker": null,
    "timestamp": "00:26:44",
    "line": "Och kanske har blivit bättre på sistone, jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:26:46",
    "line": "Alltså det känns som att it-branschen går åt rätt håll."
  },
  {
    "speaker": null,
    "timestamp": "00:26:48",
    "line": "Men det är så jävla mycket kvar också, jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:26:52",
    "line": "- Ja, vi behöver inte gå in på det. - Det är ett helt eget avsnitt."
  },
  {
    "speaker": null,
    "timestamp": "00:26:57",
    "line": "- Ja, jag tror också det går åt rätt håll."
  },
  {
    "speaker": null,
    "timestamp": "00:26:59",
    "line": "Det var kul när du säger det, för jag funderade lite på det på sistone som jag sa."
  },
  {
    "speaker": null,
    "timestamp": "00:27:02",
    "line": "När jag började i samma team med en normativ vit man,"
  },
  {
    "speaker": null,
    "timestamp": "00:27:09",
    "line": "då kom jag ihåg att det var så mycket, det kändes som om jag satt på utsidan"
  },
  {
    "speaker": null,
    "timestamp": "00:27:12",
    "line": "och tittade in på deras konversation hela tiden."
  },
  {
    "speaker": null,
    "timestamp": "00:27:14",
    "line": "De pratade om fotboll och de körde företagets bandy-matcher på sidan av"
  },
  {
    "speaker": null,
    "timestamp": "00:27:21",
    "line": "och de pratade om det och det och jag satt där för mig själv"
  },
  {
    "speaker": null,
    "timestamp": "00:27:24",
    "line": "och bara \"Jag är så orelevant här, jag har ingenting\"."
  },
  {
    "speaker": null,
    "timestamp": "00:27:30",
    "line": "Ja, det är som sagt väldigt stor skillnad på vem man är och hur man kommer in i team."
  },
  {
    "speaker": null,
    "timestamp": "00:27:38",
    "line": "För mig förmodligen relativt mycket enklare än för andra."
  },
  {
    "speaker": null,
    "timestamp": "00:27:44",
    "line": "Och för din del så kanske det är en mycket högre tröskel just för att team idag ser ut som de gör."
  },
  {
    "speaker": null,
    "timestamp": "00:27:50",
    "line": "Ja, men sen så skulle jag ju säga att jag har inte superproblem att komma in i team ändå, känner jag."
  },
  {
    "speaker": null,
    "timestamp": "00:27:58",
    "line": "Men det är väl mer den här kanske att jag skalar bort ena sidan av mig själv på ett annat sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:04",
    "line": "Och sen i vissa sammanhang passar jag inte alls in."
  },
  {
    "speaker": null,
    "timestamp": "00:28:08",
    "line": "Jag menar, herregud, jag är så konstig."
  },
  {
    "speaker": null,
    "timestamp": "00:28:10",
    "line": "Och det är väl också okej. Och i vissa sammanhang kanske jag bara är den som påpekar saker som ingen vill ha påpekade."
  },
  {
    "speaker": null,
    "timestamp": "00:28:18",
    "line": "Men jag tror generellt sett att jag ändå brukar hitta min plats i team."
  },
  {
    "speaker": null,
    "timestamp": "00:28:23",
    "line": "Men snarare kanske att teamet tycker att jag passar väl in, medan jag vet att jag inte gör det egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:28:29",
    "line": "Ja, men exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:31",
    "line": "Det blir ju liksom att du är lite mer kameleont."
  },
  {
    "speaker": null,
    "timestamp": "00:28:36",
    "line": "Ja, men kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:28:37",
    "line": "Du är grön egentligen, men i det här teamet så färger du dig rosa."
  },
  {
    "speaker": null,
    "timestamp": "00:28:41",
    "line": "Precis så."
  },
  {
    "speaker": null,
    "timestamp": "00:28:43",
    "line": "Kanske den bästa liknelsen jag gjort i hela mitt liv, tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:28:45",
    "line": "Jag tror den är bra att avsluta på ändå."
  },
  {
    "speaker": null,
    "timestamp": "00:28:47",
    "line": "Ja, jag tror att det var... Vi kan inte toppa det."
  },
  {
    "speaker": null,
    "timestamp": "00:28:50",
    "line": "Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:28:51",
    "line": "Som vanligt vill man ha så finns vi på Twitter. Länkarna ligger i beskrivningen."
  },
  {
    "speaker": null,
    "timestamp": "00:28:55",
    "line": "Ge oss gärna en recension på iTunes. Det gör mig väldigt glad i alla fall."
  },
  {
    "speaker": null,
    "timestamp": "00:29:00",
    "line": "Och jag är ju en kameliont, så det gör mig glad också i den här kontexten."
  },
  {
    "speaker": null,
    "timestamp": "00:29:04",
    "line": "Vi ses så länge."
  },
  {
    "speaker": null,
    "timestamp": "00:29:06",
    "line": "Hej!"
  },
  {
    "speaker": null,
    "timestamp": "00:29:07",
    "line": "[Outromusik]"
  }
]