[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Okej, det får nog bli på göteborska om jag kan framordna någon göteborska."
  },
  {
    "speaker": null,
    "timestamp": "00:00:04",
    "line": "Shoot."
  },
  {
    "speaker": null,
    "timestamp": "00:00:06",
    "line": "Vad dricker programmerarna när de ska ut och flyga?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:12",
    "line": "Jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:00:14",
    "line": "Bash på terminalen."
  },
  {
    "speaker": null,
    "timestamp": "00:00:17",
    "line": "Jaha."
  },
  {
    "speaker": null,
    "timestamp": "00:00:20",
    "line": "Gud, jag fattade inte först. Jag tänkte att skämtet skulle vara bash."
  },
  {
    "speaker": null,
    "timestamp": "00:00:25",
    "line": "Jag trodde att det här var hela grejen."
  },
  {
    "speaker": null,
    "timestamp": "00:00:29",
    "line": "Men när terminalen kom så..."
  },
  {
    "speaker": null,
    "timestamp": "00:00:31",
    "line": "Okej, jag är med. Det var ändå bra."
  },
  {
    "speaker": null,
    "timestamp": "00:00:33",
    "line": "Det är ju bash, bash i terminalen."
  },
  {
    "speaker": null,
    "timestamp": "00:00:37",
    "line": "Exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:39",
    "line": "Jag kopplade bara inte."
  },
  {
    "speaker": null,
    "timestamp": "00:00:41",
    "line": "Bash, bash."
  },
  {
    "speaker": null,
    "timestamp": "00:00:43",
    "line": "Så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:00:45",
    "line": "För jag tänkte bara på det här utan terminalen."
  },
  {
    "speaker": null,
    "timestamp": "00:00:47",
    "line": "Skitsamma."
  },
  {
    "speaker": null,
    "timestamp": "00:00:49",
    "line": "Bra start, känner jag idag."
  },
  {
    "speaker": null,
    "timestamp": "00:00:51",
    "line": "Trots att vi spelade in remote för första gången."
  },
  {
    "speaker": null,
    "timestamp": "00:00:53",
    "line": "Vi spelar in remote för första gången. Jag vet inte om man ska avslösa det här, för det kanske påverkar folk som lyssnar."
  },
  {
    "speaker": null,
    "timestamp": "00:00:57",
    "line": "Jag vet inte. Det är spännande. Det kan gå hur som helst känns det."
  },
  {
    "speaker": null,
    "timestamp": "00:01:02",
    "line": "Det kan gå hur som helst."
  },
  {
    "speaker": null,
    "timestamp": "00:01:04",
    "line": "Vi borde ta det här tillfället i akt att liksom dricka en liten drink samtidigt eller något."
  },
  {
    "speaker": null,
    "timestamp": "00:01:08",
    "line": "Men vi tar det nästa gång."
  },
  {
    "speaker": null,
    "timestamp": "00:01:09",
    "line": "Vi säger väl välkomna till ASDF-avsnitt någonting, någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:01:20",
    "line": "Ja, idag så funderade på vad vi skulle prata om."
  },
  {
    "speaker": null,
    "timestamp": "00:01:25",
    "line": "Jag tänkte att vi kanske kunde prata om, jag läste precis ut en bok som jag lånade av dig,"
  },
  {
    "speaker": null,
    "timestamp": "00:01:31",
    "line": "som heter Technically Wrong."
  },
  {
    "speaker": null,
    "timestamp": "00:01:33",
    "line": "Just det."
  },
  {
    "speaker": null,
    "timestamp": "00:01:34",
    "line": "Och jag har verkligen glömt bort författarnamn och allt möjligt, men det kommer Anton länka sen."
  },
  {
    "speaker": null,
    "timestamp": "00:01:43",
    "line": "Det handlar i alla fall om teknik och teknikens utveckling och de saker som tekniken kan ha missat i sin utveckling för att den utvecklas till stor del av en väldigt homogen grupp."
  },
  {
    "speaker": null,
    "timestamp": "00:01:59",
    "line": "Och vad som kan ske, vilka utmaningar som finns och hur det påverkar den stora massan av människor som faktiskt inte är så homogen som kanske de som skapar tekniken har varit traditionellt."
  },
  {
    "speaker": null,
    "timestamp": "00:02:13",
    "line": "Eller inte traditionellt, men nu för tiden."
  },
  {
    "speaker": null,
    "timestamp": "00:02:16",
    "line": "Ja, jag har också läst den här boken fast det var ett tag sedan nu, det måste ju vara nästan ett halvår sedan eller något. Lite mer kanske till och med."
  },
  {
    "speaker": null,
    "timestamp": "00:02:24",
    "line": "Den kanske inte är riktad till utvecklare egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:02:29",
    "line": "- Nej, det känns mer som att den är riktad till resten av massan."
  },
  {
    "speaker": null,
    "timestamp": "00:02:35",
    "line": "- Ja, exakt. Så man ska få en förståelse för vilken påverkan teknik har på de här ämnena."
  },
  {
    "speaker": null,
    "timestamp": "00:02:44",
    "line": "På det här perspektivet."
  },
  {
    "speaker": null,
    "timestamp": "00:02:46",
    "line": "Ja, den är ju också från några år sedan, typ 2017 eller någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:02:52",
    "line": "Och saker har ju skett sedan dess, men den tar ju upp ändå väldigt intressanta saker som är relevanta nu mer än någonsin, skulle jag säga."
  },
  {
    "speaker": null,
    "timestamp": "00:03:01",
    "line": "Jag har ändå svagt minne av att, blandar jag ihop det här med någon annan bok kanske, att det är något stycke där de pratar om så här \"Jag hoppas det blir bättre\"."
  },
  {
    "speaker": null,
    "timestamp": "00:03:11",
    "line": "Ja, det vet jag inte."
  },
  {
    "speaker": null,
    "timestamp": "00:03:14",
    "line": "Jag kanske blandar ihop den här med en annan bok som heter \"Talk about race\" för jag läste dem typ samtidigt så det kan vara därför."
  },
  {
    "speaker": null,
    "timestamp": "00:03:22",
    "line": "Men jag har för mig att oavsett vilken bok det är så pratar de om så här \"jag hoppas det är om tre år eller något, 2020 är det här att det är bättre då\" och så ser man på allt runt omkring och det är mycket sämre."
  },
  {
    "speaker": null,
    "timestamp": "00:03:35",
    "line": "Ja, men kanske de pratar om presidentvalet som precis skedde då 2016 och det har ändå ändrats nu."
  },
  {
    "speaker": null,
    "timestamp": "00:03:45",
    "line": "Ja, det är väldigt nytt och fräscht så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:03:50",
    "line": "Men ja, i alla fall, grundinnehållet skulle man väl ändå kunna säga att det är ju problematiskt att det är en förhållandevis homogen grupp."
  },
  {
    "speaker": null,
    "timestamp": "00:04:04",
    "line": "Och med homogen grupp menar jag ju i stor del vita män som utvecklar alla typer av produkter."
  },
  {
    "speaker": null,
    "timestamp": "00:04:11",
    "line": "Det kanske till och med är så att den grupperingen är de som behöver tänka minst på situationer och andra saker som kan uppstå eftersom de är högst på privilegiestegen."
  },
  {
    "speaker": null,
    "timestamp": "00:04:31",
    "line": "Ja, men precis."
  },
  {
    "speaker": null,
    "timestamp": "00:04:33",
    "line": "Det blir ju..."
  },
  {
    "speaker": null,
    "timestamp": "00:04:38",
    "line": "Ja, det får en ju direkt att komma in på och fundera på varför ser vår bransch ut som den gör."
  },
  {
    "speaker": null,
    "timestamp": "00:04:49",
    "line": "Det är ganska intressant för vi pratade om det förr. Det visste vi ju att det var ju kvinnor som programmerade."
  },
  {
    "speaker": null,
    "timestamp": "00:04:55",
    "line": "För det var ju ett väldigt kvinnligt yrke när det kom."
  },
  {
    "speaker": null,
    "timestamp": "00:04:58",
    "line": "De var ju miniräknare och programmerare och datorer."
  },
  {
    "speaker": null,
    "timestamp": "00:05:03",
    "line": "Allting vändes."
  },
  {
    "speaker": null,
    "timestamp": "00:05:05",
    "line": "Det kom ju liksom från, alltså så här,"
  },
  {
    "speaker": null,
    "timestamp": "00:05:07",
    "line": "man gick från att vara sekreterare till programmerare, typ."
  },
  {
    "speaker": null,
    "timestamp": "00:05:10",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:05:11",
    "line": "Det vändes ju upp och ner när det kom datorer till hemmet."
  },
  {
    "speaker": null,
    "timestamp": "00:05:16",
    "line": "Pratar man ju om historiskt för att det var så att de marknadsfördes"
  },
  {
    "speaker": null,
    "timestamp": "00:05:22",
    "line": "till män och pojkar."
  },
  {
    "speaker": null,
    "timestamp": "00:05:25",
    "line": "Och där vände ju allting och"
  },
  {
    "speaker": null,
    "timestamp": "00:05:29",
    "line": "programmering och utveckling blev ju ett manligt yrke."
  },
  {
    "speaker": null,
    "timestamp": "00:05:33",
    "line": "- Ja, det är ganska sjukt att tänka på det. Jag vet att det finns någon graf över"
  },
  {
    "speaker": null,
    "timestamp": "00:05:41",
    "line": "andelen kvinnliga utvecklare eller kvinnliga programmerare kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:05:44",
    "line": "Och det är så tydligt att det är"
  },
  {
    "speaker": null,
    "timestamp": "00:05:48",
    "line": "Först en stor majoritet som är det, och sen att det sjunker till nästan inga nivåer alls."
  },
  {
    "speaker": null,
    "timestamp": "00:05:53",
    "line": "För att nu ändå vara lite på väg uppåt igen, även om det inte alls är på samma nivå som tidigare."
  },
  {
    "speaker": null,
    "timestamp": "00:05:58",
    "line": "- Ja, det är intressant för jag hörde en paneldebatt där Melinda Gates ingick."
  },
  {
    "speaker": null,
    "timestamp": "00:06:05",
    "line": "Där hon pratade om att när hon gick på utbildningen, Computer Science-utbildning,"
  },
  {
    "speaker": null,
    "timestamp": "00:06:10",
    "line": "det var liksom piken, var det 80-talet någonstans, det var piken av kvinnor."
  },
  {
    "speaker": null,
    "timestamp": "00:06:16",
    "line": "Om vi nu ska säga en annan grupp som är kvinnor för tech, och det var piken av så många som utbildade sig då."
  },
  {
    "speaker": null,
    "timestamp": "00:06:24",
    "line": "Sedan dess så har det bara gått neråt, tills det stagnerade någonstans här för några år sedan tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:06:31",
    "line": "Ja, jag tycker det är jävligt, alltså det är svårt att förstå, man förstår ju att det är så."
  },
  {
    "speaker": null,
    "timestamp": "00:06:43",
    "line": "Det gör man inte. För det finns så mycket som vägs in i det."
  },
  {
    "speaker": null,
    "timestamp": "00:06:48",
    "line": "Det är på ett så pass strukturellt nivå att det är svårt att säga att det är på grund av det här."
  },
  {
    "speaker": null,
    "timestamp": "00:06:54",
    "line": "- Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:06:57",
    "line": "Det är också..."
  },
  {
    "speaker": null,
    "timestamp": "00:06:59",
    "line": "Jag skulle vilja säga att det är den lågt hängande frukten att dela upp det i kvinnor och män också."
  },
  {
    "speaker": null,
    "timestamp": "00:07:05",
    "line": "För att det är ju så mycket större egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:07:09",
    "line": "Om man ska se det till homogena grupper, så är det en fördelning 50/50 mellan kvinnor och män."
  },
  {
    "speaker": null,
    "timestamp": "00:07:16",
    "line": "Om alla fortsatt skulle vara vita människor så skulle det också vara en väldigt homogen gruppering som skulle missa ganska mycket andra saker."
  },
  {
    "speaker": null,
    "timestamp": "00:07:27",
    "line": "Ja men exakt, för det är en ganska viktig del i det här att det är väldigt lätt att när man pratar om kvinnor så pratar man om vita kvinnor."
  },
  {
    "speaker": null,
    "timestamp": "00:07:37",
    "line": "Som också är en grupp med makt ändå så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:07:44",
    "line": "Jag har lärt mig jävligt mycket senaste året kanske främst, eller senaste två åren i alla fall."
  },
  {
    "speaker": null,
    "timestamp": "00:07:53",
    "line": "Till exempel i den här boken som jag nämnde tidigare, \"Do you want to talk about race?\""
  },
  {
    "speaker": null,
    "timestamp": "00:07:58",
    "line": "Och liksom intersektionalitet är liksom ingenting jag har tänkt på tidigare, det vill säga att"
  },
  {
    "speaker": null,
    "timestamp": "00:08:02",
    "line": "du kan liksom både vara"
  },
  {
    "speaker": null,
    "timestamp": "00:08:04",
    "line": "privilegierad"
  },
  {
    "speaker": null,
    "timestamp": "00:08:05",
    "line": "och drabbas av andras privilegier, så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:08:09",
    "line": "Det är ju"
  },
  {
    "speaker": null,
    "timestamp": "00:08:13",
    "line": "det som är så intressant också, för det är så många när man börjar prata om det här ämnet, det blir väldigt svartvitt."
  },
  {
    "speaker": null,
    "timestamp": "00:08:20",
    "line": "Antingen finns det kvinnor inom tech eller så gör det inte det."
  },
  {
    "speaker": null,
    "timestamp": "00:08:23",
    "line": "Men man har inte en tanke på hela de här bitarna."
  },
  {
    "speaker": null,
    "timestamp": "00:08:26",
    "line": "Och det blir också på något sätt som att..."
  },
  {
    "speaker": null,
    "timestamp": "00:08:28",
    "line": "Jag tänker att vissa kan känna att det blir som en attack på dem."
  },
  {
    "speaker": null,
    "timestamp": "00:08:32",
    "line": "Kanske på dem som befinner sig i yrket och sådana saker."
  },
  {
    "speaker": null,
    "timestamp": "00:08:35",
    "line": "Men det faktum är ju att..."
  },
  {
    "speaker": null,
    "timestamp": "00:08:40",
    "line": "Som man säger ofta..."
  },
  {
    "speaker": null,
    "timestamp": "00:08:42",
    "line": "Det är inte det att vi säger att ditt liv inte kan ha varit jobbigt eller haft utmaningar."
  },
  {
    "speaker": null,
    "timestamp": "00:08:48",
    "line": "när vi pratar om att du eller någon har privilegier, utan det vi säger är att du har de här privilegierna."
  },
  {
    "speaker": null,
    "timestamp": "00:08:57",
    "line": "Avsaknaden av dem har inte varit bidragande till dina utmaningar, så du har i alla fall sluppit i den biten."
  },
  {
    "speaker": null,
    "timestamp": "00:09:04",
    "line": "Ja, men exakt. För det är många som när man pratar om det här som tänker \"ja, men jag har jobbat hårt för mitt jobb, jag har slitit och jag har gjort det här och det där, liksom dittan i datten\"."
  },
  {
    "speaker": null,
    "timestamp": "00:09:14",
    "line": "Och det har man ju säkert gjort."
  },
  {
    "speaker": null,
    "timestamp": "00:09:16",
    "line": "Men det betyder ju då inte att andra kanske har slitit hårdare för att de också har behövt kämpa mot rasism eller sexism eller sådana saker."
  },
  {
    "speaker": null,
    "timestamp": "00:09:26",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:09:28",
    "line": "Så, ja, jag tycker det är lite jobbigt att ta upp det här ämnet i podden även om jag brinner väldigt mycket för det här ämnet."
  },
  {
    "speaker": null,
    "timestamp": "00:09:40",
    "line": "Men det känns rätt minerat ibland, som ett minerat område som man inte riktigt vågar trampa runt hur som helst i."
  },
  {
    "speaker": null,
    "timestamp": "00:09:47",
    "line": "Ja, jag har ju hamnat i den platsen att jag vågar prata om det."
  },
  {
    "speaker": null,
    "timestamp": "00:09:55",
    "line": "Men jag tror att mycket har att göra med att jag har inte drabbats av att prata om det på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:10:02",
    "line": "I och med att jag kommer från en så pass privilegierad position som är vit, man, svensk, bra utbildad, höglön."
  },
  {
    "speaker": null,
    "timestamp": "00:10:11",
    "line": "Jag har så mycket privilegier att jag drunknar nästan."
  },
  {
    "speaker": null,
    "timestamp": "00:10:13",
    "line": "Men det gör ju också att risken för mig att prata om det här är minimal."
  },
  {
    "speaker": null,
    "timestamp": "00:10:20",
    "line": "Jag skulle vilja säga att risken är lite högre för mig."
  },
  {
    "speaker": null,
    "timestamp": "00:10:26",
    "line": "Ja, exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:10:27",
    "line": "Och då förstår man ju att du kanske tvekar lite mer att ta upp det i ett publikt forum som det här är."
  },
  {
    "speaker": null,
    "timestamp": "00:10:36",
    "line": "Även om vi inte har någon miljonpublik så blir det ju ändå att man tar upp det i ett öppet forum så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:10:46",
    "line": "Det där är ju ganska intressant. Om vi tar exempel att det inte finns så många kvinnor inom tech, eller det finns inte tillräckligt många, för att världens befolkning består hårtdraget av nära 50 procent."
  },
  {
    "speaker": null,
    "timestamp": "00:11:06",
    "line": "Jag ska inte bara prata om binära kön, men alltså det är inte så snedfördelat i världens befolkning mellan kön kvinna och man."
  },
  {
    "speaker": null,
    "timestamp": "00:11:15",
    "line": "Så att det borde vara så att det är en av tio eller vad det nu kan vara som jobbar inom den här branschen."
  },
  {
    "speaker": null,
    "timestamp": "00:11:21",
    "line": "För att det spelar ingen roll vilket kön du har, du kan fortfarande programmera."
  },
  {
    "speaker": null,
    "timestamp": "00:11:26",
    "line": "Och det blir väldigt intressant när man pratar om de här sakerna för att jag tror att det som inte alla förstår."
  },
  {
    "speaker": null,
    "timestamp": "00:11:34",
    "line": "Man pratar väldigt mycket om att vi måste få in kvinnor i branschen och de måste tycka att det är kul att programmera."
  },
  {
    "speaker": null,
    "timestamp": "00:11:42",
    "line": "Vi måste börja redan med barn och så vidare."
  },
  {
    "speaker": null,
    "timestamp": "00:11:45",
    "line": "Det här är absolut jätteviktigt, men jag är rädd att vi så många missar poängen att vi ser inte att det är jättemånga kvinnor som lämnar tech."
  },
  {
    "speaker": null,
    "timestamp": "00:11:55",
    "line": "Och det hjälper till att göra det snefördelat."
  },
  {
    "speaker": null,
    "timestamp": "00:11:59",
    "line": "- Det är också en... lite bakgrund till det här vi pratar om är att jag..."
  },
  {
    "speaker": null,
    "timestamp": "00:12:04",
    "line": "...eller var med, men det var en diskussion på podcasten Kod Snacks Slack idag."
  },
  {
    "speaker": null,
    "timestamp": "00:12:10",
    "line": "Behöver inte ta upp mer om det, men det var någon som nämnde i alla fall nu när du tog upp det här att"
  },
  {
    "speaker": null,
    "timestamp": "00:12:15",
    "line": "de hade uppfattningen av att ganska många kvinnor liksom"
  },
  {
    "speaker": null,
    "timestamp": "00:12:22",
    "line": "befordras ur utvecklarrollen. Eller liksom inte bara befordrat, men att man"
  },
  {
    "speaker": null,
    "timestamp": "00:12:28",
    "line": "gå vidare i karriären och då att man går ur utvecklarrollen oftare än vad män gör."
  },
  {
    "speaker": null,
    "timestamp": "00:12:33",
    "line": "Det vill säga att du som kvinna helt plötsligt ska du vara team lead och ta hand om teamet mer än vad du ska knacka kod."
  },
  {
    "speaker": null,
    "timestamp": "00:12:39",
    "line": "Ja, det där har jag också sett på många ställen och liksom varit med i diskussioner att det blir ofta så för att"
  },
  {
    "speaker": null,
    "timestamp": "00:12:47",
    "line": "på något sätt så räknas det helt plötsligt som den mera omhändertagande ett team kanske och då blir det en sån här"
  },
  {
    "speaker": null,
    "timestamp": "00:12:53",
    "line": "\"Jo, men du som är så bra på att se folk och höra folk och ta hand om människor,"
  },
  {
    "speaker": null,
    "timestamp": "00:12:59",
    "line": "borde inte du ta den här rollen? Det fixar du, det är bra.\""
  },
  {
    "speaker": null,
    "timestamp": "00:13:04",
    "line": "Och man uppmuntrar snarare de typerna av sidorna hos kvinnliga utvecklare"
  },
  {
    "speaker": null,
    "timestamp": "00:13:10",
    "line": "än att hjälpa till att ge dem ett tekniskt självförtroende"
  },
  {
    "speaker": null,
    "timestamp": "00:13:14",
    "line": "som kanske saknas vissa gånger."
  },
  {
    "speaker": null,
    "timestamp": "00:13:16",
    "line": "Och det kanske också saknas på grund av miljö."
  },
  {
    "speaker": null,
    "timestamp": "00:13:19",
    "line": "Jag har redan ett osäkert vokabulär, vilket gör att jag kanske inte går in med så stor pondus och samma tydlighet i tekniska diskussioner som andra."
  },
  {
    "speaker": null,
    "timestamp": "00:13:34",
    "line": "Och om jag då blir avbruten eller inte lyssnad på, eller de förstår inte vad jag säger, de förstår inte vad jag menar, de avbryter mig."
  },
  {
    "speaker": null,
    "timestamp": "00:13:46",
    "line": "Det kommer ju aldrig hjälpa mig att få ett tydligare tekniskt självförtroende, hur mycket teknik jag än kan."
  },
  {
    "speaker": null,
    "timestamp": "00:13:52",
    "line": "Men jag kan inte förmedla det."
  },
  {
    "speaker": null,
    "timestamp": "00:13:54",
    "line": "Nej, men precis. Och om man jämför med mig då, till skillnad som"
  },
  {
    "speaker": null,
    "timestamp": "00:13:58",
    "line": "tror att jag ofta går in med ganska mycket pondus i mina åsikter, även om"
  },
  {
    "speaker": null,
    "timestamp": "00:14:04",
    "line": "det finns ju något riktigt kastuttryck som heter \"Strong opinions, loosely held\" som jag inte riktigt håller med om, men det illustrerar ju att"
  },
  {
    "speaker": null,
    "timestamp": "00:14:11",
    "line": "jag kan ha ganska starka åsikter och jag, som vi talade om innan, riskerar ju ingenting om jag har det."
  },
  {
    "speaker": null,
    "timestamp": "00:14:17",
    "line": "Alltså, det är ju ingen som kommer"
  },
  {
    "speaker": null,
    "timestamp": "00:14:19",
    "line": "för att jag har lite för starka åsikter. Visst att folk kanske inte gillar mig för det, men för mig personligen så är det ingen risk i det."
  },
  {
    "speaker": null,
    "timestamp": "00:14:25",
    "line": "Nej, jag är ju snarare livrädd för att ha fel."
  },
  {
    "speaker": null,
    "timestamp": "00:14:29",
    "line": "På ett sätt som inte är så att jag har så stor sårad stolthet att jag inte kan ha fel, utan för att det kostar mig mycket mer att ha fel hela tiden kanske i"
  },
  {
    "speaker": null,
    "timestamp": "00:14:43",
    "line": "ett team eller mitt yrke på min arbetsplats för att då måste jag börja jobba nerifrån igen och så måste jag jobba upp det."
  },
  {
    "speaker": null,
    "timestamp": "00:14:51",
    "line": "Och så tappar jag varje gång någonting sånt händer."
  },
  {
    "speaker": null,
    "timestamp": "00:14:54",
    "line": "Ja, men exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:56",
    "line": "Och det är liksom..."
  },
  {
    "speaker": null,
    "timestamp": "00:14:58",
    "line": "Jag vet inte, jag tycker det är så svårt att också sitta och jämföra på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:15:04",
    "line": "För jag kan ju liksom aldrig förstå din upplevelse i helt hållet, så det enda jag kan göra är att lyssna på något sätt också."
  },
  {
    "speaker": null,
    "timestamp": "00:15:11",
    "line": "Medan för min del så är det liksom att jag är bara van med det jag har varit med om."
  },
  {
    "speaker": null,
    "timestamp": "00:15:17",
    "line": "Vilket gör att det är så svårt för mig att sätta mig in i att det är så här det är."
  },
  {
    "speaker": null,
    "timestamp": "00:15:23",
    "line": "Jag har ju tänkt på det här i många kontexter."
  },
  {
    "speaker": null,
    "timestamp": "00:15:25",
    "line": "Det tog ganska lång tid innan jag förstod det här uttrycket \"microaggression\"."
  },
  {
    "speaker": null,
    "timestamp": "00:15:32",
    "line": "Jag vet inte hur man ska förklara det."
  },
  {
    "speaker": null,
    "timestamp": "00:15:34",
    "line": "Men det är lätt att se att \"det där kan du ju bara strunta i om det händer någon liten grej\"."
  },
  {
    "speaker": null,
    "timestamp": "00:15:40",
    "line": "Medans i själva verket är den där lilla grejen bara en del av en stadig ström av saker som händer hela tiden."
  },
  {
    "speaker": null,
    "timestamp": "00:15:48",
    "line": "Och det är liksom inte en upplevelse jag har, så det är svårt för mig att sätta mig in i när man märker från början att jag är uppmärksamma till det som händer."
  },
  {
    "speaker": null,
    "timestamp": "00:15:56",
    "line": "Men det kan man väl bara skita i liksom. Det hade jag gjort om jag var med om den där lilla grejen."
  },
  {
    "speaker": null,
    "timestamp": "00:16:01",
    "line": "Ja, det där är också väldigt vanligt och det pratar man om just det du säger."
  },
  {
    "speaker": null,
    "timestamp": "00:16:07",
    "line": "Som microaggressions, det kan vara små saker som ingen annan märker eller som de inte ens själva märker att man gör."
  },
  {
    "speaker": null,
    "timestamp": "00:16:13",
    "line": "Men jag hörde en liknelse som var väldigt bra och det är att om du har ett system som du vill använda som användare och så hittar du en bugg som är relativt liten."
  },
  {
    "speaker": null,
    "timestamp": "00:16:24",
    "line": "Det kanske inte gör så mycket, du kanske jobbar runt den buggen och så fortsätter du göra det du ska."
  },
  {
    "speaker": null,
    "timestamp": "00:16:29",
    "line": "Men om samma system har 100 små buggar, alltså inte stora, inte förödande buggar, men det är fortfarande 100 små jätteirriterande buggar,"
  },
  {
    "speaker": null,
    "timestamp": "00:16:39",
    "line": "då kommer du inte vilja använda det systemet. Det kommer bli mycket mer energikrävande för dig att göra det."
  },
  {
    "speaker": null,
    "timestamp": "00:16:44",
    "line": "Den här liknelsen har du berättat för mig förut. Jag tycker den är så jävla bra för att förklara det här för utvecklare."
  },
  {
    "speaker": null,
    "timestamp": "00:16:50",
    "line": "Det finns en hemsida som heter \"The world's most annoying website\" eller något sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:16:55",
    "line": "Du går in och ska fylla in en formulär, men du får cookie pop-ups och du ska signa upp för nyhetsbrev."
  },
  {
    "speaker": null,
    "timestamp": "00:17:03",
    "line": "Det är lite buggy validering på inputfälten. Mycket småsaker."
  },
  {
    "speaker": null,
    "timestamp": "00:17:09",
    "line": "Men det är svårt att ta sig igenom den hemsidan. Det är svårt att lyckas med uppgifter man ska göra."
  },
  {
    "speaker": null,
    "timestamp": "00:17:16",
    "line": "Och när du drog den här liknelsen så började jag tänka på den sen, för det är liksom som en liknelse på att säga att det skulle vara livet."
  },
  {
    "speaker": null,
    "timestamp": "00:17:23",
    "line": "Att det är det där fast med någonting annat som kan vara rasism eller sexism till exempel istället."
  },
  {
    "speaker": null,
    "timestamp": "00:17:29",
    "line": "Och jag tycker den liknelsen är fruktansvärt bra."
  },
  {
    "speaker": null,
    "timestamp": "00:17:32",
    "line": "Ja, jag tycker också det när jag hörde den. Det var så on point och det är ju precis så det känns."
  },
  {
    "speaker": null,
    "timestamp": "00:17:38",
    "line": "Ibland när man pratar om så här, man kanske hör någon som säger \"Blev jag avbryten nu för att jag är kvinna?\""
  },
  {
    "speaker": null,
    "timestamp": "00:17:47",
    "line": "Eller \"Avbryter den här personen alla personer?\" Då kan det vara någon som svarar \"Nej, nej, den här personen avbryter alla, tänk inte på det, det är inte därför, jag håller inte med, jag tror verkligen inte det för att du är kvinna.\""
  },
  {
    "speaker": null,
    "timestamp": "00:17:56",
    "line": "Det kanske är rätt."
  },
  {
    "speaker": null,
    "timestamp": "00:17:58",
    "line": "Det kanske inte var därför, men att jag ändå måste utvärdera det här, att det rullar i mitt huvud hela tiden, baserat på gamla erfarenheter och att jag ändå stöter på sånt relativt ofta."
  },
  {
    "speaker": null,
    "timestamp": "00:18:13",
    "line": "Det kostar ju också energi på ett sätt som påverkar precis allting jag gör."
  },
  {
    "speaker": null,
    "timestamp": "00:18:21",
    "line": "För att jag menar, om jag aldrig upplevt det här problemet, då behöver jag inte utvärdera om det hände mig."
  },
  {
    "speaker": null,
    "timestamp": "00:18:28",
    "line": "Så jag gör det av en anledning."
  },
  {
    "speaker": null,
    "timestamp": "00:18:30",
    "line": "Vi pratade lite om det här förut."
  },
  {
    "speaker": null,
    "timestamp": "00:18:34",
    "line": "Du tog upp någon gång att du kan vara lite tveksam för att skriva tester i ett team."
  },
  {
    "speaker": null,
    "timestamp": "00:18:41",
    "line": "För att inte hamna i rollen som testare."
  },
  {
    "speaker": null,
    "timestamp": "00:18:45",
    "line": "Det är också någonting som har påverkat dig eller hur du arbetar, fast det inte borde göra det."
  },
  {
    "speaker": null,
    "timestamp": "00:18:53",
    "line": "Att du är bra på att skriva tester betyder inte mer än att du är bra på att skriva tester egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:18:57",
    "line": "Men att det kanske är lätt att tolka in eller vara rädd för att då skulle jag kunna hamna i rollen att jag är den som skriver tester"
  },
  {
    "speaker": null,
    "timestamp": "00:19:05",
    "line": "och inte skriver riktig kod inom väldigt mycket situationstecken."
  },
  {
    "speaker": null,
    "timestamp": "00:19:09",
    "line": "Ja, det är intressant för när man börjar tänka på det så har jag ganska mycket sådana saker jag inte vill göra."
  },
  {
    "speaker": null,
    "timestamp": "00:19:16",
    "line": "Om man tar de här vanliga kontorsgrejerna då. Jag vill inte ställa upp och fixa fika om det inte är så här rullande schema."
  },
  {
    "speaker": null,
    "timestamp": "00:19:23",
    "line": "Jag vill inte plocka i och ur diskmaskinen på en arbetsplats mer som en princip sak än att jag inte kan tänka mig att göra det."
  },
  {
    "speaker": null,
    "timestamp": "00:19:30",
    "line": "Jag vill inte vara den som antecknar på möten. Alltså jag har mycket sånt som jag verkligen nu har börjat släppa på det såklart."
  },
  {
    "speaker": null,
    "timestamp": "00:19:37",
    "line": "Men mycket sånt jag inte vill göra."
  },
  {
    "speaker": null,
    "timestamp": "00:19:40",
    "line": "Och en stor grej var ju mycket, men till exempel att vara nära"
  },
  {
    "speaker": null,
    "timestamp": "00:19:45",
    "line": "UV som utvecklare."
  },
  {
    "speaker": null,
    "timestamp": "00:19:47",
    "line": "Det kan ju ibland kännas lite jobbigt att om jag sitter med"
  },
  {
    "speaker": null,
    "timestamp": "00:19:51",
    "line": "bara CSS eller bara pixlar för att jag har blivit frågad om"
  },
  {
    "speaker": null,
    "timestamp": "00:19:55",
    "line": "jag är UXare eller designer så otroligt många gånger och det"
  },
  {
    "speaker": null,
    "timestamp": "00:19:59",
    "line": "finns liksom noll anledning när jag går runt i ett team med"
  },
  {
    "speaker": null,
    "timestamp": "00:20:02",
    "line": "andra manliga utvecklare varför jag är den som ska vara designer"
  },
  {
    "speaker": null,
    "timestamp": "00:20:07",
    "line": "Nej men exakt, och det där är ju en så jävla tydlig grej tycker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:20:11",
    "line": "För man hör ju, jag har hört väldigt många gånger att folk som till exempel åker på konferenser"
  },
  {
    "speaker": null,
    "timestamp": "00:20:17",
    "line": "och är till exempel kvinnor som får frågan \"Ja, vad jobbar du med då?\""
  },
  {
    "speaker": null,
    "timestamp": "00:20:23",
    "line": "Eller alltså att de först pratar med till exempel två manliga kollegor som står bredvid och pratar om"
  },
  {
    "speaker": null,
    "timestamp": "00:20:29",
    "line": "\"Vilken textaktie är ni med?\" och sen vänder man sig till den kvinnliga kollegan och säger \"Ja, och vad jobbar du med?\""
  },
  {
    "speaker": null,
    "timestamp": "00:20:36",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:20:38",
    "line": "Och det är ett helt tydligt exempel på bias som folk har, eller fördomar som man har."
  },
  {
    "speaker": null,
    "timestamp": "00:20:45",
    "line": "Ja, och det är ju som sagt, det finns ju naturligtvis händelser som är större också."
  },
  {
    "speaker": null,
    "timestamp": "00:20:53",
    "line": "Jag har träffat på andra kvinnor i min karriär som har lämnat tech på grund av större omständigheter också."
  },
  {
    "speaker": null,
    "timestamp": "00:21:00",
    "line": "Men jag tror att det är de här små sakerna som gör att människor inte förstår varför kvinnor försvinner."
  },
  {
    "speaker": null,
    "timestamp": "00:21:06",
    "line": "Och det låter inte som stort, men någonting som jag tjatar mycket om och som ibland bara driver mig till vansinne är ju"
  },
  {
    "speaker": null,
    "timestamp": "00:21:14",
    "line": "på engelska när alla alltid säger \"hey guys\"."
  },
  {
    "speaker": null,
    "timestamp": "00:21:18",
    "line": "Och jag vet att det är korrekt engelska."
  },
  {
    "speaker": null,
    "timestamp": "00:21:21",
    "line": "Det är inga konstigheter."
  },
  {
    "speaker": null,
    "timestamp": "00:21:23",
    "line": "Och inom svenska att man säger \"man\" om allting."
  },
  {
    "speaker": null,
    "timestamp": "00:21:26",
    "line": "Vilket jag också gör för att jag är väldigt van vid att göra i tal."
  },
  {
    "speaker": null,
    "timestamp": "00:21:30",
    "line": "Men det faktum är att bara en sån liten sak är exkluderande när man yttrar den."
  },
  {
    "speaker": null,
    "timestamp": "00:21:37",
    "line": "\"Hej guys\" för mig, tolkar jag som \"hej killar\"."
  },
  {
    "speaker": null,
    "timestamp": "00:21:41",
    "line": "Och jag hör det flera gånger om dagen."
  },
  {
    "speaker": null,
    "timestamp": "00:21:44",
    "line": "Vilket bygger på min känsla av utanförskap."
  },
  {
    "speaker": null,
    "timestamp": "00:21:49",
    "line": "Och det man gör när man använder såna typer av uttryck är att man ändå konstaterar normen."
  },
  {
    "speaker": null,
    "timestamp": "00:21:54",
    "line": "Det är väldigt svårt att försöka förklara det för folk om man får ofta \"Skärp dig, vad löjlig du är, det är bara ett ord\"."
  },
  {
    "speaker": null,
    "timestamp": "00:22:06",
    "line": "Ja, jag förstår det, men det driver mig ändå till vansinne."
  },
  {
    "speaker": null,
    "timestamp": "00:22:11",
    "line": "Just det här med att förklara för folk tycker jag också kan vara väldigt svårt, för det är så lätt att man får reaktionen \"men vadå, jag är inte rasist\""
  },
  {
    "speaker": null,
    "timestamp": "00:22:19",
    "line": "Jag är inte sexist."
  },
  {
    "speaker": null,
    "timestamp": "00:22:21",
    "line": "Man hamnar så jävla lätt i försvarställning för att det är ju ett väldigt känsligt ämne."
  },
  {
    "speaker": null,
    "timestamp": "00:22:28",
    "line": "Och det vet jag själv. Om någon säger saker till mig i stunden så har jag väldigt lätt att \"Oj, nej, det håller jag inte med om\"."
  },
  {
    "speaker": null,
    "timestamp": "00:22:38",
    "line": "Men hinner man tänka efter lite grann eller om man säger \"Oj, jag ska tänka på det här\""
  },
  {
    "speaker": null,
    "timestamp": "00:22:45",
    "line": "Då kan man inse senare att \"ja men okej, det kan jag hålla med om\"."
  },
  {
    "speaker": null,
    "timestamp": "00:22:49",
    "line": "Och jag tror att det är viktigt att inse att"
  },
  {
    "speaker": null,
    "timestamp": "00:22:52",
    "line": "om någon påpekar något så säger de inte"
  },
  {
    "speaker": null,
    "timestamp": "00:22:55",
    "line": "\"du är rasist\" utan de säger \"det du gjorde var rasistiskt\"."
  },
  {
    "speaker": null,
    "timestamp": "00:22:59",
    "line": "Och det tycker jag är en ganska stor skillnad mellan."
  },
  {
    "speaker": null,
    "timestamp": "00:23:02",
    "line": "För att det är inte du som person som anklagas utan det är på en"
  },
  {
    "speaker": null,
    "timestamp": "00:23:07",
    "line": "i de flesta fall på en strukturell nivå."
  },
  {
    "speaker": null,
    "timestamp": "00:23:10",
    "line": "Vilket då gör att du kanske gör det här undermedvetet."
  },
  {
    "speaker": null,
    "timestamp": "00:23:13",
    "line": "Det är någonting som du inte tänker på."
  },
  {
    "speaker": null,
    "timestamp": "00:23:16",
    "line": "Men när någon påpekar det så är det inte en personlig attack direkt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:22",
    "line": "Nej, det där är skitjobbigt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:26",
    "line": "Jag har också gjort jättemånga misstag och jag lär mig varje dag om nya saker."
  },
  {
    "speaker": null,
    "timestamp": "00:23:31",
    "line": "Jag, till exempel, som blivit utsatt för en hel del rasism i mitt liv, har även gjort rasistiska saker."
  },
  {
    "speaker": null,
    "timestamp": "00:23:40",
    "line": "För att jag är också strukturellt uppfostrad i ett land som inte var alltid så eftertänksamt när vi pratade om sådana här saker och skämtar och tidigare i livet och så."
  },
  {
    "speaker": null,
    "timestamp": "00:23:55",
    "line": "Så jag gör ju också misstag, alla gör ju det. Det finns ingen perfekt. Det enda som handlar om, jag tror det som är så farligt är när man tystnar."
  },
  {
    "speaker": null,
    "timestamp": "00:24:03",
    "line": "eller när man förväntar sig att marginaliserade eller minoritetsgrupper ska dra hela lasset."
  },
  {
    "speaker": null,
    "timestamp": "00:24:09",
    "line": "För att det finns redan så mycket annan skit för oss, eller för dem att dra."
  },
  {
    "speaker": null,
    "timestamp": "00:24:16",
    "line": "Och jag tror att det är så bra det som du var inne på, Thalera, att det kostar dig mycket mindre att ifrågasätta eller säga ifrån."
  },
  {
    "speaker": null,
    "timestamp": "00:24:24",
    "line": "Och det är ju att du gör det, det är ju att du använder dina privilegier för att försöka skapa förändring."
  },
  {
    "speaker": null,
    "timestamp": "00:24:31",
    "line": "Och det är verkligen så, om vi båda skulle göra exakt samma saker, reagera på exakt samma sätt i samma situationer, så kommer risken att vara mycket mindre för dig att det blir problem."
  },
  {
    "speaker": null,
    "timestamp": "00:24:44",
    "line": "Jag tror också risken blir mycket mindre. För det här är ganska vanligt att om man har sagt ifrån eller det har hänt någonting, då blir det också så att då måste man liksom trösta eller ta hand om det som kommer efteråt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:01",
    "line": "Den här svansen av nästan som byktning eller förklaringar hur en person inte har gjort fel"
  },
  {
    "speaker": null,
    "timestamp": "00:25:08",
    "line": "eller hur jag har missuppfattat."
  },
  {
    "speaker": null,
    "timestamp": "00:25:10",
    "line": "Och det är också så här att lägga den tyngden på personen som sa ifrån"
  },
  {
    "speaker": null,
    "timestamp": "00:25:15",
    "line": "bara för att lätta sitt egna samvete."
  },
  {
    "speaker": null,
    "timestamp": "00:25:17",
    "line": "Ja, exakt. Och det är också väldigt lätt att man börjar tänka att"
  },
  {
    "speaker": null,
    "timestamp": "00:25:24",
    "line": "\"Oj, men jag menade inte det så\" eller \"Det var inte min mening att såra dig\" bla bla."
  },
  {
    "speaker": null,
    "timestamp": "00:25:30",
    "line": "Jag har liksom ingen bra översättning på det här, men det är ett uttryck som är \"intent does not erase impact\"."
  },
  {
    "speaker": null,
    "timestamp": "00:25:36",
    "line": "Det vill säga att det är inte tanken som räknas i det här fallet."
  },
  {
    "speaker": null,
    "timestamp": "00:25:42",
    "line": "Utan här är det faktiskt att det du har sagt har ju påverkat någon."
  },
  {
    "speaker": null,
    "timestamp": "00:25:46",
    "line": "Man kan inte be om ursäkt bara med att förklara sig att \"oj, det var inte så jag menade\"."
  },
  {
    "speaker": null,
    "timestamp": "00:25:50",
    "line": "Skaden redan skedde."
  },
  {
    "speaker": null,
    "timestamp": "00:25:54",
    "line": "Ja, så är det definitivt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:56",
    "line": "Vi kom verkligen en bit iväg här nu från där vi var i början."
  },
  {
    "speaker": null,
    "timestamp": "00:26:03",
    "line": "Och då kan man ju fråga sig hur vi ramlade här."
  },
  {
    "speaker": null,
    "timestamp": "00:26:06",
    "line": "Och det kan vi alltid fråga oss, men det faktum är att allting hänger ihop."
  },
  {
    "speaker": null,
    "timestamp": "00:26:12",
    "line": "Och mycket av det här som vi pratar om och mycket om att miljön kanske inte alltid är så inkluderande"
  },
  {
    "speaker": null,
    "timestamp": "00:26:18",
    "line": "eller så lätt för personer att vara i, liksom sätt till yrke och allt möjligt,"
  },
  {
    "speaker": null,
    "timestamp": "00:26:25",
    "line": "gör ju också att arbetsplatserna kanske förblir homogena,"
  },
  {
    "speaker": null,
    "timestamp": "00:26:29",
    "line": "eller snarare att de arbetsplatserna sätter krav nästan på de som står ut"
  },
  {
    "speaker": null,
    "timestamp": "00:26:35",
    "line": "att anpassa sig in i miljön och in i mängden så att det blir mer och mer homogent."
  },
  {
    "speaker": null,
    "timestamp": "00:26:40",
    "line": "Och att det är homogena grupper som utvecklar teknik och system,"
  },
  {
    "speaker": null,
    "timestamp": "00:26:45",
    "line": "Det påverkar ju systemen."
  },
  {
    "speaker": null,
    "timestamp": "00:26:48",
    "line": "För om du till exempel har en produkt som ska lanseras världen över till alla typer av rasare och människor, inte bara vita."
  },
  {
    "speaker": null,
    "timestamp": "00:26:57",
    "line": "Om du inte har testat eller förstått eller lyssnat på någon annans perspektiv, då kommer du missa saker."
  },
  {
    "speaker": null,
    "timestamp": "00:27:05",
    "line": "Och det kommer systemet göra också."
  },
  {
    "speaker": null,
    "timestamp": "00:27:08",
    "line": "Ja, jag tror att just den här boken, \"Technically Wrong\","
  },
  {
    "speaker": null,
    "timestamp": "00:27:11",
    "line": "tror jag att det är med den här"
  },
  {
    "speaker": null,
    "timestamp": "00:27:13",
    "line": "handtorken."
  },
  {
    "speaker": null,
    "timestamp": "00:27:15",
    "line": "Om inte annat så har det varit viral för något år sedan."
  },
  {
    "speaker": null,
    "timestamp": "00:27:19",
    "line": "Och då var det typ att"
  },
  {
    "speaker": null,
    "timestamp": "00:27:20",
    "line": "en sån här automatisk handtork, så när man stoppar in handen under så börjar den spruta en massa luft och så skulle den"
  },
  {
    "speaker": null,
    "timestamp": "00:27:26",
    "line": "torka dina händer."
  },
  {
    "speaker": null,
    "timestamp": "00:27:27",
    "line": "Och då var det någon som hade utvecklat en sån och den funkade inte på svarta."
  },
  {
    "speaker": null,
    "timestamp": "00:27:33",
    "line": "För att den då uppenbarligen inte var testad på svarta personer."
  },
  {
    "speaker": null,
    "timestamp": "00:27:36",
    "line": "Så att den kände inte av händerna på svarta personer."
  },
  {
    "speaker": null,
    "timestamp": "00:27:39",
    "line": "Och det är ett så jävla tydligt exempel på när det blir fel."
  },
  {
    "speaker": null,
    "timestamp": "00:27:43",
    "line": "- Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:27:45",
    "line": "Ett exempel är också när man tränar algoritmer och ansiktsenkänning tror jag det var."
  },
  {
    "speaker": null,
    "timestamp": "00:27:52",
    "line": "Och då var det, jag kommer inte ihåg situationen, men då var det också problematik med att"
  },
  {
    "speaker": null,
    "timestamp": "00:27:56",
    "line": "jag tror att en svart person, eller svarta personer, blev benämnda som apor."
  },
  {
    "speaker": null,
    "timestamp": "00:28:00",
    "line": "För de hade ju inte tränat den här algoritmen på svarta människor överhuvudtaget."
  },
  {
    "speaker": null,
    "timestamp": "00:28:04",
    "line": "Ja, exakt. Undrar vi inte om det var Apples maskininlärningsalgoritm som de köper på telefonerna?"
  },
  {
    "speaker": null,
    "timestamp": "00:28:12",
    "line": "För där kan man ju typ söka på saker."
  },
  {
    "speaker": null,
    "timestamp": "00:28:13",
    "line": "Och sökte du på Gorilla så fick du fram svarta personer."
  },
  {
    "speaker": null,
    "timestamp": "00:28:16",
    "line": "Ja, så var det kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:28:18",
    "line": "Jag tycker det. Det kan ha funnits flera sådana här."
  },
  {
    "speaker": null,
    "timestamp": "00:28:21",
    "line": "Men jag vet att det är i alla fall ett exempel på när det också har hänt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:27",
    "line": "Och sen har vi alla de här exemplen kring formulär där man ska fylla i ursprung och ras och etnicitet och vad den kan vara."
  },
  {
    "speaker": null,
    "timestamp": "00:28:38",
    "line": "Det tas inte hänsyn till att en person kan ha multiraser eller multinationaliteter och alla sådana typer för att det förväntas bara att en person har en av allt slut."
  },
  {
    "speaker": null,
    "timestamp": "00:28:52",
    "line": "Ja, exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:54",
    "line": "Jag tänker så här, om jag ska göra det vi nämnde lite grann nyss,"
  },
  {
    "speaker": null,
    "timestamp": "00:28:59",
    "line": "man ska ju inte vända sig till minoriteter för att de ska lösa problem,"
  },
  {
    "speaker": null,
    "timestamp": "00:29:03",
    "line": "men om jag får fråga dig lite på slutet här,"
  },
  {
    "speaker": null,
    "timestamp": "00:29:06",
    "line": "vad kan vi göra för att det här ska bli bättre?"
  },
  {
    "speaker": null,
    "timestamp": "00:29:09",
    "line": "Vad kan vi göra? Jag tror att vi måste lära oss att lyssna."
  },
  {
    "speaker": null,
    "timestamp": "00:29:19",
    "line": "Lyssna på saker som andras upplevelser och validera dem och inte ta dem för icke-valida för att en majoritet anser annorlunda."
  },
  {
    "speaker": null,
    "timestamp": "00:29:34",
    "line": "Jag tror att vi måste lära oss saker och vi måste också bli mycket bättre på att om någon säger till och ifrån, då ska det inte komma ett helst försvarstal."
  },
  {
    "speaker": null,
    "timestamp": "00:29:43",
    "line": "utan då är det absolut att man kan ställa frågor om det undras om det men det är också en sån här"
  },
  {
    "speaker": null,
    "timestamp": "00:29:48",
    "line": "tack för att du sa till, jag ska tänka på det här och jag ska bättra mig, eventuellt liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:29:54",
    "line": "Men jag tror framför allt att människor ska sluta förvänta sig att marginaliserade personer ska utbilda dem."
  },
  {
    "speaker": null,
    "timestamp": "00:30:05",
    "line": "Folk måste börja utbilda sig själva, det finns så mycket resurser."
  },
  {
    "speaker": null,
    "timestamp": "00:30:09",
    "line": "Jag menar, du har nämnt två böcker här i podden som är jättebra att börja med."
  },
  {
    "speaker": null,
    "timestamp": "00:30:15",
    "line": "Det finns oändligt med resurser."
  },
  {
    "speaker": null,
    "timestamp": "00:30:17",
    "line": "Och istället för att fråga en person som du känner om någonting, dra in Googling och lär dig."
  },
  {
    "speaker": null,
    "timestamp": "00:30:23",
    "line": "Ja, just det finns så oerhört mycket resurser."
  },
  {
    "speaker": null,
    "timestamp": "00:30:27",
    "line": "Att jag känner att jag inte kan prata här nu beror mycket på att jag har lagt lite tid på att läsa lite böcker och kolla lite presentationer."
  },
  {
    "speaker": null,
    "timestamp": "00:30:35",
    "line": "Och även vidga mitt nätverk."
  },
  {
    "speaker": null,
    "timestamp": "00:30:41",
    "line": "Då menar jag inte att man ska söka upp och försöka umgås med folk."
  },
  {
    "speaker": null,
    "timestamp": "00:30:44",
    "line": "Men att på Twitter har jag gjort en ganska stor effort att inte bara följa vita medelåldersmän."
  },
  {
    "speaker": null,
    "timestamp": "00:30:51",
    "line": "Det här kan vara ganska obekvämt, för det är ganska många av dem som jag följer som"
  },
  {
    "speaker": null,
    "timestamp": "00:30:57",
    "line": "twittrar saker som jag känner \"det här tog på mig personligt\"."
  },
  {
    "speaker": null,
    "timestamp": "00:31:04",
    "line": "Men då är det tillbaka där att det kommer vara lite obekvämt och det kanske inte riktar på mig personligen egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:31:10",
    "line": "Men ändå ta kvar det där och inte bara hamna i sin bubbla utan att försöka ta något steg utanför den."
  },
  {
    "speaker": null,
    "timestamp": "00:31:17",
    "line": "Ja, men jag tror också att det här med att om en har möjligheten att säga ifrån med"
  },
  {
    "speaker": null,
    "timestamp": "00:31:27",
    "line": "och att göra det när saker har gått för långt."
  },
  {
    "speaker": null,
    "timestamp": "00:31:29",
    "line": "Det finns ändå situationer som är inte tyvlaktiga eller någonting att fundera på."
  },
  {
    "speaker": null,
    "timestamp": "00:31:34",
    "line": "Det finns fortfarande rena situationer som bara är fel."
  },
  {
    "speaker": null,
    "timestamp": "00:31:38",
    "line": "Som bara är rent rasistiska eller sexistiska eller fel."
  },
  {
    "speaker": null,
    "timestamp": "00:31:43",
    "line": "Men det är ofta ingen som vågar säga någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:31:46",
    "line": "Och om det är någon som säger något så är det kanske ofta någon som blir drabbad av det."
  },
  {
    "speaker": null,
    "timestamp": "00:31:49",
    "line": "Och då kommer det hård och personen måste försvara sig."
  },
  {
    "speaker": null,
    "timestamp": "00:31:54",
    "line": "Jag menar, i boken var det också många av de här Twitterstormarna som folk använder för att få följare och för att skapa saker på nätet."
  },
  {
    "speaker": null,
    "timestamp": "00:32:03",
    "line": "Och det går ju inte att värja sig mot för en person."
  },
  {
    "speaker": null,
    "timestamp": "00:32:08",
    "line": "Nej, men exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:32:10",
    "line": "Och jag tycker det finns väldigt mycket att göra."
  },
  {
    "speaker": null,
    "timestamp": "00:32:14",
    "line": "Och man behöver inte känna att \"oj, nu ska jag göra allt\"."
  },
  {
    "speaker": null,
    "timestamp": "00:32:20",
    "line": "Men bara att man försöker hela tiden tänka på det och bli bättre så kommer det ju..."
  },
  {
    "speaker": null,
    "timestamp": "00:32:24",
    "line": "Om alla skulle försöka bli lite bättre hela tiden så skulle det ju bli bättre."
  },
  {
    "speaker": null,
    "timestamp": "00:32:28",
    "line": "Så det finns liksom inte såhär att \"oj, nu ska jag aldrig mer vara rasistisk\"."
  },
  {
    "speaker": null,
    "timestamp": "00:32:33",
    "line": "Det kommer inte hända. Eller \"nu ska jag aldrig mer vara sexistisk\"."
  },
  {
    "speaker": null,
    "timestamp": "00:32:36",
    "line": "Det kan man ju glömma liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:32:38",
    "line": "Utan det handlar ju snarare om att på den här rasistiska skalan röra sig åt rätt håll."
  },
  {
    "speaker": null,
    "timestamp": "00:32:44",
    "line": "- Ja. Alltså är det verkligen?"
  },
  {
    "speaker": null,
    "timestamp": "00:32:48",
    "line": "Så att, ja jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:32:50",
    "line": "Så sen är det ju samma sak, vi har inte pratat jättemycket om hur det är på arbetsplatser nu, vi var in på det litegrann i början."
  },
  {
    "speaker": null,
    "timestamp": "00:32:56",
    "line": "Men det är samma sak där att liksom,"
  },
  {
    "speaker": null,
    "timestamp": "00:32:58",
    "line": "det räcker kanske inte med att bara tänka, ja nu ska vi liksom intervjua många kvinnor."
  },
  {
    "speaker": null,
    "timestamp": "00:33:06",
    "line": "Utan man kanske måste tänka lite mer helhetsperspektiv på det och försöka få in, ja men hur får vi dem att stanna i tech som vi pratade om i början."
  },
  {
    "speaker": null,
    "timestamp": "00:33:15",
    "line": "Ja, och om jag är på det ämnet, jag kanske är ensam om det här, men det kryper i hela kroppen varje gång en rekryterare hör av sig till mig och säger"
  },
  {
    "speaker": null,
    "timestamp": "00:33:30",
    "line": "\"Hej, vad glad jag är att jag hittade dig, för du är ju kvinna!\""
  },
  {
    "speaker": null,
    "timestamp": "00:33:34",
    "line": "Jag menar sådana saker, jag har tekniska meriter, min merit inom yrket är inte att jag är kvinna."
  },
  {
    "speaker": null,
    "timestamp": "00:33:42",
    "line": "Nej exakt, och det ska ju liksom inte handla om kvotering."
  },
  {
    "speaker": null,
    "timestamp": "00:33:46",
    "line": "För det är ju det som är mångas reaktion också."
  },
  {
    "speaker": null,
    "timestamp": "00:33:48",
    "line": "\"Men vadå, vi ska ju inte kvotera in kvinnor?\""
  },
  {
    "speaker": null,
    "timestamp": "00:33:50",
    "line": "Nej, det är ju ingen som frågar efter det egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:33:54",
    "line": "För ingen kvinna vill ju bli kvoterad heller."
  },
  {
    "speaker": null,
    "timestamp": "00:33:56",
    "line": "Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:33:58",
    "line": "Utan det handlar mer om att, många pratar ju om"
  },
  {
    "speaker": null,
    "timestamp": "00:34:00",
    "line": "att det finns ett pipeline-problem, alltså det vill säga"
  },
  {
    "speaker": null,
    "timestamp": "00:34:02",
    "line": "vi har inte kvinnor vi kan få in i vår rekryterings-pipeline."
  },
  {
    "speaker": null,
    "timestamp": "00:34:08",
    "line": "Men det är ju också liksom falskt."
  },
  {
    "speaker": null,
    "timestamp": "00:34:10",
    "line": "Det finns forskning som visar att om man försöker så hittar man kvinnor."
  },
  {
    "speaker": null,
    "timestamp": "00:34:14",
    "line": "Ja, men de kanske inte utvecklas på samma sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:34:21",
    "line": "Nej, men vilken stöttning får de att göra det?"
  },
  {
    "speaker": null,
    "timestamp": "00:34:23",
    "line": "Alltså det här ämnet är enormt."
  },
  {
    "speaker": null,
    "timestamp": "00:34:26",
    "line": "Ja, exakt. Jag tror att redan vi börjar närma oss det längsta avsnittet vi har gjort."
  },
  {
    "speaker": null,
    "timestamp": "00:34:30",
    "line": "Så vi kanske ska ta och runda av strax."
  },
  {
    "speaker": null,
    "timestamp": "00:34:33",
    "line": "Men det är ju definitivt ett ämne som är värt att återkomma till."
  },
  {
    "speaker": null,
    "timestamp": "00:34:38",
    "line": "- Ja, hur läskigt det än må vara. - Ja, och jag är väldigt stolt över dig att du sitter här och pratar med mig om det här."
  },
  {
    "speaker": null,
    "timestamp": "00:34:50",
    "line": "Som vi sa innan, min risk. Men du är ju definitivt modigare än vad jag är när det gäller det här."
  },
  {
    "speaker": null,
    "timestamp": "00:34:59",
    "line": "Ja, tack."
  },
  {
    "speaker": null,
    "timestamp": "00:35:03",
    "line": "Och med det sagt, om du inte har något mer du vill tillägga så kanske vi rundar av där."
  },
  {
    "speaker": null,
    "timestamp": "00:35:10",
    "line": "Ja, men låt oss. Så kan jag gå och hypventilera en påse eller någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:35:15",
    "line": "Ja, vi säger det till våra lyssnare. Det kommer hon inte göra."
  },
  {
    "speaker": null,
    "timestamp": "00:35:19",
    "line": "Men om det är någon som har några åsikter, frågor eller funderingar så får man jättegärna höra av sig till oss."
  },
  {
    "speaker": null,
    "timestamp": "00:35:27",
    "line": "kanske främst till mig om man tycker illa om det här avsnittet."
  },
  {
    "speaker": null,
    "timestamp": "00:35:30",
    "line": "Länkarna ligger i beskrivningen."
  },
  {
    "speaker": null,
    "timestamp": "00:35:34",
    "line": "Jag tänkte också säga att om man har några avsnittsidéer så tar vi gärna det också."
  },
  {
    "speaker": null,
    "timestamp": "00:35:39",
    "line": "Någon ämne eller teman vi ska snacka om."
  },
  {
    "speaker": null,
    "timestamp": "00:35:42",
    "line": "Skicka gärna in det så ska vi göra av i kant och prata om det."
  },
  {
    "speaker": null,
    "timestamp": "00:35:47",
    "line": "Om vi tycker att vi har något vettigt att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:35:50",
    "line": "Och skämt! Har ni några skämt på lut där?"
  },
  {
    "speaker": null,
    "timestamp": "00:35:54",
    "line": "Therese anstränger sig oerhört mycket för att få ihop alla de här skämten."
  },
  {
    "speaker": null,
    "timestamp": "00:36:00",
    "line": "Jag har försökt och misslyckats alla gånger jag har försökt skriva skämt."
  },
  {
    "speaker": null,
    "timestamp": "00:36:04",
    "line": "Så det går sådär. Men har ni några programmeringsutvecklar-it-relaterade skämt så skicka in dem så kanske jag kan dra dem i podden istället."
  },
  {
    "speaker": null,
    "timestamp": "00:36:14",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:36:16",
    "line": "Och med det sagt, då tackar vi för idag och så hörs vi om två veckor igen."
  },
  {
    "speaker": null,
    "timestamp": "00:36:21",
    "line": "Det gör vi. Hej då!"
  },
  {
    "speaker": null,
    "timestamp": "00:36:23",
    "line": "Hej då!"
  },
  {
    "speaker": null,
    "timestamp": "00:36:25",
    "line": "[Musik]"
  }
]