[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Vad har testare och rittare gemensamt?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:05",
    "line": "Jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:00:10",
    "line": "De mockar jävligt mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:00:13",
    "line": "Det var bra. Det gillar jag."
  },
  {
    "speaker": null,
    "timestamp": "00:00:17",
    "line": "Den tyckte jag var rolig. Det var fyra plus. Fyra av fem."
  },
  {
    "speaker": null,
    "timestamp": "00:00:23",
    "line": "Tack."
  },
  {
    "speaker": null,
    "timestamp": "00:00:25",
    "line": "Det var lagom nivå."
  },
  {
    "speaker": null,
    "timestamp": "00:00:27",
    "line": "Välkomna till ett nytt avsnitt av SDF."
  },
  {
    "speaker": null,
    "timestamp": "00:00:31",
    "line": "Idag är det lite... Jag har precis flyttat."
  },
  {
    "speaker": null,
    "timestamp": "00:00:36",
    "line": "Jag flyttade in här igår typ, förr i går."
  },
  {
    "speaker": null,
    "timestamp": "00:00:38",
    "line": "Jag kommer inte ens ihåg när det var förr i går."
  },
  {
    "speaker": null,
    "timestamp": "00:00:40",
    "line": "Jag har byggt en stuvud av flyttkartongen här."
  },
  {
    "speaker": null,
    "timestamp": "00:00:43",
    "line": "Så är ljudet lite sämre än vanligt så är det varför."
  },
  {
    "speaker": null,
    "timestamp": "00:00:47",
    "line": "Kanske bättre än vanligt också för nu är det jävligt isolerat."
  },
  {
    "speaker": null,
    "timestamp": "00:00:50",
    "line": "Men det är också ganska lyhört i lägenheten så man vet aldrig vad som hörs när vi spelar in."
  },
  {
    "speaker": null,
    "timestamp": "00:00:54",
    "line": "Så det är min status. Hur mår du?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:58",
    "line": "Jag är hemma som vanligt. Har inte flyttat in nyss."
  },
  {
    "speaker": null,
    "timestamp": "00:01:04",
    "line": "Men har en annan person i hemmet som kanske låter. Jag vet inte. Vi får se."
  },
  {
    "speaker": null,
    "timestamp": "00:01:10",
    "line": "Jag är inte lika bra på att bygga studio som du är."
  },
  {
    "speaker": null,
    "timestamp": "00:01:12",
    "line": "Nej, den här är ju..."
  },
  {
    "speaker": null,
    "timestamp": "00:01:14",
    "line": "Jag byggde ett litet kuddfort."
  },
  {
    "speaker": null,
    "timestamp": "00:01:16",
    "line": "Ja, men det är inte varje dag man kan bygga upp ett bord och väggar av flyttkartonger heller."
  },
  {
    "speaker": null,
    "timestamp": "00:01:22",
    "line": "Nej, eller om det är varje dag då kanske man ändå bär sig över sitt liv."
  },
  {
    "speaker": null,
    "timestamp": "00:01:29",
    "line": "Ja lite så."
  },
  {
    "speaker": null,
    "timestamp": "00:01:31",
    "line": "Den enkla grejen att prata om idag är ju hela kontroversen kring bolaget Basecamp."
  },
  {
    "speaker": null,
    "timestamp": "00:01:40",
    "line": "Vi måste prata lite grann om det för jag tycker det är så sjukt intressant."
  },
  {
    "speaker": null,
    "timestamp": "00:01:47",
    "line": "Jag vet inte om vi ska liksom recappa, för det har ju varit så kort tid och det har hänt så extremt mycket på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:01:57",
    "line": "Ja, om inte annat så kanske vi ska recappa för min skull, för jag var nere i Twitterhål där i början, men har faktiskt inte varit så uppstaterad sedan dess."
  },
  {
    "speaker": null,
    "timestamp": "00:02:08",
    "line": "Jag kan recap lite grann, för jag tycker att jag har knarkat det här för att se vad som händer."
  },
  {
    "speaker": null,
    "timestamp": "00:02:15",
    "line": "Det är som en bilolyckan om man inte kan titta bort."
  },
  {
    "speaker": null,
    "timestamp": "00:02:18",
    "line": "Exakt samma känsla."
  },
  {
    "speaker": null,
    "timestamp": "00:02:20",
    "line": "Men det började med att en av grundarna, som heter Jason Fried, skrev en bloggpost som heter \"Changes at Basecamp\"."
  },
  {
    "speaker": null,
    "timestamp": "00:02:32",
    "line": "Och jag kanske ska säga också att Basecamp är ju, som historik, ett bolag som bygger ett samarbetsmjukvara för teams."
  },
  {
    "speaker": null,
    "timestamp": "00:02:40",
    "line": "Inte för programmets teams, men för hur man jobbar tillsammans."
  },
  {
    "speaker": null,
    "timestamp": "00:02:45",
    "line": "Och nyligen har de väl också lanserat sin e-mail-tjänst som heter \"Hej\""
  },
  {
    "speaker": null,
    "timestamp": "00:02:51",
    "line": "som ska vara något där man får betala för e-mail, och så ska de ha lite smarta features."
  },
  {
    "speaker": null,
    "timestamp": "00:02:58",
    "line": "Ja, det är väl snarare att de har en \"low list\" istället för en \"block list\" va?"
  },
  {
    "speaker": null,
    "timestamp": "00:03:02",
    "line": "Ja, men exakt. Så de har lite features som de tycker är smarta och som de tycker är värt att betala för."
  },
  {
    "speaker": null,
    "timestamp": "00:03:08",
    "line": "Och Basecamp har väl varit ett bolag som väldigt många ser upp till."
  },
  {
    "speaker": null,
    "timestamp": "00:03:12",
    "line": "Mycket för att de här grunderna, han Jason Fried och en som kallas för DHH"
  },
  {
    "speaker": null,
    "timestamp": "00:03:18",
    "line": "som heter David Heinemeyer Hansen tror jag, han är dansk från början."
  },
  {
    "speaker": null,
    "timestamp": "00:03:24",
    "line": "Och de har skrivit ganska mycket böcker."
  },
  {
    "speaker": null,
    "timestamp": "00:03:27",
    "line": "De har skrivit en bok som heter \"It doesn't have to be crazy at work\""
  },
  {
    "speaker": null,
    "timestamp": "00:03:30",
    "line": "som handlar om att man ska kunna vara sig själv på jobbet,"
  },
  {
    "speaker": null,
    "timestamp": "00:03:33",
    "line": "man ska jobba resonabla tider, det ska inte vara så mycket konstigheter."
  },
  {
    "speaker": null,
    "timestamp": "00:03:38",
    "line": "Som många tycker är extremt bra."
  },
  {
    "speaker": null,
    "timestamp": "00:03:41",
    "line": "Och det har väl gjort att det här bolet har varit väldigt..."
  },
  {
    "speaker": null,
    "timestamp": "00:03:44",
    "line": "I alla fall bland högljudda personer i communityt"
  },
  {
    "speaker": null,
    "timestamp": "00:03:48",
    "line": "så har det varit så här \"Basecamp känns som ett bra ställe att jobba på\"."
  },
  {
    "speaker": null,
    "timestamp": "00:03:51",
    "line": "Eller är det bilden du har också?"
  },
  {
    "speaker": null,
    "timestamp": "00:03:53",
    "line": "Ja, för det har väl också varit mycket det här att de, ja men vi pratar inte om oändlig tillväxt utan vi vill ha ett bolag där vi liksom kan jobba vidare, ja men dels som du säger att jobba på ett sätt som känns hållbart att göra det men också så här vi behöver inte hetsa att bli ett så här super Silicon Valley företag för att det inte är det som är vårt mål."
  },
  {
    "speaker": null,
    "timestamp": "00:04:16",
    "line": "Så att ja, som du säger, att man har haft kanske en lite kontrasterande bild mot ganska många andra bolag i branschen."
  },
  {
    "speaker": null,
    "timestamp": "00:04:24",
    "line": "Så att det har väl varit en annan röst i det hela skulle jag säga."
  },
  {
    "speaker": null,
    "timestamp": "00:04:28",
    "line": "Ja, nej men exakt. De har haft lite så här kontroversiella idéer, som att jag tror att de jobbade mer på vintern och jobbade typ fyra dagars vecka på sommaren."
  },
  {
    "speaker": null,
    "timestamp": "00:04:37",
    "line": "Det är ganska idéer som inte så många andra bolag har."
  },
  {
    "speaker": null,
    "timestamp": "00:04:42",
    "line": "Eller sätt att arbeta på som inte så många andra bolag har."
  },
  {
    "speaker": null,
    "timestamp": "00:04:45",
    "line": "De är inte jättestora, jag tror att det var 58 personer som jobbade där."
  },
  {
    "speaker": null,
    "timestamp": "00:04:50",
    "line": "Men det som hände då var att den här bloggposten kom ut med \"Change is at Basecamp\""
  },
  {
    "speaker": null,
    "timestamp": "00:04:56",
    "line": "Där han Jason då pratar om att"
  },
  {
    "speaker": null,
    "timestamp": "00:05:01",
    "line": "\"Nu ska vi införa lite förändringar på Basecamp\""
  },
  {
    "speaker": null,
    "timestamp": "00:05:04",
    "line": "Och bla bla bla, vi förhåller oss till vårt bolag som en produkt och inte som något annat."
  },
  {
    "speaker": null,
    "timestamp": "00:05:11",
    "line": "Utan det kan utvecklas och vi måste göra vissa saker ibland."
  },
  {
    "speaker": null,
    "timestamp": "00:05:14",
    "line": "Man kan inte \"please everyone\" tror han skriver."
  },
  {
    "speaker": null,
    "timestamp": "00:05:19",
    "line": "Och sen är det också en massa citat från filosofer."
  },
  {
    "speaker": null,
    "timestamp": "00:05:24",
    "line": "Det är ganska konstig bloggpost på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:05:27",
    "line": "Men sen blir det en punktlista."
  },
  {
    "speaker": null,
    "timestamp": "00:05:30",
    "line": "Där punkt ett är \"No more societal and political discussions on our company Basecamp account\""
  },
  {
    "speaker": null,
    "timestamp": "00:05:36",
    "line": "Och"
  },
  {
    "speaker": null,
    "timestamp": "00:05:39",
    "line": "När jag läser nu så låter det inte konstigt, och det är också för att den är ändrad, för först var det \"No more societal and political discussions at Basecamp\""
  },
  {
    "speaker": null,
    "timestamp": "00:05:45",
    "line": "Punkt"
  },
  {
    "speaker": null,
    "timestamp": "00:05:47",
    "line": "Så de säger att \"Okej, vi ska inte prata problem i samhället och vi ska inte prata politik på Basecamp längre\""
  },
  {
    "speaker": null,
    "timestamp": "00:05:54",
    "line": "Och här finns det ju"
  },
  {
    "speaker": null,
    "timestamp": "00:05:57",
    "line": "extremt mycket att säga om varför det här är helt värdelöst och extremt dåligt."
  },
  {
    "speaker": null,
    "timestamp": "00:06:02",
    "line": "Men jag tänker att vi tar det om vi kommer dit så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:06:06",
    "line": "För sen finns det också lite andra, det är också den som fått mest uppmärksamhet,"
  },
  {
    "speaker": null,
    "timestamp": "00:06:09",
    "line": "så det finns extremt mycket skrivet om varför det är dåligt, så vill man veta det så kan vi lägga lite länkar i beskrivningen."
  },
  {
    "speaker": null,
    "timestamp": "00:06:14",
    "line": "Men sen så kommer då nästa, som är \"No more paternalistic benefits\"."
  },
  {
    "speaker": null,
    "timestamp": "00:06:19",
    "line": "Det vill säga, inga fler fördelar med..."
  },
  {
    "speaker": null,
    "timestamp": "00:06:26",
    "line": "Vad heter det på svenska?"
  },
  {
    "speaker": null,
    "timestamp": "00:06:29",
    "line": "Föräldrarfördel, alltså..."
  },
  {
    "speaker": null,
    "timestamp": "00:06:32",
    "line": "Ja, eller sociala..."
  },
  {
    "speaker": null,
    "timestamp": "00:06:34",
    "line": "Föräldraskaps..."
  },
  {
    "speaker": null,
    "timestamp": "00:06:35",
    "line": "Ja, precis. Och det är liksom inte bara för föräldraskap heller."
  },
  {
    "speaker": null,
    "timestamp": "00:06:38",
    "line": "De har haft någon fitness benefit,"
  },
  {
    "speaker": null,
    "timestamp": "00:06:41",
    "line": "wellness allowance, a farmers market share,"
  },
  {
    "speaker": null,
    "timestamp": "00:06:44",
    "line": "education allowances, allt det tar de bort nu."
  },
  {
    "speaker": null,
    "timestamp": "00:06:48",
    "line": "Och säger att det här året då får ni summan i pengar istället."
  },
  {
    "speaker": null,
    "timestamp": "00:06:54",
    "line": "Men kommande år då får ni ingenting."
  },
  {
    "speaker": null,
    "timestamp": "00:06:57",
    "line": "Ja, och det var nästan konstigt också för anledningen är att de inte vill kontrollera hur människor spenderar sin fritid."
  },
  {
    "speaker": null,
    "timestamp": "00:07:06",
    "line": "Så då ska man inte säga att man får benefits som är på farmers market."
  },
  {
    "speaker": null,
    "timestamp": "00:07:11",
    "line": "För då skulle man kontrollera att folk skulle gå till farmers market."
  },
  {
    "speaker": null,
    "timestamp": "00:07:15",
    "line": "Exakt, det är typ deras idé. Och då tar de bort det heltalet istället."
  },
  {
    "speaker": null,
    "timestamp": "00:07:23",
    "line": "Och det är ju... Ja, det är ju vad det är. Men sen fortsätter ju den här bloggposten, det är inte klart än."
  },
  {
    "speaker": null,
    "timestamp": "00:07:32",
    "line": "Sen nummer tre, då har vi \"no more committees\"."
  },
  {
    "speaker": null,
    "timestamp": "00:07:37",
    "line": "Först säger han att under 21 år av vår existens så var vi fri från kommittéer."
  },
  {
    "speaker": null,
    "timestamp": "00:07:46",
    "line": "Inga arbetsgrupper som tar stora beslut, bla bla bla."
  },
  {
    "speaker": null,
    "timestamp": "00:07:50",
    "line": "På senare tid har några kommit fram, men nu stänger vi ner dem här. De ska inte finnas längre."
  },
  {
    "speaker": null,
    "timestamp": "00:07:56",
    "line": "Och det är också på något sätt ganska sjukt."
  },
  {
    "speaker": null,
    "timestamp": "00:08:02",
    "line": "Det de säger egentligen är att ni våra anställda får inte bestämma längre."
  },
  {
    "speaker": null,
    "timestamp": "00:08:06",
    "line": "Det är jag, Jason och David som ska, det är vårt bolag."
  },
  {
    "speaker": null,
    "timestamp": "00:08:12",
    "line": "Och det ska också sägas att, vi kan komma in på det lite grann, men en anledning som har kommit ut"
  },
  {
    "speaker": null,
    "timestamp": "00:08:21",
    "line": "efter att den här bloggposten kom ut, är det att en kommitté som nyligen hade startats var en för att förbättra mångfalden, hur de hanterar mångfald och inkludering och så vidare på bolaget."
  },
  {
    "speaker": null,
    "timestamp": "00:08:32",
    "line": "Där då ungefär 20 personer av de här 58 som jobbade där gick med."
  },
  {
    "speaker": null,
    "timestamp": "00:08:38",
    "line": "Och de hade inte ens hunnit ha något första styrmöte överhuvudtaget för det var så nytt egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:08:46",
    "line": "Nej exakt, så det var en extremt ny grej."
  },
  {
    "speaker": null,
    "timestamp": "00:08:48",
    "line": "Men nu var det bara \"Nu stänger vi ned\" och sen hade de fått att den här gruppen ska stängas"
  },
  {
    "speaker": null,
    "timestamp": "00:08:52",
    "line": "och så får den här personen ansvaret för de här frågorna."
  },
  {
    "speaker": null,
    "timestamp": "00:08:54",
    "line": "Och det var det."
  },
  {
    "speaker": null,
    "timestamp": "00:08:56",
    "line": "Sen fortsätter den här bloggposten lite mer."
  },
  {
    "speaker": null,
    "timestamp": "00:08:58",
    "line": "Nummer 4 då har vi \"No more lingering or dwelling on past decisions\"."
  },
  {
    "speaker": null,
    "timestamp": "00:09:03",
    "line": "Så då säger de \"Okej, nu har vi tagit det här beslutet, men nu ska vi inte prata om det här beslutet längre\"."
  },
  {
    "speaker": null,
    "timestamp": "00:09:08",
    "line": "Och så säger de det. Sen går de vidare till nummer 5 som är \"No more 360 reviews\"."
  },
  {
    "speaker": null,
    "timestamp": "00:09:15",
    "line": "Och 360 reviews är en feedback process där man ska feedbacka åt alla håll."
  },
  {
    "speaker": null,
    "timestamp": "00:09:22",
    "line": "Så att du ska feedbacka din chef, du ska feedbacka om du har någon under dig i hierarkin men också i sidled till exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:09:28",
    "line": "Och där säger de bara att den feedbacken ger inte så mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:09:34",
    "line": "Så att det skiter vi också i nu."
  },
  {
    "speaker": null,
    "timestamp": "00:09:38",
    "line": "Ja, det är också spännande för det var feedbacken ger ingenting, inte lika mycket som om den kommer från din manager, för när den kommer från your peers, då är den positiv."
  },
  {
    "speaker": null,
    "timestamp": "00:09:49",
    "line": "Så då finns det inga tydliga förbättringspunkter. Så det de säger är också att nu ska vi inte fokusera på att uppskatta varann och se det bra vi gör, utan vi ska bara fokusera på allt som individer gör dåligt i princip."
  },
  {
    "speaker": null,
    "timestamp": "00:10:05",
    "line": "Ja, och sen kommer nummer 6 som är \"No forgetting what we do here\""
  },
  {
    "speaker": null,
    "timestamp": "00:10:14",
    "line": "Och då är det så här, ja men vi gör ju project management, mjukvara och bla bla bla"
  },
  {
    "speaker": null,
    "timestamp": "00:10:19",
    "line": "Vi är inte ett bolag som ska hålla på med social impact och bla bla bla"
  },
  {
    "speaker": null,
    "timestamp": "00:10:25",
    "line": "Det är också intressant med tanke på att om man vet historiken på Basecamp så har de varit väldigt utåt."
  },
  {
    "speaker": null,
    "timestamp": "00:10:35",
    "line": "De har argumenterat extremt mycket för till exempel Apples 30%-grej och hur de hanterade för deras mailapp."
  },
  {
    "speaker": null,
    "timestamp": "00:10:47",
    "line": "Den var lite blockad av Apple ett tag bland annat och sen har de argumenterat massor om det."
  },
  {
    "speaker": null,
    "timestamp": "00:10:51",
    "line": "Jag vet att någon gång fick någon politisk kandidat i USA låna deras kontor som kampanj i huvudkvarter."
  },
  {
    "speaker": null,
    "timestamp": "00:11:01",
    "line": "Det är saker som Jason och David bestämt såklart."
  },
  {
    "speaker": null,
    "timestamp": "00:11:06",
    "line": "Det är de som har engagerat sig i det här."
  },
  {
    "speaker": null,
    "timestamp": "00:11:09",
    "line": "Men när det kommer någonting inifrån, de bara \"Nej, nu skiter vi i det här. Det är inte så vi ska hålla på.\""
  },
  {
    "speaker": null,
    "timestamp": "00:11:15",
    "line": "Så glöm inte att vi är här för att arbeta."
  },
  {
    "speaker": null,
    "timestamp": "00:11:19",
    "line": "Det är allt det är."
  },
  {
    "speaker": null,
    "timestamp": "00:11:26",
    "line": "Vi är här för att ta de fighter som vi känner att vi vill ta och inga andra."
  },
  {
    "speaker": null,
    "timestamp": "00:11:34",
    "line": "Ja, och sen fortsätter den här bloggposten en liten till och bla bla bla bla."
  },
  {
    "speaker": null,
    "timestamp": "00:11:38",
    "line": "Sen har det varit extremt mycket kritik mot det här."
  },
  {
    "speaker": null,
    "timestamp": "00:11:43",
    "line": "Det är så jävla sjukt."
  },
  {
    "speaker": null,
    "timestamp": "00:11:47",
    "line": "Alla de här förändringarna annonserades via den här bloggposten som jag pratade om och läser nu."
  },
  {
    "speaker": null,
    "timestamp": "00:11:54",
    "line": "Och det var första gången det skrevs till de anställda också."
  },
  {
    "speaker": null,
    "timestamp": "00:11:59",
    "line": "Och den var liksom extern."
  },
  {
    "speaker": null,
    "timestamp": "00:12:01",
    "line": "Så det var ingen diskussion internt om att införa de här förändringarna."
  },
  {
    "speaker": null,
    "timestamp": "00:12:06",
    "line": "Det var ingenting som fick reda på något utan det var bara \"här har vi skrivit en bloggpost\""
  },
  {
    "speaker": null,
    "timestamp": "00:12:10",
    "line": "\"som alla kan läsa om hur vi förändrar bolaget.\""
  },
  {
    "speaker": null,
    "timestamp": "00:12:12",
    "line": "Och så här kommer det vara framöver nu."
  },
  {
    "speaker": null,
    "timestamp": "00:12:16",
    "line": "Det måste vara som sjuk jävla chock att jobba på det bolaget."
  },
  {
    "speaker": null,
    "timestamp": "00:12:22",
    "line": "När kommunikationen funkar på det sättet."
  },
  {
    "speaker": null,
    "timestamp": "00:12:26",
    "line": "Men ja, om man ska gå in lite vidare på det också, nu kanske jag höjer kriven lite."
  },
  {
    "speaker": null,
    "timestamp": "00:12:35",
    "line": "Men det som har kommit ut ifrån det här är ju att det är många, den siffran jag hörde senast var att ungefär 30% har sagt upp sig."
  },
  {
    "speaker": null,
    "timestamp": "00:12:46",
    "line": "Och det kan vi också komma vidare på, alltså dels så är det ett privilegium att vi ens kan säga upp sig och alla har inte det privilegiet,"
  },
  {
    "speaker": null,
    "timestamp": "00:13:01",
    "line": "De som har gjort det har gjort ett ställningstagande och det är också nice."
  },
  {
    "speaker": null,
    "timestamp": "00:13:04",
    "line": "Men det känns verkligen som att hur har kommunikationen varit tidigare på bolaget?"
  },
  {
    "speaker": null,
    "timestamp": "00:13:10",
    "line": "För det känns ju verkligen som att om det har varit så här tidigare, allt bara har skett enligt deras trummat så känns det kanske som att chocken inte hade varit lika stor."
  },
  {
    "speaker": null,
    "timestamp": "00:13:21",
    "line": "Det känns verkligen som att det är en total 180-vändning på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:13:25",
    "line": "Jag har ingen inblick i bolaget liksom, men reaktionerna har varit så himla kraftiga."
  },
  {
    "speaker": null,
    "timestamp": "00:13:30",
    "line": "- Ja precis, det som du var in på där med att folk har sagt upp sig, det som hände sen var att de hade något all hands möte om det här."
  },
  {
    "speaker": null,
    "timestamp": "00:13:38",
    "line": "Där de typ skulle ställa frågor om det här, och den enda som pratade var någon som i enligt nyhetsrapporteringen var en extremt trött Jason Fried."
  },
  {
    "speaker": null,
    "timestamp": "00:13:53",
    "line": "Och David hade kommit in på mötet och sagt att han inte mår så bra."
  },
  {
    "speaker": null,
    "timestamp": "00:14:00",
    "line": "Ringt in från sängen, sen stängt av sin kamera och inte sagt någonting på hela mötet."
  },
  {
    "speaker": null,
    "timestamp": "00:14:04",
    "line": "Sen hade det varit mycket diskussioner om det här och varför det inte var så bra."
  },
  {
    "speaker": null,
    "timestamp": "00:14:12",
    "line": "Och sen så hade det också varit någon av de här, jag tror det var den fjärde personen som började på bolaget, eller femte eller något, jag kommer inte ihåg vad han heter nu, men"
  },
  {
    "speaker": null,
    "timestamp": "00:14:18",
    "line": "som hade typ"
  },
  {
    "speaker": null,
    "timestamp": "00:14:19",
    "line": "försvarat, eller han hade ifrågasatt att det skulle finnas white supremacy på bolaget"
  },
  {
    "speaker": null,
    "timestamp": "00:14:26",
    "line": "och liksom lite halvt generellt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:28",
    "line": "Och"
  },
  {
    "speaker": null,
    "timestamp": "00:14:31",
    "line": "det som då hade hänt var att någon argumenterade emot det såklart, men också att de försökte få"
  },
  {
    "speaker": null,
    "timestamp": "00:14:39",
    "line": "Jason Fried att säga"
  },
  {
    "speaker": null,
    "timestamp": "00:14:41",
    "line": "att denounca, vad heter det?"
  },
  {
    "speaker": null,
    "timestamp": "00:14:43",
    "line": "Att..."
  },
  {
    "speaker": null,
    "timestamp": "00:14:45",
    "line": "Ja, du förstår vad jag menar."
  },
  {
    "speaker": null,
    "timestamp": "00:14:47",
    "line": "Att denounca white supremacy"
  },
  {
    "speaker": null,
    "timestamp": "00:14:49",
    "line": "och det hade han liksom inte gjort där och då på mötet."
  },
  {
    "speaker": null,
    "timestamp": "00:14:51",
    "line": "Sen typ en halvtimme senare"
  },
  {
    "speaker": null,
    "timestamp": "00:14:55",
    "line": "hade det kommit en rapport om att den här anställda"
  },
  {
    "speaker": null,
    "timestamp": "00:14:57",
    "line": "hade blivit avstängd i väntan på utredning"
  },
  {
    "speaker": null,
    "timestamp": "00:14:59",
    "line": "och sen typ två dagar senare hade han sagt upp sig."
  },
  {
    "speaker": null,
    "timestamp": "00:15:01",
    "line": "Och det var väl typ det där mötet som gjorde att"
  },
  {
    "speaker": null,
    "timestamp": "00:15:05",
    "line": "då extremt många"
  },
  {
    "speaker": null,
    "timestamp": "00:15:07",
    "line": "sa upp sig. Senaste siffran jag såg var 38%."
  },
  {
    "speaker": null,
    "timestamp": "00:15:09",
    "line": "som har officiellt och publikt skrivit att jag har sagt upp mig från Basecamp."
  },
  {
    "speaker": null,
    "timestamp": "00:15:16",
    "line": "Ja det är helt galet, jag hänger inte super mycket på Twitter men jag följer ju någon eller några som jag tror retweetade varje person"
  },
  {
    "speaker": null,
    "timestamp": "00:15:38",
    "line": "varje person som sa upp sig. Under en period i helgen så var mitt flöde bara \"I have quit my job at Basecamp\" i princip."
  },
  {
    "speaker": null,
    "timestamp": "00:15:51",
    "line": "Ja, och det ska väl sägas att de erbjöd ju typ någon severance eller avgångsvedelag."
  },
  {
    "speaker": null,
    "timestamp": "00:15:56",
    "line": "Att du fick typ tre eller sex månaders lön och du fick gå på dagen typ."
  },
  {
    "speaker": null,
    "timestamp": "00:16:00",
    "line": "För alla som inte var överens om det här."
  },
  {
    "speaker": null,
    "timestamp": "00:16:03",
    "line": "Men det är så sinnessjukt. Och rapporteringen sa också att de inte hade räknat med att så här många skulle se upp sig."
  },
  {
    "speaker": null,
    "timestamp": "00:16:09",
    "line": "Och det är sjukt för det var hela EOS-teamet. Det var den enda designer de hade."
  },
  {
    "speaker": null,
    "timestamp": "00:16:19",
    "line": "Det var stora delar av supportteamet, typ Head of Marketing eller Head of Product som hade sett upp sig."
  },
  {
    "speaker": null,
    "timestamp": "00:16:27",
    "line": "Det är ett så litet bolag, så det är förmodligen ganska personberoende."
  },
  {
    "speaker": null,
    "timestamp": "00:16:33",
    "line": "Ja, för det var ju många som också sa att jag har varit på bolaget i så här många år."
  },
  {
    "speaker": null,
    "timestamp": "00:16:38",
    "line": "Och det är ju verkligen många år personen har varit där."
  },
  {
    "speaker": null,
    "timestamp": "00:16:43",
    "line": "Det är liksom sju år, fem år. Kan det varit någon som skrev tolv år?"
  },
  {
    "speaker": null,
    "timestamp": "00:16:47",
    "line": "Och det är också otroliga personer vad gäller utvecklandet av Rubion Rails."
  },
  {
    "speaker": null,
    "timestamp": "00:16:57",
    "line": "För att det ramverket är väl från, är det en av grundarna, är det DHH som har?"
  },
  {
    "speaker": null,
    "timestamp": "00:17:04",
    "line": "Ja, David är ju han som skapade Rubion Rails."
  },
  {
    "speaker": null,
    "timestamp": "00:17:07",
    "line": "Just det, och de har väl, vad jag har förstått, fortsatt att förvalta och förbättra och utveckla Rubion Rails."
  },
  {
    "speaker": null,
    "timestamp": "00:17:15",
    "line": "De som sitter på mycket av utvecklingen av deranverket slutar ju nu."
  },
  {
    "speaker": null,
    "timestamp": "00:17:22",
    "line": "Ja, exakt. Jag såg att det dök upp någon diskussion på RubinRails-community att de ville distansera sig från det här dramat."
  },
  {
    "speaker": null,
    "timestamp": "00:17:33",
    "line": "Att det inte skulle vara så personberoende och kanske gå lite mer mot den här moderna open source-strukturen som många känner."
  },
  {
    "speaker": null,
    "timestamp": "00:17:40",
    "line": "Där det finns liksom, jag kommer inte att ta det heter \"working groups\""
  },
  {
    "speaker": null,
    "timestamp": "00:17:44",
    "line": "som liksom mer styr det i grupp och lite mer demokratiskt"
  },
  {
    "speaker": null,
    "timestamp": "00:17:49",
    "line": "än att det finns liksom någon, ja det finns ju något, hoppens svåraste uttryck"
  },
  {
    "speaker": null,
    "timestamp": "00:17:54",
    "line": "att man kallar folk för diktatorer, evig diktator eller något sånt där."
  },
  {
    "speaker": null,
    "timestamp": "00:17:57",
    "line": "Men, så att jag har inte kollat vad som har hänt med den."
  },
  {
    "speaker": null,
    "timestamp": "00:18:00",
    "line": "Men det är ju liksom också så här ringar på vattnet av det här beslutet de gör"
  },
  {
    "speaker": null,
    "timestamp": "00:18:04",
    "line": "vilket är ens helt sjukt. Och för min del så är det stora liksom så här att"
  },
  {
    "speaker": null,
    "timestamp": "00:18:08",
    "line": "Ett så väl ansett bolag som går så snabbt från att vara så väl ansett till att typ alla som har prejsat innan inte gillar det."
  },
  {
    "speaker": null,
    "timestamp": "00:18:16",
    "line": "Ja, det är verkligen galet hur fort det kan gå liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:18:27",
    "line": "Men det är också så här, alltså det är spännande för ibland man pratar om så här att göra misstag och vi är alla bara människor."
  },
  {
    "speaker": null,
    "timestamp": "00:18:35",
    "line": "Det är klart att vi skulle kunna göra misstag."
  },
  {
    "speaker": null,
    "timestamp": "00:18:37",
    "line": "Man kan fatta ett beslut även som en bolagsledare som inte blir bra."
  },
  {
    "speaker": null,
    "timestamp": "00:18:43",
    "line": "Men det är också skillnad på att fatta ett beslut utan kanske input från dem det berör."
  },
  {
    "speaker": null,
    "timestamp": "00:18:52",
    "line": "Stå fast vid det och sen kanske snarare kasta anklagelser."
  },
  {
    "speaker": null,
    "timestamp": "00:19:00",
    "line": "Hur man hanterar sina misstag också, eller om man ens anser att det är ett misstag."
  },
  {
    "speaker": null,
    "timestamp": "00:19:05",
    "line": "Det är bara spännande hur fort det kan gå."
  },
  {
    "speaker": null,
    "timestamp": "00:19:10",
    "line": "Ja, och de har ju stått fast vid det här. De har ju inte vacklat i sitt beslut på något sätt med alla de här policyändringarna."
  },
  {
    "speaker": null,
    "timestamp": "00:19:18",
    "line": "Utan de har snarare grävt gropen djupare så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:19:24",
    "line": "Ja, för jag läste något på Twitter också om att det var DHH som hade skrivit något publikt om \"cancel culture\" och hur de blir utsatta för det nu."
  },
  {
    "speaker": null,
    "timestamp": "00:19:40",
    "line": "Eller inte utsatta, nu ska jag inte hålla på och säga saker som jag faktiskt inte har hundra källar på, men någonting runt det."
  },
  {
    "speaker": null,
    "timestamp": "00:19:46",
    "line": "Reaktionen från deras sida var snarare att världen går emot dem."
  },
  {
    "speaker": null,
    "timestamp": "00:19:53",
    "line": "Ja, exakt. Jason Fried skrev i den här bloggposten och sen skrev han en till bloggpost dagen efter där det var typ såhär"
  },
  {
    "speaker": null,
    "timestamp": "00:20:00",
    "line": "\"Decisions, decisions. Decisions aren't hard. Blah, blah, blah, blah, blah."
  },
  {
    "speaker": null,
    "timestamp": "00:20:05",
    "line": "Whenever I make decisions I don't think about now, I think about eventually. How will this feel then?\""
  },
  {
    "speaker": null,
    "timestamp": "00:20:12",
    "line": "Och hur det känns just nu, det är fel mått. Blah, blah, blah."
  },
  {
    "speaker": null,
    "timestamp": "00:20:17",
    "line": "Och sen liksom, ja, i stort sett inget mer."
  },
  {
    "speaker": null,
    "timestamp": "00:20:21",
    "line": "Och det är ju liksom också så jävla konstigt."
  },
  {
    "speaker": null,
    "timestamp": "00:20:25",
    "line": "Och sen så kom man med någon mer uppdatering en vecka senare där han skrev typ såhär"
  },
  {
    "speaker": null,
    "timestamp": "00:20:29",
    "line": "\"Ja, det var vi be...\" eller såhär."
  },
  {
    "speaker": null,
    "timestamp": "00:20:31",
    "line": "Inte att de ber om ursäkt utan de säger typ"
  },
  {
    "speaker": null,
    "timestamp": "00:20:35",
    "line": "\"Oj, vad stort det här blev!\""
  },
  {
    "speaker": null,
    "timestamp": "00:20:37",
    "line": "Det var inte meningen."
  },
  {
    "speaker": null,
    "timestamp": "00:20:39",
    "line": "Men de nya poliserna, de står kvar."
  },
  {
    "speaker": null,
    "timestamp": "00:20:43",
    "line": "Och typ, \"Ja, alla ni som har slutat, lycka till!\""
  },
  {
    "speaker": null,
    "timestamp": "00:20:47",
    "line": "Typ."
  },
  {
    "speaker": null,
    "timestamp": "00:20:48",
    "line": "Och man bara \"Jaha, ja, ni har ju lärt er mycket av den här diskussionen som har varit.\""
  },
  {
    "speaker": null,
    "timestamp": "00:20:54",
    "line": "Och sen, alltså, man får ju också på något sätt inse att typ, jag tror att den här jävla ordentliga högerextremistiska tidningen i USA, vad heter den? Breitbart?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:07",
    "line": "Jag tror att det är typiskt att hylla Trump, eller vara ännu längre till höger än Trump i USA."
  },
  {
    "speaker": null,
    "timestamp": "00:21:14",
    "line": "Det är typ alla de värsta..."
  },
  {
    "speaker": null,
    "timestamp": "00:21:16",
    "line": "Alt-right-extremisterna."
  },
  {
    "speaker": null,
    "timestamp": "00:21:19",
    "line": "Exakt, alla de."
  },
  {
    "speaker": null,
    "timestamp": "00:21:20",
    "line": "Proud Boys och grejer, eller?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:21",
    "line": "Ja, de älskar säkert den här sidan."
  },
  {
    "speaker": null,
    "timestamp": "00:21:23",
    "line": "Det känns som att det är samma nivå som Proud Boys."
  },
  {
    "speaker": null,
    "timestamp": "00:21:26",
    "line": "Den nyhetssidan, om man nu kan kalla det en nyhetssida, de gick ut och hyllade det här beslutet."
  },
  {
    "speaker": null,
    "timestamp": "00:21:32",
    "line": "Och då kan man börja fundera, är det här rätt beslut?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:36",
    "line": "Ja, för att det som är det värsta, vad man nu vill kalla det, men det som verkligen är grejen är att de kanske återhämtar sig jättefort från det här."
  },
  {
    "speaker": null,
    "timestamp": "00:21:53",
    "line": "det här liksom för att, om man nu ska ändå gå in på social and politics att de och white supremacy, de kommer ju hämta sig från det här för de är ju på toppen."
  },
  {
    "speaker": null,
    "timestamp": "00:22:06",
    "line": "De kommer kanske hitta fler som liksom hyllar det här i den extremistiska delen, som kan sköta jobbet, som kan komma in på bolaget och bara driva på det vidare"
  },
  {
    "speaker": null,
    "timestamp": "00:22:16",
    "line": "i den typen av maner. Vi pratar inte politik här och vi ska fokusera på det vi gör bara. Och sen så flyter de på."
  },
  {
    "speaker": null,
    "timestamp": "00:22:24",
    "line": "Jag har svårt att säga. Jag tror inte att bolaget kommer gå under på något sätt. Det får säkert en påverkan på hur deras support funkar och hur mycket features de kan utveckla."
  },
  {
    "speaker": null,
    "timestamp": "00:22:38",
    "line": "De måste ju tappa enormt mycket kunskap med tanke på hur många personer som har slutat."
  },
  {
    "speaker": null,
    "timestamp": "00:22:43",
    "line": "Men som sagt, jag tror väl att bolaget kommer säkert att överleva."
  },
  {
    "speaker": null,
    "timestamp": "00:22:46",
    "line": "Och det blir ju intressant att se hur det är."
  },
  {
    "speaker": null,
    "timestamp": "00:22:49",
    "line": "Men det känns ju som att den PR-katastrofen ändå som det är till brandet måste ju vara monumental."
  },
  {
    "speaker": null,
    "timestamp": "00:22:57",
    "line": "Alltså det har ju levt väldigt mycket förut på att..."
  },
  {
    "speaker": null,
    "timestamp": "00:23:00",
    "line": "Ja men till exempel, det var ju en extrem hype inför när deras mailtjänst \"Hej\" skulle lanseras."
  },
  {
    "speaker": null,
    "timestamp": "00:23:06",
    "line": "Och det berodde nog mycket på att man känner till Basecamp. Basecamp känns bra i magen."
  },
  {
    "speaker": null,
    "timestamp": "00:23:12",
    "line": "Nu ska de släppa en mailtjänst. Fan vad spännande."
  },
  {
    "speaker": null,
    "timestamp": "00:23:16",
    "line": "Men om de hade släppt mailtjänsten idag så tror jag att det hade varit extremt mycket färre människor med någon typ av..."
  },
  {
    "speaker": null,
    "timestamp": "00:23:26",
    "line": "Som kan influera andra liksom, som hade spridit deras budskap."
  },
  {
    "speaker": null,
    "timestamp": "00:23:34",
    "line": "Samtidigt som också, det är kanske snarare i den bubblan vi befinner oss i. Den här community utvecklar bubblan för att om man ska kolla på Stora Hela, så det kommer ju ett skandal lite till höger om vänster från bolag men de kör ju på ändå."
  },
  {
    "speaker": null,
    "timestamp": "00:23:50",
    "line": "Det rullar vidare, det är inga konstigheter för att personer som kanske inte heller är i samma bubbla eller samma community kanske inte vet om eller nås av nyheterna eller bara helt så, ni kan inte bry sig för det är bara ytterligare ett bolag av alla andra bolag."
  },
  {
    "speaker": null,
    "timestamp": "00:24:06",
    "line": "Till exempel jag kan ju tänka som Uber, när den här bloggposten kom där det var en fördetta kvinnlig anställd som pratade om hur det var att jobba där som kvinna på Uber."
  },
  {
    "speaker": null,
    "timestamp": "00:24:22",
    "line": "Jo, det håller jag verkligen med om. Det känns ändå som att i många andra fall så får det någon typ av konsekvens, även om det kanske inte blir någon förändring i grunden."
  },
  {
    "speaker": null,
    "timestamp": "00:24:36",
    "line": "Uber fick väl han vdn och grundaren, som jag inte kommer ihåg namnet på nu, men han fick väl sluta för mig."
  },
  {
    "speaker": null,
    "timestamp": "00:24:42",
    "line": "Men här känns det bara som att bolaget bara fortsätter som vanligt."
  },
  {
    "speaker": null,
    "timestamp": "00:24:48",
    "line": "Jag tror också som dig att generella kunder har ingen aning om att det här händer."
  },
  {
    "speaker": null,
    "timestamp": "00:24:53",
    "line": "Nej, och det här kan vi verkligen fatta det beslutet för de har väl ingen styrelse som sitter bakom och vill lägga sig i vad de gör."
  },
  {
    "speaker": null,
    "timestamp": "00:25:02",
    "line": "Det är väl deras bolag och de gör vad de vill."
  },
  {
    "speaker": null,
    "timestamp": "00:25:05",
    "line": "Ja, exakt. Det känns som att det blir extremt tydligt nu att Basecamp är ett bolag där Jason och David är de som bestämmer hur det ska vara."
  },
  {
    "speaker": null,
    "timestamp": "00:25:13",
    "line": "Så det kanske är tydligare för folk vad det är för bolag man signar upp sig på när man börjar jobba där."
  },
  {
    "speaker": null,
    "timestamp": "00:25:23",
    "line": "- Ja, alltså det är så himla konstigt här också. Inga sociala frågor eller politik får diskuteras. Är inte det allt? Är inte allt vi gör hela tiden sociala frågor och politik?"
  },
  {
    "speaker": null,
    "timestamp": "00:25:37",
    "line": "Jo, men precis. Nu tror jag inte att vi hinner gå in på alla problem som finns med det."
  },
  {
    "speaker": null,
    "timestamp": "00:25:43",
    "line": "Men alltså, det handlar ju så mycket om vem man är."
  },
  {
    "speaker": null,
    "timestamp": "00:25:48",
    "line": "För Jason och David som är vita medelåldersmän, och för folk som mig,"
  },
  {
    "speaker": null,
    "timestamp": "00:25:56",
    "line": "politik påverkar inte mig så direkt. Det är inte så mycket politik som är min identitet."
  },
  {
    "speaker": null,
    "timestamp": "00:26:03",
    "line": "Medan för andra så kan det vara att hela deras liv blir politik för att det är så samhället ser ut."
  },
  {
    "speaker": null,
    "timestamp": "00:26:09",
    "line": "Alltså om man har andra pronomen än de vanliga."
  },
  {
    "speaker": null,
    "timestamp": "00:26:12",
    "line": "Är det politik då att påtala vilka pronomen man har?"
  },
  {
    "speaker": null,
    "timestamp": "00:26:15",
    "line": "Eller är det politik att säga att man är rädd för att man ska bli påhoppad av nazister?"
  },
  {
    "speaker": null,
    "timestamp": "00:26:24",
    "line": "Det är så extremt svårt att dra gränsen för vad som är politik."
  },
  {
    "speaker": null,
    "timestamp": "00:26:29",
    "line": "Och det är det som gör att det här förbudet är helt idiotiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:26:32",
    "line": "Det där är intressant också för att om man skulle se det som arbetsmiljölagare så, i alla fall i Sverige har ju ett företag,"
  },
  {
    "speaker": null,
    "timestamp": "00:26:46",
    "line": "liksom, vad heter det, att man ska ta ansvar för också en individs resväg till och från arbetet, liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:26:55",
    "line": "En resväg till och från ett arbete skulle ju kunna innefatta att bli påhoppad på något typ av sätt,"
  },
  {
    "speaker": null,
    "timestamp": "00:27:02",
    "line": "är det socialt eller politiskt anledning. Och det är ju då liksom företags ansvar, och det i sig är rent politiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:27:12",
    "line": "Alltså, det är så här, ja, det finns ingen gräns."
  },
  {
    "speaker": null,
    "timestamp": "00:27:15",
    "line": "Nej, jag har extremt svårt att se att den där gränsen ska funka om man inte bara anställer folk som tillhör normen."
  },
  {
    "speaker": null,
    "timestamp": "00:27:25",
    "line": "Det är ändå sättet att behålla det där. Förbudet säger att vi kan bara anställa folk som tillhör normen, alternativt att om du inte gör det så ska du sitta i ditt hörn och vara tyst."
  },
  {
    "speaker": null,
    "timestamp": "00:27:39",
    "line": "- Ja, men också vad gäller normen, då får inte normen nämna presidenter eller politiska lägen."
  },
  {
    "speaker": null,
    "timestamp": "00:27:50",
    "line": "- Nej, så är det ju."
  },
  {
    "speaker": null,
    "timestamp": "00:27:52",
    "line": "- Det blir ju dels en sån här, vad får du prata om nutida saker, och sen som du säger, som individer som är politiska genom att bara existera på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:01",
    "line": "Ja precis, och jag tror att den enkla tanken som många får är att \"ah fan vad skönt att slippa prata om amerikanska presidentvalet på jobbet\""
  },
  {
    "speaker": null,
    "timestamp": "00:28:11",
    "line": "För om man säger att \"vi får inte prata om politik\" då kanske folk tänker att det är det man pratar om."
  },
  {
    "speaker": null,
    "timestamp": "00:28:15",
    "line": "Men det är ju extremt mycket mer vilket gör det så sjukt svårt att dra det i gränsen."
  },
  {
    "speaker": null,
    "timestamp": "00:28:26",
    "line": "Ja, de har väl jättemånga något att tänka på så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:28:31",
    "line": "Ja, jag tycker som sagt att 38% av bolaget slutar på grund av policyändringar är så jäkla sjukt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:42",
    "line": "Särskilt när det kommer från folk som liksom, jag har sett extremt mycket exempel på Twitter, när det är citat från deras böcker som de har skrivit som är exakt tvärtom mot vad de har gjort nu."
  },
  {
    "speaker": null,
    "timestamp": "00:28:54",
    "line": "Alltså det finns saker som är typ såhär, du måste kunna vara ditt fulla jag på jobbet, till exempel, ditt autentiska jag och bla bla bla."
  },
  {
    "speaker": null,
    "timestamp": "00:29:02",
    "line": "Och man bara, men det går ju inte om ni inför det här förbudet."
  },
  {
    "speaker": null,
    "timestamp": "00:29:05",
    "line": "Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:29:07",
    "line": "Så att, ja."
  },
  {
    "speaker": null,
    "timestamp": "00:29:09",
    "line": "Det är också så sjukt för att man spenderar så mycket tid på jobbet."
  },
  {
    "speaker": null,
    "timestamp": "00:29:15",
    "line": "Att behöva spendera all den tiden med att hela tiden passa på sig själv."
  },
  {
    "speaker": null,
    "timestamp": "00:29:21",
    "line": "Och försöka stoppa många delar av dem som är en själv för att vara all den här tiden på det här stället och jobba på det."
  },
  {
    "speaker": null,
    "timestamp": "00:29:30",
    "line": "Jag har ju många gånger i livet försökt göra precis det."
  },
  {
    "speaker": null,
    "timestamp": "00:29:36",
    "line": "Och det lyckas liksom inte. Korken flyger iväg, det bubblar över till slut. Det är för många timmar och för mycket tid för att stoppa ner det här."
  },
  {
    "speaker": null,
    "timestamp": "00:29:48",
    "line": "Ja, det blir spännande att se vart det tar vägen."
  },
  {
    "speaker": null,
    "timestamp": "00:29:55",
    "line": "Man blir ju liksom bara trött på det."
  },
  {
    "speaker": null,
    "timestamp": "00:29:59",
    "line": "Samma grej skedde ju på kryptobörsen, Coinbase."
  },
  {
    "speaker": null,
    "timestamp": "00:30:05",
    "line": "De bannade ju också politiska diskussioner."
  },
  {
    "speaker": null,
    "timestamp": "00:30:09",
    "line": "Där hade jag mer än förståelse för det, för där har jag en bild av att det är bara en massa crypto-bros som jobbar."
  },
  {
    "speaker": null,
    "timestamp": "00:30:16",
    "line": "Så där känner jag, det får det vara. Sen har de typ 1600 anställda, vilket också är helt sinnessjukt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:22",
    "line": "Men där har också någon typ av förståelse för att det händer. Jag tror att det är samma problem där."
  },
  {
    "speaker": null,
    "timestamp": "00:30:28",
    "line": "Men där tror jag liksom att det är lite mer väntat än vad det var på Basecamp."
  },
  {
    "speaker": null,
    "timestamp": "00:30:33",
    "line": "Ja, du hade väl inga andra typer av förväntningar liksom. Basecamp har ju lagt en förväntan nivå som är hög."
  },
  {
    "speaker": null,
    "timestamp": "00:30:41",
    "line": "Ja, det blir spännande att se vart det tar vägen. Vi kanske får anledning att återkomma till det om ett tag och se hur det har fallit ut."
  },
  {
    "speaker": null,
    "timestamp": "00:30:52",
    "line": "Ja, vi kanske inte har så mycket mer för tillfället."
  },
  {
    "speaker": null,
    "timestamp": "00:31:03",
    "line": "Nej, jag ska gå ut i min extremt varma hörn och försöka äta lite lunch och sen jobba lite mer kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:31:10",
    "line": "Vill man oss nåt så nås vi på Twitter."
  },
  {
    "speaker": null,
    "timestamp": "00:31:14",
    "line": "Där ligger också en jättefin bild från min studio om någon vill se."
  },
  {
    "speaker": null,
    "timestamp": "00:31:17",
    "line": "Den är 5+ uppbyggd av en massa flyttkartonger."
  },
  {
    "speaker": null,
    "timestamp": "00:31:21",
    "line": "Och annars så hörs vi igen om två veckor."
  },
  {
    "speaker": null,
    "timestamp": "00:31:25",
    "line": "Det gör vi."
  },
  {
    "speaker": null,
    "timestamp": "00:31:27",
    "line": "Säg så. Bye bye."
  },
  {
    "speaker": null,
    "timestamp": "00:31:29",
    "line": "Hej hej."
  },
  {
    "speaker": null,
    "timestamp": "00:31:31",
    "line": "[Musik]"
  }
]