[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Okej, vi kanske kan sätta igång. Välkomna till avsnitt tre av ASDF. Jag höll på att glömma bort vad vår podd hette."
  },
  {
    "speaker": null,
    "timestamp": "00:00:08",
    "line": "Jag höll på att glömma bort att vi hade en podd."
  },
  {
    "speaker": null,
    "timestamp": "00:00:11",
    "line": "Men det är ju perfekt. Det är den känslan vi vill att det ska vara lite grann. Vi vill ju bara sitta och snacka skit."
  },
  {
    "speaker": null,
    "timestamp": "00:00:16",
    "line": "Avsnitt tre. Vi tänkte väl kanske att vi skulle prata lite grann om remote-jobb idag. Vi får se vart det landar."
  },
  {
    "speaker": null,
    "timestamp": "00:00:24",
    "line": "Men det är ju ett ganska aktuellt ämne, tänker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:00:28",
    "line": "Ja, det är lite så att hade det varit konstigt att inte prata om det, hade det varit skönt att inte prata om det, ja, men hade det varit konstigt om vi inte hade rört vi ämnet?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:38",
    "line": "Ja, jag tänker det. Alltså jag är ju oerhört trött på hela coronapandemin, vilket jag kanske hatar ihjäl folk om."
  },
  {
    "speaker": null,
    "timestamp": "00:00:48",
    "line": "Men, men, jo jag tror också att det hade varit lite konstigt att inte prata om det. Särskilt om man går tillbaka sen och lyssnar på det här och bara, ja men det här släpptes, ja det var mitt i pandemin."
  },
  {
    "speaker": null,
    "timestamp": "00:00:56",
    "line": "men de verkar inte bry sig."
  },
  {
    "speaker": null,
    "timestamp": "00:00:58",
    "line": "Nej, för mig är det inte så stor skillnad."
  },
  {
    "speaker": null,
    "timestamp": "00:01:03",
    "line": "\"Same life, same...\" Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:01:05",
    "line": "Det hade väl..."
  },
  {
    "speaker": null,
    "timestamp": "00:01:07",
    "line": "Alltså jag menar, det kommer ju vara en stor..."
  },
  {
    "speaker": null,
    "timestamp": "00:01:10",
    "line": "dent."
  },
  {
    "speaker": null,
    "timestamp": "00:01:13",
    "line": "Ja, så mycket svängelska."
  },
  {
    "speaker": null,
    "timestamp": "00:01:15",
    "line": "Men det kommer ju ha påverkat oss."
  },
  {
    "speaker": null,
    "timestamp": "00:01:18",
    "line": "Ja, gud ja."
  },
  {
    "speaker": null,
    "timestamp": "00:01:19",
    "line": "Världen, liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:01:20",
    "line": "Ja, så är det verkligen."
  },
  {
    "speaker": null,
    "timestamp": "00:01:21",
    "line": "Men hur länge har du jobbat hemifrån nu?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:24",
    "line": "Hur känns det att jobba hemma från Lainer med dig?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:26",
    "line": "Ja, grejen är att jag har jobbat hemma i åtta veckor ungefär, men innan vi började jobba hemma också så lyckades jag bli brålförkyld i en och en halv vecka. Så jag är väl på runt tio veckor hemma nu."
  },
  {
    "speaker": null,
    "timestamp": "00:01:43",
    "line": "- Var det liksom Ronan som slog tidigt på dig?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:49",
    "line": "- Nej, som vår kollega sa en gång, jag var patient zero, ingen annan ens."
  },
  {
    "speaker": null,
    "timestamp": "00:01:55",
    "line": "Nej, det var ju inte Ronan, det var någon typ av superförkylning tror jag, för det var mycket mer snor än vad Ronan är."
  },
  {
    "speaker": null,
    "timestamp": "00:02:05",
    "line": "Men eftersom vi då precis hade börjat prata om har du minsta symptom så ska du stanna hemma, så stannade jag ju då kanske hemma snäppet längre än vad jag hade gjort vanligtvis."
  },
  {
    "speaker": null,
    "timestamp": "00:02:15",
    "line": "Och i och med att vårt projekt hos kunden inte hade satt igång än så hade jag liksom ingenting att jobba med hemifrån heller."
  },
  {
    "speaker": null,
    "timestamp": "00:02:22",
    "line": "Så då var det lika bra att vara sjuk tills jag blev ordentligt frisk."
  },
  {
    "speaker": null,
    "timestamp": "00:02:27",
    "line": "- Ja, men precis. Ja, men jag tänker också att jag borde också vara inne på åttonde veckan, hemmajobb, eller sjunde kanske. Jag vet inte riktigt."
  },
  {
    "speaker": null,
    "timestamp": "00:02:35",
    "line": "- Ja. - Typ. Något sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:02:38",
    "line": "Men sen har det ju också varit lite så här, för jag var ju på ett projekt fram till två veckor in, kan det vara det? Ja, typ. Två veckor in på hemmajobbet."
  },
  {
    "speaker": null,
    "timestamp": "00:02:47",
    "line": "Och sen drabbades den branschen ganska hårt, så att alla konsulter fick gå och grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:02:53",
    "line": "Så då hade jag inget uppdrag i två veckor typ."
  },
  {
    "speaker": null,
    "timestamp": "00:02:55",
    "line": "Och sen nu har jag börjat på ett nytt uppdrag idag."
  },
  {
    "speaker": null,
    "timestamp": "00:02:57",
    "line": "Och jag har varit där i fyra veckor."
  },
  {
    "speaker": null,
    "timestamp": "00:02:58",
    "line": "Så det var lite speciellt."
  },
  {
    "speaker": null,
    "timestamp": "00:03:01",
    "line": "Men ändå, alltså så här."
  },
  {
    "speaker": null,
    "timestamp": "00:03:02",
    "line": "Jag tyckte det funkade rätt bra de här två första veckorna."
  },
  {
    "speaker": null,
    "timestamp": "00:03:05",
    "line": "För då var jag liksom ganska samspelat med teamet."
  },
  {
    "speaker": null,
    "timestamp": "00:03:08",
    "line": "Jag hade liksom ändå koll på hur vi jobbade."
  },
  {
    "speaker": null,
    "timestamp": "00:03:11",
    "line": "Vi jobbar ju bara med oprogrammering också."
  },
  {
    "speaker": null,
    "timestamp": "00:03:12",
    "line": "Vilket gjorde att vi fortsatte med det även remote."
  },
  {
    "speaker": null,
    "timestamp": "00:03:15",
    "line": "Så vi körde liksom, vi körde Microsoft Teams."
  },
  {
    "speaker": null,
    "timestamp": "00:03:17",
    "line": "Och så hade vi samtal igång konstant."
  },
  {
    "speaker": null,
    "timestamp": "00:03:20",
    "line": "Alla hade kamera på, alla liksom satt i rum bara så man kunde hoppa emellan, typ."
  },
  {
    "speaker": null,
    "timestamp": "00:03:25",
    "line": "Och sen så körde vi lite olika grejer. Vi körde till exempel Visual Studio Live Share, heter det då."
  },
  {
    "speaker": null,
    "timestamp": "00:03:32",
    "line": "För liksom att ..."
  },
  {
    "speaker": null,
    "timestamp": "00:03:34",
    "line": "Där man kan typ dela ... Jag vet inte hur man ska förklara det. Det är typ Google Docs, fast för kod."
  },
  {
    "speaker": null,
    "timestamp": "00:03:39",
    "line": "Så alla kan skriva samtidigt och man kan dela det."
  },
  {
    "speaker": null,
    "timestamp": "00:03:42",
    "line": "Men sen är det också ganska coolt för att man kan typ ..."
  },
  {
    "speaker": null,
    "timestamp": "00:03:44",
    "line": "köra även så att dela portar."
  },
  {
    "speaker": null,
    "timestamp": "00:03:48",
    "line": "Så att det var bara en i vår grupp då, som körde liksom lösningen på sin dator."
  },
  {
    "speaker": null,
    "timestamp": "00:03:52",
    "line": "Men jag kunde surfa in på typ såhär port 8000 på min dator, och så låg det, kunde jag surfa på sajten liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:03:57",
    "line": "Och det är ju faktiskt jävligt coolt."
  },
  {
    "speaker": null,
    "timestamp": "00:03:59",
    "line": "– Ja, det är verkligen."
  },
  {
    "speaker": null,
    "timestamp": "00:04:00",
    "line": "– Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:04:01",
    "line": "Men hur har ni kört liksom då?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:03",
    "line": "För du har varit på samma uppdrag hela tiden, eller hur?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:07",
    "line": "– Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:04:09",
    "line": "Det är ju den att det blev, jag har varit på samma uppdrag hela tiden."
  },
  {
    "speaker": null,
    "timestamp": "00:04:13",
    "line": "Men det blev liksom att de höll på med ett projekt när vi kom in."
  },
  {
    "speaker": null,
    "timestamp": "00:04:17",
    "line": "Vi är liksom tre personer från samma, ja vi jobbar ju på samma konsultfirma liksom, så vi kom in tre personer."
  },
  {
    "speaker": null,
    "timestamp": "00:04:24",
    "line": "Och då höll de på att avsluta ett projekt med en tight deadline, men projektet vi skulle börja på hade liksom inte satt igång."
  },
  {
    "speaker": null,
    "timestamp": "00:04:31",
    "line": "Så det har varit ganska mycket så att, som hela teamet, då innefattande frontändare, platform, design, project manager, agil coach, editors,"
  },
  {
    "speaker": null,
    "timestamp": "00:04:46",
    "line": "att försöka köra kick-offs för att kicka igång projektet."
  },
  {
    "speaker": null,
    "timestamp": "00:04:51",
    "line": "Det innefattar jättemycket vad vi har för förväntningar på varandra,"
  },
  {
    "speaker": null,
    "timestamp": "00:04:54",
    "line": "vad har vi för behov, hur vill vi jobba,"
  },
  {
    "speaker": null,
    "timestamp": "00:05:00",
    "line": "vad vill vi ha för processer igång,"
  },
  {
    "speaker": null,
    "timestamp": "00:05:03",
    "line": "hur ska kommunikationsflödet vara."
  },
  {
    "speaker": null,
    "timestamp": "00:05:06",
    "line": "Det har liksom varit så många möten."
  },
  {
    "speaker": null,
    "timestamp": "00:05:13",
    "line": "Vilket är rätt intressant för att man trodde kanske inte att det skulle gå alls."
  },
  {
    "speaker": null,
    "timestamp": "00:05:19",
    "line": "Men det har funkat rätt bra och det är ju för att de som har styrt mötena,"
  },
  {
    "speaker": null,
    "timestamp": "00:05:23",
    "line": "Agile Coach och Project Manager tror jag framförallt har lagt ett testjobb på att få det att funka."
  },
  {
    "speaker": null,
    "timestamp": "00:05:28",
    "line": "Men det har varit mycket Jamboard, som är väl Googles, jag tror det är Bital i alla fall,"
  },
  {
    "speaker": null,
    "timestamp": "00:05:35",
    "line": "där man kan ha en presentation där alla kan gå in och skriva och sätta upp post-its och sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:05:41",
    "line": "så att det är en kollaborativ."
  },
  {
    "speaker": null,
    "timestamp": "00:05:43",
    "line": "Det och Miro, som är jättestort, där man zoomar och flyttar,"
  },
  {
    "speaker": null,
    "timestamp": "00:05:52",
    "line": "men alla kan editera. Så det är sådana kollaborativa verktyg."
  },
  {
    "speaker": null,
    "timestamp": "00:05:57",
    "line": "Det är mer delat in i, vart i stor grupp, delat in i små remote-grupper,"
  },
  {
    "speaker": null,
    "timestamp": "00:06:02",
    "line": "så att post i klappar, läst, vilket har funkat högt och lågt, bra eller dåligt,"
  },
  {
    "speaker": null,
    "timestamp": "00:06:09",
    "line": "men över förväntan."
  },
  {
    "speaker": null,
    "timestamp": "00:06:11",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:06:13",
    "line": "Sen har det tagit längre tid, tror jag, än vad det hade gjort live."
  },
  {
    "speaker": null,
    "timestamp": "00:06:21",
    "line": "Men det är en omställning för alla, för det är väl ingen som varit van vid att jobba remote."
  },
  {
    "speaker": null,
    "timestamp": "00:06:27",
    "line": "Plus att vissa känner varandra, och vissa känner inte varandra alls."
  },
  {
    "speaker": null,
    "timestamp": "00:06:33",
    "line": "Så det finns ju grupperingar i gruppen också,"
  },
  {
    "speaker": null,
    "timestamp": "00:06:35",
    "line": "Och så har vi inte varit så bra på att luckra upp det, för att på något sätt har det väl varit bekvämt att hålla fast vid det som är bekant mitt i allt kaos."
  },
  {
    "speaker": null,
    "timestamp": "00:06:44",
    "line": "Ja, exakt. Det är lätt att man kanske tyr sig till dem man redan har lite gemenskap med."
  },
  {
    "speaker": null,
    "timestamp": "00:06:50",
    "line": "Och liksom så här, \"Ja, men jag jobbar gärna med dig\" eller \"Jag frågar den här personen för att jag känner den\" och så där."
  },
  {
    "speaker": null,
    "timestamp": "00:06:55",
    "line": "Ja, och liksom om det redan är två personer, ja men typ det är två på plattform."
  },
  {
    "speaker": null,
    "timestamp": "00:07:01",
    "line": "De har redan jobbat jätte, jätte tajt i förra projektet och de jobbar jätte, jätte tajt i det här projektet."
  },
  {
    "speaker": null,
    "timestamp": "00:07:06",
    "line": "Så de pratar ju mest med varandra, liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:07:09",
    "line": "Så det går lite upp och ner, skulle jag säga."
  },
  {
    "speaker": null,
    "timestamp": "00:07:13",
    "line": "– Ja, jag tycker det är rätt spännande ändå."
  },
  {
    "speaker": null,
    "timestamp": "00:07:16",
    "line": "För att, så här, jag tycker de sa att det funkar rätt bra."
  },
  {
    "speaker": null,
    "timestamp": "00:07:19",
    "line": "Alltså, jag tycker inte alls att det funkar lika bra så när jag jobbade på kontoret."
  },
  {
    "speaker": null,
    "timestamp": "00:07:22",
    "line": "Liksom när vi började jobba remote."
  },
  {
    "speaker": null,
    "timestamp": "00:07:25",
    "line": "Visst, att det kanske beror lite grann på att vi mobprogrammerar."
  },
  {
    "speaker": null,
    "timestamp": "00:07:29",
    "line": "mobbprogrammerar, vilket ändå är lite svårare att göra remote."
  },
  {
    "speaker": null,
    "timestamp": "00:07:33",
    "line": "Men jag vet inte. Jag följer en del folk på Twitter som är riktiga remote,"
  },
  {
    "speaker": null,
    "timestamp": "00:07:41",
    "line": "alltså 100% remote entusiaster, och verkligen tänker att det är lösningen på alla världens problem."
  },
  {
    "speaker": null,
    "timestamp": "00:07:47",
    "line": "Och jag bara, nej, jag pendlar hellre en bit än att jobba helt remote."
  },
  {
    "speaker": null,
    "timestamp": "00:07:53",
    "line": "Ja, det är ändå intressant hur det där har gått, för jag har ju alltid varit så här, jag måste in till ett kontor, för annars kommer inte jag jobba."
  },
  {
    "speaker": null,
    "timestamp": "00:08:02",
    "line": "Jag har aldrig tänkt att remote är för mig. Jag har istället blivit en sån här, ja men remote kanske inte är så dumt ändå."
  },
  {
    "speaker": null,
    "timestamp": "00:08:11",
    "line": "Men jag har ju å andra sidan, jag är enormt privilegierad i att jag har möjlighet att skaffa mig bra rutiner,"
  },
  {
    "speaker": null,
    "timestamp": "00:08:20",
    "line": "sitta vid en arbetsstation hemma som funkar bra, jag har ett höj- och sänkbart skrivbord, jag har en stol som är helt okej,"
  },
  {
    "speaker": null,
    "timestamp": "00:08:29",
    "line": "jag har en extern skärm, extern tangentbord och trackpad som jag fått låna från kund och sådär grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:08:36",
    "line": "Så jag har det jättebra. Vi har också en trea."
  },
  {
    "speaker": null,
    "timestamp": "00:08:40",
    "line": "Så jag och min sambo jobbar båda hemma, men han kan sitta i ett rum och jag kan sitta i ett annat rum."
  },
  {
    "speaker": null,
    "timestamp": "00:08:45",
    "line": "Så på det sättet så har ju vi stor fördel jämt emot många andra som skapar ståbord av strykbrädor och sitter inne i lekrum."
  },
  {
    "speaker": null,
    "timestamp": "00:08:55",
    "line": "Ja, där har man ju varit lite grann."
  },
  {
    "speaker": null,
    "timestamp": "00:08:57",
    "line": "Jag tycker att det funkar väl okej för mig också, även om ergonomin inte är det bästa."
  },
  {
    "speaker": null,
    "timestamp": "00:09:03",
    "line": "Jag har tagit mitt pyttelilla matbord, gjort om till ett skrivbord,"
  },
  {
    "speaker": null,
    "timestamp": "00:09:07",
    "line": "sitter på en kökstol med två kuddar i."
  },
  {
    "speaker": null,
    "timestamp": "00:09:10",
    "line": "Jag har en extern skärm att ta in på de hus, så det är ju nice."
  },
  {
    "speaker": null,
    "timestamp": "00:09:15",
    "line": "Men det är ju inte den mest ergonomiska kontorsplatsen jag har haft i mitt liv, om man säger så."
  },
  {
    "speaker": null,
    "timestamp": "00:09:21",
    "line": "Nej, jag tänker att vinklarna inte är så bra för dig heller, för du är rätt lång."
  },
  {
    "speaker": null,
    "timestamp": "00:09:25",
    "line": "Ja, exakt. Det går inte riktigt att anpassa höjd och grejer på saker,"
  },
  {
    "speaker": null,
    "timestamp": "00:09:31",
    "line": "vilket gör det lite svårare."
  },
  {
    "speaker": null,
    "timestamp": "00:09:32",
    "line": "Så jag har funderat om jag skulle faktiskt investera i det, men jag har liksom inte riktigt plats här hemma känner jag för det, så att vi får se."
  },
  {
    "speaker": null,
    "timestamp": "00:09:38",
    "line": "Ja, och så blir det ju också en sån här grej. Skulle man ha investerat i det, då skulle man ju ha investerat mycket i början."
  },
  {
    "speaker": null,
    "timestamp": "00:09:43",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:09:44",
    "line": "Men det var ingen som tänkte att vi skulle pågå så här länge."
  },
  {
    "speaker": null,
    "timestamp": "00:09:46",
    "line": "Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:09:47",
    "line": "Och nu är det snarare att alla hoppas ju på att vi ska komma ur det."
  },
  {
    "speaker": null,
    "timestamp": "00:09:50",
    "line": "Ja, gud ja."
  },
  {
    "speaker": null,
    "timestamp": "00:09:50",
    "line": "Så då vill man ju inte lägga svin mycket på det."
  },
  {
    "speaker": null,
    "timestamp": "00:09:53",
    "line": "Nej, näe alltså så här, om jag skulle investera så här, det var kanske för att jag kände så här, fan det skulle vara rätt nice att ha ett skivbord hemma ändå."
  },
  {
    "speaker": null,
    "timestamp": "00:09:59",
    "line": "Mm."
  },
  {
    "speaker": null,
    "timestamp": "00:09:59",
    "line": "För att man jobbar på lite hobbyprojekt och grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:10:02",
    "line": "Och innan jag satte upp externa skärmen så blev det ofta att man hamnade i soffan."
  },
  {
    "speaker": null,
    "timestamp": "00:10:07",
    "line": "Och liksom satt där, och det är inte mer ergonomiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:10:09",
    "line": "Så att det kanske är mer att investera för, oavsett jobbsituation just nu."
  },
  {
    "speaker": null,
    "timestamp": "00:10:14",
    "line": "Men ja, jag vet inte. Det är ju lite svårt. Jag tycker också att det är så svårt att avgöra liksom så här,"
  },
  {
    "speaker": null,
    "timestamp": "00:10:20",
    "line": "att jag säger att jag inte gillar att jobba hemma nu"
  },
  {
    "speaker": null,
    "timestamp": "00:10:22",
    "line": "kan ju också bero på att det är ju lite extraordinära omständigheter."
  },
  {
    "speaker": null,
    "timestamp": "00:10:27",
    "line": "Jag kanske egentligen hade gillat att jobba hemma om jag hade börjat på ett helt remote, 100% remote first bolag"
  },
  {
    "speaker": null,
    "timestamp": "00:10:34",
    "line": "och liksom haft en ordentlig arbetsplats hemma och ändå kunnat träffa folk normalt på sidan av."
  },
  {
    "speaker": null,
    "timestamp": "00:10:40",
    "line": "Ja, det tänker jag kanske är skillnaden. För jag menar, jag tror att jag skulle ha mycket svårare att jobba remote"
  },
  {
    "speaker": null,
    "timestamp": "00:10:47",
    "line": "om alla andra är på kontoret och jag är hemma ensam. Det är väl därför jag har sagt att jag inte tycker om det tidigare."
  },
  {
    "speaker": null,
    "timestamp": "00:10:53",
    "line": "Det är den här FOMO-n. Att bara ha en dag hemma och man vet att det pågår andra konversationer på kontoret utanför slack."
  },
  {
    "speaker": null,
    "timestamp": "00:11:01",
    "line": "Ja, exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:11:02",
    "line": "Det tycker jag är jobbigt för då missar jag information liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:11:05",
    "line": "Men jag menar, hur har det funkat för dig att komma in på en ny kund?"
  },
  {
    "speaker": null,
    "timestamp": "00:11:10",
    "line": "Ja, alltså så här, det har funkat rätt bra faktiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:11:14",
    "line": "Det hade ju funkat bättre på kontoret, 100% säker på."
  },
  {
    "speaker": null,
    "timestamp": "00:11:19",
    "line": "Men det har ändå funkat rätt bra."
  },
  {
    "speaker": null,
    "timestamp": "00:11:22",
    "line": "Jag tror att det kanske beror lite på att jag inte är så rädd för att ställa massa dumma frågor."
  },
  {
    "speaker": null,
    "timestamp": "00:11:27",
    "line": "Det är lätt att känna samtidigt att man har frågat så jävla mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:11:33",
    "line": "Men då känner jag oftast också att det är bättre att jag kanske frågar en gång för mycket"
  },
  {
    "speaker": null,
    "timestamp": "00:11:38",
    "line": "än att jag sitter fast på någonting jättelänge."
  },
  {
    "speaker": null,
    "timestamp": "00:11:40",
    "line": "Och det tror jag hjälper väldigt mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:11:42",
    "line": "Men sen har det också varit väldigt så här att det var lite utmanande i början att få reda på vem är det som gör vad,"
  },
  {
    "speaker": null,
    "timestamp": "00:11:49",
    "line": "\"Vem är det jag ska fråga?\""
  },
  {
    "speaker": null,
    "timestamp": "00:11:51",
    "line": "Nu kör vi också Slack, så jag har kunnat slänga ut frågorna i Slack-kanaler bara, egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:11:55",
    "line": "Och så har folk svarat."
  },
  {
    "speaker": null,
    "timestamp": "00:11:57",
    "line": "Och ju längre det har gått så har jag ändå fått lite mer koll på vad det gör folk."
  },
  {
    "speaker": null,
    "timestamp": "00:12:03",
    "line": "Vem är det som jag borde fråga om det här? Vem kan ha koll på det? Och så vidare och så där."
  },
  {
    "speaker": null,
    "timestamp": "00:12:06",
    "line": "Och det tror jag egentligen gäller att gå ganska mycket snabbare på ett kontor."
  },
  {
    "speaker": null,
    "timestamp": "00:12:09",
    "line": "För då kan man se när andra frågar dem."
  },
  {
    "speaker": null,
    "timestamp": "00:12:11",
    "line": "Det kommer folk, det springer folk och tar lite mer impromptu frågor och såna grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:12:16",
    "line": "Så jag tror att det är lättare att snabba upp lite sådana kontexter på ett kontor än vad det är när man sitter remote."
  },
  {
    "speaker": null,
    "timestamp": "00:12:21",
    "line": "Ja, det håller jag verkligen med om."
  },
  {
    "speaker": null,
    "timestamp": "00:12:24",
    "line": "För jag är också en sån som, jag ställer ju dumma frågor, sen så blir jag kanske lite trött ibland när jag får så otroligt grundläggande förklaringar."
  },
  {
    "speaker": null,
    "timestamp": "00:12:33",
    "line": "Alltså otroligt grundläggande förklaringar."
  },
  {
    "speaker": null,
    "timestamp": "00:12:36",
    "line": "Men jag fortsätter ändå ställa frågor för att jag ställer hellre en extra fråga och får det väldigt tydligt för mig än att jag missuppfattar det måste göra om."
  },
  {
    "speaker": null,
    "timestamp": "00:12:44",
    "line": "Det händer ju fortfarande självklart, men det reducerar ju ändå risken för det."
  },
  {
    "speaker": null,
    "timestamp": "00:12:50",
    "line": "– Ja, för sen tycker jag att det har funkat bra. Vi kör ju typ en stand-up varje morgon."
  },
  {
    "speaker": null,
    "timestamp": "00:12:58",
    "line": "Där vi snackar ihop oss, och sen så ställer vi också frågan så här, är det någon som behöver prata med varann"
  },
  {
    "speaker": null,
    "timestamp": "00:13:04",
    "line": "liksom under dagen, som behöver boka in någonting, eller är det någon som sitter fast och behöver göra någonting?"
  },
  {
    "speaker": null,
    "timestamp": "00:13:09",
    "line": "Och det ska man väl göra oavsett, men det kanske är extra viktigt nu när man är helt remote."
  },
  {
    "speaker": null,
    "timestamp": "00:13:13",
    "line": "Och särskilt för min del så har jag känt att det är ett bra tillfälle att säga \"jag skulle behöva hjälp med det här\"."
  },
  {
    "speaker": null,
    "timestamp": "00:13:17",
    "line": "Och då har jag liksom alla där som då kan de ta ansvaret att se till att rätt person hjälper mig."
  },
  {
    "speaker": null,
    "timestamp": "00:13:24",
    "line": "– Ja, men det är ju toppen för det är så himla svårt att veta i början."
  },
  {
    "speaker": null,
    "timestamp": "00:13:28",
    "line": "Man får ett \"name droppa\" till sig och man bara \"jag vet inte vem det är eller ens vad personen har för roll\"."
  },
  {
    "speaker": null,
    "timestamp": "00:13:32",
    "line": "– Nej, nej, men exakt. – Hur den ska hjälpa mig. Så det är ju toppen."
  },
  {
    "speaker": null,
    "timestamp": "00:13:36",
    "line": "Och sen det bolaget som jag börjar på nu, nu har de också gjort en väldigt bra grej att det här kör de alltid, men också bra att fortsätta med det nu är att köra så här onboarding luncher."
  },
  {
    "speaker": null,
    "timestamp": "00:13:45",
    "line": "Och då är det liksom inte att jag lunchar med någon person som är min chef typ, utan det är snarare typ så här att jag lunchar med så många som möjligt."
  },
  {
    "speaker": null,
    "timestamp": "00:13:51",
    "line": "Så den här veckan har jag haft liksom fem luncher. En lunch varje dag med typ tre eller fyra personer. Bara för att liksom lära känna så många som möjligt, få lite ansikten på folk."
  },
  {
    "speaker": null,
    "timestamp": "00:14:00",
    "line": "Superkonstigt att hälsa om folk för första gången över videokontrollen."
  },
  {
    "speaker": null,
    "timestamp": "00:14:04",
    "line": "Men efter tredje onsdags någon gång, där började jag vänja mig."
  },
  {
    "speaker": null,
    "timestamp": "00:14:10",
    "line": "\"Hej, kul att träffas!\""
  },
  {
    "speaker": null,
    "timestamp": "00:14:12",
    "line": "Det är också så svårt, för det är så inpräntat här med att ta i hand och säga sitt namn."
  },
  {
    "speaker": null,
    "timestamp": "00:14:20",
    "line": "Alltså att presentera sig själv."
  },
  {
    "speaker": null,
    "timestamp": "00:14:22",
    "line": "Här kommer man in, de vet redan namnet, det står namnet på din bild, och man bara \"Tja!\""
  },
  {
    "speaker": null,
    "timestamp": "00:14:28",
    "line": "Tja!"
  },
  {
    "speaker": null,
    "timestamp": "00:14:29",
    "line": "Ja, men det blir lite märkligt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:32",
    "line": "Det är lite som att hålla tekniska intervjuer."
  },
  {
    "speaker": null,
    "timestamp": "00:14:34",
    "line": "Där har vi faktiskt hållit en tillsammans också."
  },
  {
    "speaker": null,
    "timestamp": "00:14:37",
    "line": "Men det blir också lite så här awkward."
  },
  {
    "speaker": null,
    "timestamp": "00:14:39",
    "line": "Man sitter och helt plötsligt så ploppar någon upp som man ska intervjua."
  },
  {
    "speaker": null,
    "timestamp": "00:14:43",
    "line": "Och man bara \"Hej, hej!\""
  },
  {
    "speaker": null,
    "timestamp": "00:14:46",
    "line": "Ja, Gud. Alltså, just det."
  },
  {
    "speaker": null,
    "timestamp": "00:14:49",
    "line": "Vi har ju hållit en och sen har jag hållit två till, tror jag, remote tekniska intervjuer."
  },
  {
    "speaker": null,
    "timestamp": "00:14:54",
    "line": "Och det är ju väldigt konstigt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:57",
    "line": "Alltså just det här initialen, när man liksom vill få till lite, för jag är ju en sån, min intervjuteknik är ju väldigt mycket att snacka ganska mycket skit."
  },
  {
    "speaker": null,
    "timestamp": "00:15:05",
    "line": "Alltså jag vill liksom få folk som kommer på intervjuerna att känna sig liksom lugna. Man vill liksom ändå kunna få"
  },
  {
    "speaker": null,
    "timestamp": "00:15:12",
    "line": "bara lite kall prat där man liksom inte tänker på någonting annat, där man liksom blir bekväm med varandra."
  },
  {
    "speaker": null,
    "timestamp": "00:15:17",
    "line": "Och jag tycker det är mycket svårare på videosamtal än när man träffas på riktigt liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:15:23",
    "line": "Ja, jag är lite den här, jag tycker det är jobbigt när det blir tyst, när man är få personer också."
  },
  {
    "speaker": null,
    "timestamp": "00:15:30",
    "line": "Och då har jag haft upplevelser där jag hade en som liksom låg efter."
  },
  {
    "speaker": null,
    "timestamp": "00:15:36",
    "line": "Så den andra som jag intervjuade med, som egentligen är Lidora, låg väldigt mycket efter."
  },
  {
    "speaker": null,
    "timestamp": "00:15:43",
    "line": "Och då blev jag nog väldigt stressad. Så det är sådana små grejer som man inte tänker på också."
  },
  {
    "speaker": null,
    "timestamp": "00:15:48",
    "line": "Att det inte finns den direkta återkopplingen med den andra personen tyckte jag var väldigt svårt."
  },
  {
    "speaker": null,
    "timestamp": "00:15:54",
    "line": "Ja, och så mycket av kommunikationen man sänder ut är ju kropps..."
  },
  {
    "speaker": null,
    "timestamp": "00:15:59",
    "line": "Alltså hur man rör sig och hur man beter sig."
  },
  {
    "speaker": null,
    "timestamp": "00:16:02",
    "line": "Alltså väldigt små, små grejer som man snappar upp när man mer ser folk."
  },
  {
    "speaker": null,
    "timestamp": "00:16:07",
    "line": "Eller när man är i samma rum som någon."
  },
  {
    "speaker": null,
    "timestamp": "00:16:09",
    "line": "Medan i video så försvinner så fruktansvärt mycket av det där."
  },
  {
    "speaker": null,
    "timestamp": "00:16:12",
    "line": "Ja, och så blir det att ibland så fastnar jag bara och stirrar på mig själv"
  },
  {
    "speaker": null,
    "timestamp": "00:16:16",
    "line": "För hur konstig jag ser ut."
  },
  {
    "speaker": null,
    "timestamp": "00:16:18",
    "line": "Och det är ju inte kanske rätt fokus."
  },
  {
    "speaker": null,
    "timestamp": "00:16:22",
    "line": "- Det är ju inte superbekvämt att alltid se sig själv."
  },
  {
    "speaker": null,
    "timestamp": "00:16:25",
    "line": "I en sån där liten ruta bredvid när man sitter och intervjuar någon annan."
  },
  {
    "speaker": null,
    "timestamp": "00:16:27",
    "line": "Och ska ha fullt fokus där."
  },
  {
    "speaker": null,
    "timestamp": "00:16:29",
    "line": "Och sen se \"Vad fan gjorde jag nu?\""
  },
  {
    "speaker": null,
    "timestamp": "00:16:31",
    "line": "- Men då blir det också vissa som säger \"Jag tittar inte alls på mig själv\"."
  },
  {
    "speaker": null,
    "timestamp": "00:16:35",
    "line": "Och det är ju rimligt, för det är ju så man lever sitt liv vanligtvis."
  },
  {
    "speaker": null,
    "timestamp": "00:16:39",
    "line": "Men jag vill ju ändå ha lite kontroll på att inte ha ballat ur fullständigt."
  },
  {
    "speaker": null,
    "timestamp": "00:16:45",
    "line": "Du lever med skräcken att det skulle balla ur fullständigt."
  },
  {
    "speaker": null,
    "timestamp": "00:16:49",
    "line": "Vilket är jättekonstigt. Men det blir så, i det verkliga livet så har man ju inte någon som stirrar på en konstant."
  },
  {
    "speaker": null,
    "timestamp": "00:16:57",
    "line": "Oftast. Det är inte så att i ett möte med tre personer så sitter en person och bara stirrar på dig och ser dig,"
  },
  {
    "speaker": null,
    "timestamp": "00:17:03",
    "line": "varenda rörelse du gör hela tiden. Men det sker ju ett videosamtal om man tittar på skärmen."
  },
  {
    "speaker": null,
    "timestamp": "00:17:07",
    "line": "Ja, exakt. Och det är också lite så här, det är lite svårt i videosamtal att säga att man är tre personer,"
  },
  {
    "speaker": null,
    "timestamp": "00:17:12",
    "line": "personer som vi brukar vara nu och håller tekniska intervjuer, så är det lite svårt att få se vem"
  },
  {
    "speaker": null,
    "timestamp": "00:17:16",
    "line": "tittar den andra på."
  },
  {
    "speaker": null,
    "timestamp": "00:17:18",
    "line": "Alltså för att sitter vi på en vanlig intervju så sitter vi kanske bredvid varandra och sedan kandidaten"
  },
  {
    "speaker": null,
    "timestamp": "00:17:24",
    "line": "pannar sina bordet. Då är det så enkelt att för mig, om jag sitter och funderar på nästa fråga men inte har"
  },
  {
    "speaker": null,
    "timestamp": "00:17:29",
    "line": "en redo så är det så lätt för mig att titta till vänster på dig till exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:17:33",
    "line": "Och då kan du fatta att det inte är på GM frågat nu direkt."
  },
  {
    "speaker": null,
    "timestamp": "00:17:38",
    "line": "Men i videosamtal så är det så här, ja det blir tyst."
  },
  {
    "speaker": null,
    "timestamp": "00:17:42",
    "line": "Båda sitter och tänker samma sak. Man kan inte titta till vänster eller till höger."
  },
  {
    "speaker": null,
    "timestamp": "00:17:48",
    "line": "Det är väldigt förvirrande på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:17:52",
    "line": "Ja, det är rätt stressigt. Däremot hos kund när vi har möten med åtta personer eller sex personer och uppåt."
  },
  {
    "speaker": null,
    "timestamp": "00:18:04",
    "line": "Då har jag ändå börjat finna lite fröjd i att bara sitta mjutad och stirra på folk."
  },
  {
    "speaker": null,
    "timestamp": "00:18:11",
    "line": "För det är alltid någon som brejkar först."
  },
  {
    "speaker": null,
    "timestamp": "00:18:13",
    "line": "(skratt)"
  },
  {
    "speaker": null,
    "timestamp": "00:18:15",
    "line": "Vi har specifikt en person som verkligen inte klarar tissnaden."
  },
  {
    "speaker": null,
    "timestamp": "00:18:19",
    "line": "Det är så tydligt och hon har sagt det själv."
  },
  {
    "speaker": null,
    "timestamp": "00:18:21",
    "line": "Så det går typ två sekunder och sen börjar hon prata."
  },
  {
    "speaker": null,
    "timestamp": "00:18:24",
    "line": "För att hon står inte ut."
  },
  {
    "speaker": null,
    "timestamp": "00:18:26",
    "line": "(skratt)"
  },
  {
    "speaker": null,
    "timestamp": "00:18:28",
    "line": "Jag föreslog annars att vi skulle göra en lek där vi bara satte och stirrade på varandra."
  },
  {
    "speaker": null,
    "timestamp": "00:18:33",
    "line": "och såg vilka som breakade först."
  },
  {
    "speaker": null,
    "timestamp": "00:18:35",
    "line": "(Skratt)"
  },
  {
    "speaker": null,
    "timestamp": "00:18:37",
    "line": "- Ja, Gud, hemskt."
  },
  {
    "speaker": null,
    "timestamp": "00:18:39",
    "line": "Jag kan ändå njuta av att det blir lite obekvämt ibland."
  },
  {
    "speaker": null,
    "timestamp": "00:18:43",
    "line": "Eller att det blir lite stel stämning."
  },
  {
    "speaker": null,
    "timestamp": "00:18:46",
    "line": "Jag kan ändå liksom... Jag bryr mig inte jättemycket om det."
  },
  {
    "speaker": null,
    "timestamp": "00:18:49",
    "line": "Vilket gör att det är ganska kul när det väl händer."
  },
  {
    "speaker": null,
    "timestamp": "00:18:51",
    "line": "Så kan man titta på folk och se hur de vrider lite på sig."
  },
  {
    "speaker": null,
    "timestamp": "00:18:54",
    "line": "- Såklart, du finner glädje i det."
  },
  {
    "speaker": null,
    "timestamp": "00:18:56",
    "line": "- Ja, vad fan. Det är någonting som man hittar glädje i i livet."
  },
  {
    "speaker": null,
    "timestamp": "00:19:01",
    "line": "Men videomöten är någonting speciellt. Jag har egentligen inga problem med det."
  },
  {
    "speaker": null,
    "timestamp": "00:19:08",
    "line": "Där blir det inte riktigt samma grej. Visst att folk vill prata, men där ser jag inte om folk blir oberoende av det på samma sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:19:15",
    "line": "Man ser lite grann på ansiktsuttrycket och sånt där, och när folk börjar titta så ser man ögonen flacka lite grann."
  },
  {
    "speaker": null,
    "timestamp": "00:19:21",
    "line": "Men det är inte samma känsla, tycker jag, i ett videosamtal när det blir tyst som på riktigt."
  },
  {
    "speaker": null,
    "timestamp": "00:19:28",
    "line": "Nej, jag har mycket lättare för när det blir tystigt videosamtal, för det är bara att vara mjutad."
  },
  {
    "speaker": null,
    "timestamp": "00:19:32",
    "line": "Och så sitter man där skyddad. Jag tycker det är mycket jobbigare live."
  },
  {
    "speaker": null,
    "timestamp": "00:19:36",
    "line": "Jag har jätteproblem med det live."
  },
  {
    "speaker": null,
    "timestamp": "00:19:38",
    "line": "Så jag tränar lite nu, kan man kalla det."
  },
  {
    "speaker": null,
    "timestamp": "00:19:42",
    "line": "Men det här kanske är superintressant egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:19:46",
    "line": "Men vad kör ni för videotjänst?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:50",
    "line": "Hos kunden så kör vi Hangout."
  },
  {
    "speaker": null,
    "timestamp": "00:19:53",
    "line": "Och det tyckte jag blev mycket bättre än det jag drog hem, den här Chrome extensionen, Hangout Grid."
  },
  {
    "speaker": null,
    "timestamp": "00:19:57",
    "line": "Just det, så man ser fler samtidigt va?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:59",
    "line": "Ja, det blir svårt när någon kör screen share, då får man ju plocka bort det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:04",
    "line": "Men annars tycker jag det är mycket bättre när man ser alla samtidigt."
  },
  {
    "speaker": null,
    "timestamp": "00:20:08",
    "line": "Sen så har vi när vi kodat lite, kört lite Zoom."
  },
  {
    "speaker": null,
    "timestamp": "00:20:12",
    "line": "Men eftersom vi kör gratis-versionen så får man ju liksom starta upp mötet efter 40 minuter varje gång, vilket är rätt irriterande."
  },
  {
    "speaker": null,
    "timestamp": "00:20:19",
    "line": "Men annars tycker jag det är bäst att dela med liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:20:23",
    "line": "Sen kör vi Teams på Empyre."
  },
  {
    "speaker": null,
    "timestamp": "00:20:25",
    "line": "Men största skräcken är ju att dela skärm och råka visa upp sin slack. Så det är en helt ny skräck."
  },
  {
    "speaker": null,
    "timestamp": "00:20:35",
    "line": "- Ja, jag vet inte. Det känns som att vi har testat hundra olika tjänster. Jag tycker att Teams funkar väl, men det problemet där är att man bara ser fyra personer."
  },
  {
    "speaker": null,
    "timestamp": "00:20:47",
    "line": "Nu ska de väl ändra sig till 9 tror jag i nästa version eller något sånt där."
  },
  {
    "speaker": null,
    "timestamp": "00:20:52",
    "line": "Men jag tycker 9 är också så här, är man fler än 9 vill man ju fortfarande se alla typ."
  },
  {
    "speaker": null,
    "timestamp": "00:20:55",
    "line": "Så att vi får väl se hur det blir med det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:58",
    "line": "Men sen som du sa, jag har också kört hangouts."
  },
  {
    "speaker": null,
    "timestamp": "00:21:00",
    "line": "På kunden kör jag så här Wearbuy."
  },
  {
    "speaker": null,
    "timestamp": "00:21:04",
    "line": "Det är faktiskt ganska nice, alltså man ser ganska många samtidigt."
  },
  {
    "speaker": null,
    "timestamp": "00:21:08",
    "line": "Och där har man liksom permanenta länkar."
  },
  {
    "speaker": null,
    "timestamp": "00:21:11",
    "line": "Så att folk har typ så här kontor eller rum i Wearbuy."
  },
  {
    "speaker": null,
    "timestamp": "00:21:15",
    "line": "Så om jag skulle ha det så skulle jag gå in på wherebuy.com/anton."
  },
  {
    "speaker": null,
    "timestamp": "00:21:19",
    "line": "Och då kommer man in till mitt rum."
  },
  {
    "speaker": null,
    "timestamp": "00:21:21",
    "line": "Och då kan man liksom sitta där, så att om jag behöver något så kan han säga,"
  },
  {
    "speaker": null,
    "timestamp": "00:21:25",
    "line": "om jag behöver fråga någonting, och då bara vi tar ett videosamtal,"
  },
  {
    "speaker": null,
    "timestamp": "00:21:28",
    "line": "då bara hoppa in i mitt kontor."
  },
  {
    "speaker": null,
    "timestamp": "00:21:30",
    "line": "Och så kan man hoppa in och så blir det ett videosamtal."
  },
  {
    "speaker": null,
    "timestamp": "00:21:33",
    "line": "Och det tycker jag funkar ganska bra, för då behöver man ju inte starta upp någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:21:36",
    "line": "Man behöver liksom inte göra någonting, man har alltid den länken liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:21:38",
    "line": "- Ja, då ska man behålla koll på den länken då."
  },
  {
    "speaker": null,
    "timestamp": "00:21:41",
    "line": "- Ja, det är väl det som är problemet."
  },
  {
    "speaker": null,
    "timestamp": "00:21:43",
    "line": "Alla som har en eget har lagt till en länk på sin Slack-profil."
  },
  {
    "speaker": null,
    "timestamp": "00:21:49",
    "line": "Så man alltid kan komma åt den där."
  },
  {
    "speaker": null,
    "timestamp": "00:21:52",
    "line": "Sen finns det även en för hela bolaget."
  },
  {
    "speaker": null,
    "timestamp": "00:21:54",
    "line": "När vi kör våra möten för alla, då hoppar man in i det rummet istället."
  },
  {
    "speaker": null,
    "timestamp": "00:22:00",
    "line": "Det är ganska nice. Men när du har kört hela bolaget,"
  },
  {
    "speaker": null,
    "timestamp": "00:22:05",
    "line": "då streamar de ju istället om det är information och sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:22:10",
    "line": "Ja, men du är på ett väldigt stort bolag, så ska det sägas."
  },
  {
    "speaker": null,
    "timestamp": "00:22:13",
    "line": "– Ja, det är större. – Så det går ju typ inte att skärmdela till så pass många personer."
  },
  {
    "speaker": null,
    "timestamp": "00:22:19",
    "line": "– Nej. – Så att ja."
  },
  {
    "speaker": null,
    "timestamp": "00:22:20",
    "line": "– Men sen har vi kört mer, vi kör slack en del på…"
  },
  {
    "speaker": null,
    "timestamp": "00:22:24",
    "line": "– Ja, exakt. Slack tror jag mycket att jag kör bara för att det är lämpligt."
  },
  {
    "speaker": null,
    "timestamp": "00:22:29",
    "line": "– Ja, men det är lätt, liksom. – Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:22:31",
    "line": "– Men det är ju mer när vi kör om vi bara ska luncha med vårt crew som vi har, eller så här,"
  },
  {
    "speaker": null,
    "timestamp": "00:22:37",
    "line": "Om jag ska luncha med någon på en paja, då är det jättelätt att bara dra upp en slack och så blir det inget konstigt."
  },
  {
    "speaker": null,
    "timestamp": "00:22:45",
    "line": "Men det funkar inte så väl att jobba med."
  },
  {
    "speaker": null,
    "timestamp": "00:22:48",
    "line": "Nej, och jag tycker också problemet är att man ser bara en person åt gången."
  },
  {
    "speaker": null,
    "timestamp": "00:22:51",
    "line": "Eller man ser en person stort och sen massa små."
  },
  {
    "speaker": null,
    "timestamp": "00:22:55",
    "line": "Och det tycker jag är skitdrygt om man ska ha ett möte där man vill kunna prata med alla."
  },
  {
    "speaker": null,
    "timestamp": "00:23:00",
    "line": "Sen har ju du ditt som du lobbyar för hela tiden, Jitsi."
  },
  {
    "speaker": null,
    "timestamp": "00:23:05",
    "line": "meetpointjitsi, eller vad heter det. Det tycker jag är, alltså det är typ en Zoom-kopia, fast gratis."
  },
  {
    "speaker": null,
    "timestamp": "00:23:14",
    "line": "Och i browsern. Ja, Zoom kör väl också i browsern."
  },
  {
    "speaker": null,
    "timestamp": "00:23:18",
    "line": "Ja, precis. Och sen det är helt open source också. Så man kan hosta det själv om man vill, vilket är väldigt nice."
  },
  {
    "speaker": null,
    "timestamp": "00:23:23",
    "line": "Men den har jag kört väldigt mycket. För det var när jag letade efter Zoom-alternativ för att kunna köra längre än 40 minuter."
  },
  {
    "speaker": null,
    "timestamp": "00:23:30",
    "line": "Då hittar jag det. Och det har jag kört väldigt mycket. Särskilt på AV så har jag kört det."
  },
  {
    "speaker": null,
    "timestamp": "00:23:34",
    "line": "För då är det väldigt nice att \"ja men vafan, då kan man bara skicka en länk till någon och så kan man gå in och se alla inne liksom\"."
  },
  {
    "speaker": null,
    "timestamp": "00:23:39",
    "line": "Ja, för det där var så konstigt när, om man ska prata om att köra AV med kompisar som jag aldrig kört remote med tidigare eller inte jobbat med."
  },
  {
    "speaker": null,
    "timestamp": "00:23:48",
    "line": "Då var det så här \"Ja, hur fan gör man? Facetime? Nej men det funkar inte för att du har ingen Apple och det var hur? Ja men vi kör en hangout\"."
  },
  {
    "speaker": null,
    "timestamp": "00:23:58",
    "line": "\"Det funkar inte för mig\", kom någon. Alltså, det var totalt kaos."
  },
  {
    "speaker": null,
    "timestamp": "00:24:01",
    "line": "Jag var helt oparädd på att det skulle vara så svårt."
  },
  {
    "speaker": null,
    "timestamp": "00:24:04",
    "line": "Ja, jag håller exakt samma upplevelse, tills jag hittar Jitsi."
  },
  {
    "speaker": null,
    "timestamp": "00:24:09",
    "line": "Tills Jitsi räddade dig."
  },
  {
    "speaker": null,
    "timestamp": "00:24:11",
    "line": "Exakt, exakt. Men det är lite intressant också, så här, avkulturen som ändå lever kvar."
  },
  {
    "speaker": null,
    "timestamp": "00:24:18",
    "line": "Alltså, det är liksom samma avkultur, kanske inte på samma nivå."
  },
  {
    "speaker": null,
    "timestamp": "00:24:22",
    "line": "För det är inte riktigt samma sak att så här, alltså de avväs jag haft remote nu"
  },
  {
    "speaker": null,
    "timestamp": "00:24:26",
    "line": "Jag har ju bara varit med grupper av människor."
  },
  {
    "speaker": null,
    "timestamp": "00:24:28",
    "line": "Medan förut hade jag mycket lättare att gå och ta en öl med en kompis."
  },
  {
    "speaker": null,
    "timestamp": "00:24:32",
    "line": "Det gör jag typ inte längre."
  },
  {
    "speaker": null,
    "timestamp": "00:24:34",
    "line": "Nu är det mer att vi ser till att vi ses istället och det blir en grupp."
  },
  {
    "speaker": null,
    "timestamp": "00:24:40",
    "line": "Det där har jag tänkt lite på också."
  },
  {
    "speaker": null,
    "timestamp": "00:24:44",
    "line": "Att man ändå kanske borde försöka plocka med sig det."
  },
  {
    "speaker": null,
    "timestamp": "00:24:46",
    "line": "Nu gör jag inte det med personer, men jag har ju kompisar som bor i andra städer och långt bort."
  },
  {
    "speaker": null,
    "timestamp": "00:24:53",
    "line": "Och vi skriver ju mest."
  },
  {
    "speaker": null,
    "timestamp": "00:24:55",
    "line": "Jag vill ju verkligen kunna ta med sig den grejen att vi kör remote och att man får titta på varandra ibland och träffas."
  },
  {
    "speaker": null,
    "timestamp": "00:25:01",
    "line": "Ja, gud ja."
  },
  {
    "speaker": null,
    "timestamp": "00:25:02",
    "line": "Vilket man absolut skulle kunna plocka upp, vilket jag inte gjort än för att de kompisar som jag har som bor längre bort,"
  },
  {
    "speaker": null,
    "timestamp": "00:25:08",
    "line": "de är mer nära naturen än de är nära tekniken också, eventuellt. Så jag har inte föreslagit det för dem."
  },
  {
    "speaker": null,
    "timestamp": "00:25:18",
    "line": "Jag förstår. Jag tänker att du skulle få lite tech-support för att få igång det där."
  },
  {
    "speaker": null,
    "timestamp": "00:25:23",
    "line": "- Det tror jag absolut att de skulle klara, men jag tror kanske inte att de gillar hela grejen med att sitta vid en dator på samma sätt som jag."
  },
  {
    "speaker": null,
    "timestamp": "00:25:29",
    "line": "Det är ju mitt liv."
  },
  {
    "speaker": null,
    "timestamp": "00:25:30",
    "line": "- Men kan de inte ta med sig datorn ut i naturen och så ska man ju ha avis där?"
  },
  {
    "speaker": null,
    "timestamp": "00:25:34",
    "line": "- Ja, absolut. Jag måste föreslå det för dem."
  },
  {
    "speaker": null,
    "timestamp": "00:25:38",
    "line": "- Jag tycker ändå att det har varit sjukt nice att kunna fortsätta med avis."
  },
  {
    "speaker": null,
    "timestamp": "00:25:44",
    "line": "De sista två veckorna på mitt projekt, eller på min kund, som tog slut då, då körde vi ganska mycket avis."
  },
  {
    "speaker": null,
    "timestamp": "00:25:51",
    "line": "Det var nog för att det var en lite så här deppig stämning kanske för att alla konsulter blev uppsagda och branschen gick inte så bra överhuvudtaget och så där."
  },
  {
    "speaker": null,
    "timestamp": "00:25:58",
    "line": "Men då blev det ändå ganska mycket avis och det hjälpte ganska mycket i början också."
  },
  {
    "speaker": null,
    "timestamp": "00:26:03",
    "line": "Så här att det var fan nu är vi hemma men vi fortsätter då hålla det här."
  },
  {
    "speaker": null,
    "timestamp": "00:26:07",
    "line": "Så då körde vi liksom avis när vi typ satt och drack öl och spelade några spel och såna grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:26:12",
    "line": "Så att jag tycker det har ändå funkat ganska bra."
  },
  {
    "speaker": null,
    "timestamp": "00:26:16",
    "line": "Även om det känns som att det blir kortare avis nu, vilket är ganska naturligt i och för sig."
  },
  {
    "speaker": null,
    "timestamp": "00:26:21",
    "line": "Ja, och egentligen kanske inte det är så dumt för att avis tenderar ju att bli alldeles för långa."
  },
  {
    "speaker": null,
    "timestamp": "00:26:27",
    "line": "Jag blir så här, ja, nu jag orkar inte en avis den här veckan för att jag kommer vara sliten."
  },
  {
    "speaker": null,
    "timestamp": "00:26:33",
    "line": "Men egentligen om man var bättre på att köra en två timmars avis så skulle man ju kunna ha några fler."
  },
  {
    "speaker": null,
    "timestamp": "00:26:39",
    "line": "Ja, men du är ju också väldigt, väldigt bra på att brexita."
  },
  {
    "speaker": null,
    "timestamp": "00:26:41",
    "line": "Jajamän, vad jag precis."
  },
  {
    "speaker": null,
    "timestamp": "00:26:43",
    "line": "Det är ju en av mina bästa kvaliteter. Du är jävla bra på det. Men det är inte så mycket att jag, det är säkert lite FOMO men framförallt är det att jag inte gillar att transportera mig."
  },
  {
    "speaker": null,
    "timestamp": "00:26:59",
    "line": "Ja, det förstår jag. Jag tänker att Brexit är ju inte lika mycket som en remote-AV."
  },
  {
    "speaker": null,
    "timestamp": "00:27:07",
    "line": "Men det är ju den här grejen att har jag redan transporterat mig någonstans, till exempel från kunden till vårt kontor och så sitter jag där, då kanske jag ändå känner att måste jag röra på mig igen?"
  },
  {
    "speaker": null,
    "timestamp": "00:27:21",
    "line": "Det är ju helt orimligt, jag har ju redan förflyttat mig en gång. Så då drar jag ut på det."
  },
  {
    "speaker": null,
    "timestamp": "00:27:27",
    "line": "Ja, jag förstår helt hållet. Jag tror inte jag har så jobbigt att transportera mig."
  },
  {
    "speaker": null,
    "timestamp": "00:27:33",
    "line": "Jag tror mer att det är FOMO för mig. Att jag kanske ska gå."
  },
  {
    "speaker": null,
    "timestamp": "00:27:38",
    "line": "Det är kul när jag har det."
  },
  {
    "speaker": null,
    "timestamp": "00:27:40",
    "line": "Du kanske inte Brexitar på samma sätt som jag gör. Du säger att du ska gå hem, du bara går inte hem."
  },
  {
    "speaker": null,
    "timestamp": "00:27:47",
    "line": "Ja, det tror jag. Det är det jag gör faktiskt. Du kan ju stå med jackan på."
  },
  {
    "speaker": null,
    "timestamp": "00:27:55",
    "line": "Och så blir det så här \"Ah, tur, den gick precis, jag orkar inte\"."
  },
  {
    "speaker": null,
    "timestamp": "00:27:58",
    "line": "- Ja, tar av dig jackan och sätter dig i soffan igen."
  },
  {
    "speaker": null,
    "timestamp": "00:28:01",
    "line": "- Så det blir så."
  },
  {
    "speaker": null,
    "timestamp": "00:28:03",
    "line": "- Ja, men jag tycker ändå att det är..."
  },
  {
    "speaker": null,
    "timestamp": "00:28:06",
    "line": "Vad fan, det är väl som det är, tänker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:28:09",
    "line": "Jag håller ju med dig, att det hade varit nice att kanske köra två timmars ave och sen gå hem."
  },
  {
    "speaker": null,
    "timestamp": "00:28:14",
    "line": "Men det är ju också väldigt roligt oftast."
  },
  {
    "speaker": null,
    "timestamp": "00:28:16",
    "line": "Alltså så här, att vara kvar."
  },
  {
    "speaker": null,
    "timestamp": "00:28:18",
    "line": "Särskilt alltså, på vårt kontor har vi typ så här, en kollega köpt in en karaoke-maskin för ett tag sedan."
  },
  {
    "speaker": null,
    "timestamp": "00:28:23",
    "line": "- Ja, Gud."
  },
  {
    "speaker": null,
    "timestamp": "00:28:24",
    "line": "Den kommer ju ofta fram, inte på de här två första timmarna, utan snarare på de två sista timmarna."
  },
  {
    "speaker": null,
    "timestamp": "00:28:28",
    "line": "- Och sen så är det ju någon som alltid måste brotta ner dig när du står med foten på rökmaskinen för att du har klippat."
  },
  {
    "speaker": null,
    "timestamp": "00:28:36",
    "line": "- Ja, men rökmaskin, det är någonting med det som är oerhört härligt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:40",
    "line": "Det är inte så mycket rök nu på mina remote-avis, känner jag."
  },
  {
    "speaker": null,
    "timestamp": "00:28:43",
    "line": "- Nej, det är ju synd. - Det är väldigt, väldigt tråkigt faktiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:47",
    "line": "Ja, jag vet inte. Remote AVs nu är ju mer att man snackar och sen typ spelar remote spel."
  },
  {
    "speaker": null,
    "timestamp": "00:28:54",
    "line": "Ja, jag körde ju remote AV i föregår, och där vi körde ditt ritspel."
  },
  {
    "speaker": null,
    "timestamp": "00:29:00",
    "line": "Ja, för jag har, jag har, det är, jag pratade om det här AV-projektet i förra avsnittet va?"
  },
  {
    "speaker": null,
    "timestamp": "00:29:06",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:29:07",
    "line": "När vi pratade overmind."
  },
  {
    "speaker": null,
    "timestamp": "00:29:08",
    "line": "Overmind, ja, precis."
  },
  {
    "speaker": null,
    "timestamp": "00:29:09",
    "line": "Precis."
  },
  {
    "speaker": null,
    "timestamp": "00:29:10",
    "line": "Och det är ju, alltså jag har ju byggt på det, inte specifikt för att det är, alltså aldrig var hemma, utan det har ju funnits, alltså jag byggde ju det i första versionen helt länge sedan."
  },
  {
    "speaker": null,
    "timestamp": "00:29:19",
    "line": "Men det passar ju perfekt nu för att det är ju liksom ett spel där man kan spela på en remote av."
  },
  {
    "speaker": null,
    "timestamp": "00:29:25",
    "line": "Ja, alltså det var så sjukt roligt för att man får ju också, man ritar och så ritar man individuellt i det här rummet."
  },
  {
    "speaker": null,
    "timestamp": "00:29:32",
    "line": "men det jag gjorde var att jag drog upp den här stora där man ser alla, vad alla har ritat och vad man får för poäng."
  },
  {
    "speaker": null,
    "timestamp": "00:29:38",
    "line": "Den skärmdelade jag."
  },
  {
    "speaker": null,
    "timestamp": "00:29:40",
    "line": "Ja, men precis. Det är den tanken jag har haft och den är jag har kört det själv också."
  },
  {
    "speaker": null,
    "timestamp": "00:29:44",
    "line": "Så har man kört så. För att förklara så att de som inte har spelat det fattar."
  },
  {
    "speaker": null,
    "timestamp": "00:29:48",
    "line": "Det är typ en, vad ska man säga, man kan rita gissaspel typ."
  },
  {
    "speaker": null,
    "timestamp": "00:29:53",
    "line": "Fast där man alla ritar och den som gissar är en extremt dålig maskininlärningsmodell"
  },
  {
    "speaker": null,
    "timestamp": "00:30:00",
    "line": "som är tränade på en massa ritade bilder."
  },
  {
    "speaker": null,
    "timestamp": "00:30:03",
    "line": "Och det är förvånansvärt roligt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:07",
    "line": "Mest för att alla är så jävla kassa på att rita på touchskärmar,"
  },
  {
    "speaker": null,
    "timestamp": "00:30:10",
    "line": "som man ritar ju ofta på mobilen."
  },
  {
    "speaker": null,
    "timestamp": "00:30:12",
    "line": "Ja, alltså jag ritade ju på touchpad."
  },
  {
    "speaker": null,
    "timestamp": "00:30:15",
    "line": "Det var ju helt fruktansvärt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:17",
    "line": "Plus att man får bara en viss tid på sig, så det blir superstressigt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:22",
    "line": "Jag tror att inställningen nu är att man har 20 sekunder på sig att rita, tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:30:25",
    "line": "Och sen har jag gjort det som du sa, man får upp en skärm, man ser alla spelare och så ser man live vad alla ritar."
  },
  {
    "speaker": null,
    "timestamp": "00:30:33",
    "line": "Så det är ett väldigt roligt projekt faktiskt. Och jag tror att det skulle kunna bli ganska lyckat."
  },
  {
    "speaker": null,
    "timestamp": "00:30:41",
    "line": "Jag har en kompis som sitter som konsult på SVT. Och där har det till och med blivit superpoppis på deras utvecklingsavdelning,"
  },
  {
    "speaker": null,
    "timestamp": "00:30:49",
    "line": "avdelning typ eller i deras team. Det kom upp på deras retor och fick en bild på att vad ska vi"
  },
  {
    "speaker": null,
    "timestamp": "00:30:54",
    "line": "\"continue to\" spela i det här spelet."
  },
  {
    "speaker": null,
    "timestamp": "00:30:57",
    "line": "Men det var så sjukt roligt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:59",
    "line": "Mitt absoluta favoritmoment var en person som ritade bra, men som alltid fick jättedåliga poäng och blev superfrustrerad."
  },
  {
    "speaker": null,
    "timestamp": "00:31:08",
    "line": "Det var ändå guldstjärna på hela upplevelsen, måste jag säga."
  },
  {
    "speaker": null,
    "timestamp": "00:31:12",
    "line": "Ja, det är väldigt kul."
  },
  {
    "speaker": null,
    "timestamp": "00:31:15",
    "line": "Och jag tror att jag har 50 olika motiv eller något som man ska rita, som jag har tränat den här modellen på."
  },
  {
    "speaker": null,
    "timestamp": "00:31:20",
    "line": "Så jag tänker att jag ska försöka..."
  },
  {
    "speaker": null,
    "timestamp": "00:31:21",
    "line": "Jag har ett litet problem med minnesläckan."
  },
  {
    "speaker": null,
    "timestamp": "00:31:23",
    "line": "Jag vet inte om det är en minnesläcka heller."
  },
  {
    "speaker": null,
    "timestamp": "00:31:25",
    "line": "Alltså, den använder liksom ingen databas, utan det är bara en sån här in-memory."
  },
  {
    "speaker": null,
    "timestamp": "00:31:28",
    "line": "Det är en variabel som jag lägger all data i."
  },
  {
    "speaker": null,
    "timestamp": "00:31:30",
    "line": "Vilket gör att det är väldigt mycket data."
  },
  {
    "speaker": null,
    "timestamp": "00:31:32",
    "line": "Så den går liksom upp i typ 500 MB RAM-användning, liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:31:36",
    "line": "Och jag kör den på Heroku, på deras lägsta betalnivå."
  },
  {
    "speaker": null,
    "timestamp": "00:31:42",
    "line": "Men då har jag liksom... Jag har 500 MB."
  },
  {
    "speaker": null,
    "timestamp": "00:31:44",
    "line": "Så den går upp i taket och sen börjar den swappa och strular för alla förmodligen."
  },
  {
    "speaker": null,
    "timestamp": "00:31:48",
    "line": "Jag kan ju säga att den buggade ur precis när Zoom sa till oss att \"less than a minute left\"."
  },
  {
    "speaker": null,
    "timestamp": "00:31:54",
    "line": "Det var perfekt tajmat. Det var inga halvmessyror. Det var såhär \"Okej, tack för ikväll, hej då\"."
  },
  {
    "speaker": null,
    "timestamp": "00:32:02",
    "line": "Så det är ganska brutala avslut."
  },
  {
    "speaker": null,
    "timestamp": "00:32:08",
    "line": "Det är inga kramar hej då nu för tiden."
  },
  {
    "speaker": null,
    "timestamp": "00:32:10",
    "line": "-Nej, så det är svårt att brexita liksom. -Ja, vi får se. Jag tänker att jag kanske ska fixa det här problemet så kanske vi kan liksom lansera den i nästa poddavsnitt och se om den kan bli någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:32:24",
    "line": "Men jag tycker att det kanske är det roligaste projektet jag har byggt tror jag. -Ja, jag vet inte vad du har byggt, men det är skitkul."
  },
  {
    "speaker": null,
    "timestamp": "00:32:31",
    "line": "Det känns ändå lite kul på något sätt med hela jobba hemifrån-grejen för att alla gör det."
  },
  {
    "speaker": null,
    "timestamp": "00:32:41",
    "line": "Pandemin i sig är inte kul såklart, men konceptet med att alla jobbar hemifrån är ganska intressant."
  },
  {
    "speaker": null,
    "timestamp": "00:32:47",
    "line": "Och att man går igenom det tillsammans på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:32:51",
    "line": "Och det blir en ganska rolig grej där alla säger \"ja men fan, ska vi inte testa det här?\""
  },
  {
    "speaker": null,
    "timestamp": "00:32:57",
    "line": "Det finns ju så här \"Drawful\" heter det va?"
  },
  {
    "speaker": null,
    "timestamp": "00:32:59",
    "line": "Som också är typ, alltså det är typ rita och gissa, fast i klassisk rita och gissa."
  },
  {
    "speaker": null,
    "timestamp": "00:33:04",
    "line": "En person ritar och sen gissar de andra tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:33:06",
    "line": "Som är något sånt där, samma som har gjort Jackbox-spelen tror jag att det kommer ifrån."
  },
  {
    "speaker": null,
    "timestamp": "00:33:11",
    "line": "Om du tar det här."
  },
  {
    "speaker": null,
    "timestamp": "00:33:12",
    "line": "Pass."
  },
  {
    "speaker": null,
    "timestamp": "00:33:12",
    "line": "Ja. Jackbox är också en sån där party-grej man kan köra."
  },
  {
    "speaker": null,
    "timestamp": "00:33:15",
    "line": "Men liksom det är lite kul ändå, för det bildar sig en ganska stor gemenskap,"
  },
  {
    "speaker": null,
    "timestamp": "00:33:20",
    "line": "även om den är ganska lös liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:33:22",
    "line": "Att så här, \"Ja men fan, nu, de här grejerna kan man göra\""
  },
  {
    "speaker": null,
    "timestamp": "00:33:24",
    "line": "och folk delar med sig av vad de har hittat och det blir väldigt mycket sånt som jag tycker är ganska fint på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:33:30",
    "line": "Ja men det är det, att se vad folk hittar på, de kommer samman och nya koncept och som du säger att alla sitter här."
  },
  {
    "speaker": null,
    "timestamp": "00:33:39",
    "line": "Det är väl det som gör att jag trivs med det."
  },
  {
    "speaker": null,
    "timestamp": "00:33:41",
    "line": "Plus att jag är ju en sån här \"äntligen har alla varit nere på min produktivitetsnivå\""
  },
  {
    "speaker": null,
    "timestamp": "00:33:47",
    "line": "så att jag inte behöver känna mig så dålig hela tiden."
  },
  {
    "speaker": null,
    "timestamp": "00:33:50",
    "line": "Det är ganska skönt."
  },
  {
    "speaker": null,
    "timestamp": "00:33:52",
    "line": "Men jag tror ändå att vi inte ska leva så här och att pandemin inte är något positivt som sett till att det är en pandemi."
  },
  {
    "speaker": null,
    "timestamp": "00:34:04",
    "line": "Men jag tror ändå att det finns mycket att ta lärdom av, att göra mer saker digitalt och att det faktiskt fungerar."
  },
  {
    "speaker": null,
    "timestamp": "00:34:10",
    "line": "För att lätta på vissa saker."
  },
  {
    "speaker": null,
    "timestamp": "00:34:13",
    "line": "Det finns också en sån sak som att vi kanske skulle kunna ha fler möten remote för att lasta av att alla behöver transportera sig till samma plats över en lunch för att sedan transportera sig tillbaka."
  },
  {
    "speaker": null,
    "timestamp": "00:34:24",
    "line": "Vilket kostar tid."
  },
  {
    "speaker": null,
    "timestamp": "00:34:26",
    "line": "Ja, verkligen. Det blir väldigt intressant att se vart det landar om ett år."
  },
  {
    "speaker": null,
    "timestamp": "00:34:31",
    "line": "Det känns som att det är både åt båda hållen. Precis som du säger, det finns ganska mycket vi kan ta med oss."
  },
  {
    "speaker": null,
    "timestamp": "00:34:37",
    "line": "Men det finns också ganska mycket lärdomar som kanske skulle kunna vara falska sanningar."
  },
  {
    "speaker": null,
    "timestamp": "00:34:46",
    "line": "Alltså folk som kanske testar att jobba hemifrån och känner att det här funkar inte alls."
  },
  {
    "speaker": null,
    "timestamp": "00:34:50",
    "line": "Men i själva verket kanske det skulle funka att jobba hemifrån om allt annat var normalt."
  },
  {
    "speaker": null,
    "timestamp": "00:34:54",
    "line": "Ja, och också företag som säger \"Vi kör absolut inte remote, du ska alltid vara på plats\"."
  },
  {
    "speaker": null,
    "timestamp": "00:34:59",
    "line": "Ja, men varför då? Det är ändå bevisat att det går att göra det."
  },
  {
    "speaker": null,
    "timestamp": "00:35:03",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:35:03",
    "line": "Så ja, mycket..."
  },
  {
    "speaker": null,
    "timestamp": "00:35:06",
    "line": "Vi får se, liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:35:08",
    "line": "Ja, det blir oerhört spännande. Man kanske ska återkomma till det här om ett år i bodden och se vart vi..."
  },
  {
    "speaker": null,
    "timestamp": "00:35:13",
    "line": "Om vi faktiskt har nånting som står kvar."
  },
  {
    "speaker": null,
    "timestamp": "00:35:15",
    "line": "Ja, om ett år också."
  },
  {
    "speaker": null,
    "timestamp": "00:35:17",
    "line": "Ja, typ."
  },
  {
    "speaker": null,
    "timestamp": "00:35:18",
    "line": "Jag tänker att det kanske är dags att runda av där."
  },
  {
    "speaker": null,
    "timestamp": "00:35:22",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:35:22",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:35:23",
    "line": "- Jävla trött. - Det är ändå förmiddag. Jag är sällan uppe så här tidigt på en helgdag."
  },
  {
    "speaker": null,
    "timestamp": "00:35:31",
    "line": "- Det är faktiskt väldigt, väldigt sant. - Eller uppe, men igång liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:35:34",
    "line": "- Ja, igång. Du har ju ändå fraktat dig hit. - Ja, nu är friklockan mycket mer än en förmiddag."
  },
  {
    "speaker": null,
    "timestamp": "00:35:41",
    "line": "- Jaja, det är sådär. Superkul att folk lyssnar på oss. Vill man hitta oss så finns vi på asdf.pizza."
  },
  {
    "speaker": null,
    "timestamp": "00:35:51",
    "line": "Jag finns på Twitter under @Avnton med ett dubbel v efter A1."
  },
  {
    "speaker": null,
    "timestamp": "00:35:55",
    "line": "- Ja, jag finns på Twitter som @tcomstadius tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:36:01",
    "line": "- Det stämmer. - Okej, vad bra."
  },
  {
    "speaker": null,
    "timestamp": "00:36:03",
    "line": "Jag är orolig om det är ett punkt emellan eller inte."
  },
  {
    "speaker": null,
    "timestamp": "00:36:05",
    "line": "- Nej, jag tror inte det."
  },
  {
    "speaker": null,
    "timestamp": "00:36:07",
    "line": "Så att vill man nå oss något så kan man nå oss där, jag tror det är enklast."
  },
  {
    "speaker": null,
    "timestamp": "00:36:11",
    "line": "Så hörs vi nästa gång. - Det gör vi. Hej då!"
  },
  {
    "speaker": null,
    "timestamp": "00:36:15",
    "line": "- Bye bye!"
  },
  {
    "speaker": null,
    "timestamp": "00:36:17",
    "line": "[Outromusik]"
  }
]