[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Varför blir utvecklare så nere när de covidvaccinerar sig?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:05",
    "line": "Jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:00:07",
    "line": "För det är en distribuerad dos."
  },
  {
    "speaker": null,
    "timestamp": "00:00:10",
    "line": "Du förvarnade innan för att det skulle vara låg nivå."
  },
  {
    "speaker": null,
    "timestamp": "00:00:17",
    "line": "Det var inte så lågt som jag kanske förväntade mig, men det var inte så högt heller."
  },
  {
    "speaker": null,
    "timestamp": "00:00:25",
    "line": "- Nej, jag tycker att den här håller en sanning i distribuerad dos, dyrdosattack, sidogår ner."
  },
  {
    "speaker": null,
    "timestamp": "00:00:37",
    "line": "- Den är ändå relevant i dessa tider."
  },
  {
    "speaker": null,
    "timestamp": "00:00:43",
    "line": "- I alla fall."
  },
  {
    "speaker": null,
    "timestamp": "00:00:45",
    "line": "- Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:00:47",
    "line": "- Välkomna till ett nytt avsnitt av ASTF."
  },
  {
    "speaker": null,
    "timestamp": "00:00:49",
    "line": "Jag har suttit i planeringsdag hela dagen. Så jag är lite mosig i skallen lagom sedan vi spelade in det här."
  },
  {
    "speaker": null,
    "timestamp": "00:00:59",
    "line": "Men det är kanske inte så annorlunda från vanligt."
  },
  {
    "speaker": null,
    "timestamp": "00:01:02",
    "line": "Men idag tänkte vi i alla fall snacka lite om det här med kontor i allmänhet."
  },
  {
    "speaker": null,
    "timestamp": "00:01:09",
    "line": "men kanske mer specifikt det här med öppna kontorslandskap och lite kring det."
  },
  {
    "speaker": null,
    "timestamp": "00:01:14",
    "line": "Ja, för faktiskt så nu när vi spelar in lite i Farväg så meddelade de precis att restriktionerna ska släppas den 29 september"
  },
  {
    "speaker": null,
    "timestamp": "00:01:28",
    "line": "på att vi inte längre rekommenderas att jobba hemifrån."
  },
  {
    "speaker": null,
    "timestamp": "00:01:33",
    "line": "Och det känns ändå ganska intressant, i brist på bättre ord."
  },
  {
    "speaker": null,
    "timestamp": "00:01:40",
    "line": "Ja, exakt. Jag tror också att det kommer leda till någon typ av förändring."
  },
  {
    "speaker": null,
    "timestamp": "00:01:46",
    "line": "Jag tror att det kommer bli mycket mer accepterat att sitta på kontoret."
  },
  {
    "speaker": null,
    "timestamp": "00:01:50",
    "line": "Men också att det kommer säkert finnas några företag som säger"
  },
  {
    "speaker": null,
    "timestamp": "00:01:56",
    "line": "\"Vi ska alla tillbaka till kontoret\"."
  },
  {
    "speaker": null,
    "timestamp": "00:01:58",
    "line": "Men jag tror också att de företagen kommer få en enorm intern kritikstorm mot sig från sina anställda."
  },
  {
    "speaker": null,
    "timestamp": "00:02:06",
    "line": "Ja, det beror väl på. Jag har för mig, och nu har han tänkt mig svängarna, så jag vet inte om det har ändrats."
  },
  {
    "speaker": null,
    "timestamp": "00:02:15",
    "line": "Men var det inte typ Mentimeter som gick ut och sa att efter pandemin så tänker de köra en Office First Policy?"
  },
  {
    "speaker": null,
    "timestamp": "00:02:20",
    "line": "Jo, absolut. Och jag tror ju att det gjorde dem. Och de fick ganska mycket cred för det."
  },
  {
    "speaker": null,
    "timestamp": "00:02:28",
    "line": "Att vi går ut och vågar säga att vi vill ha folk på kontoret och bla bla."
  },
  {
    "speaker": null,
    "timestamp": "00:02:32",
    "line": "Men jag tror ändå att majoriteten av bolag kommer att vara liksom så här."
  },
  {
    "speaker": null,
    "timestamp": "00:02:40",
    "line": "De anställda kommer inte vilja vara på kontoret 100%."
  },
  {
    "speaker": null,
    "timestamp": "00:02:43",
    "line": "Och jag tror inte att Mentimeter slapp undan någon kritik internt heller."
  },
  {
    "speaker": null,
    "timestamp": "00:02:48",
    "line": "Jag garanterar att det fanns folk på Mentimeter som hellre skulle ha någon typ av hybridlösning eller vilja jobba hemma 100 procent."
  },
  {
    "speaker": null,
    "timestamp": "00:02:54",
    "line": "Ja, det kanske är så."
  },
  {
    "speaker": null,
    "timestamp": "00:02:57",
    "line": "Det är lite spännande då, för jag har sett en hel del undersökningar kring"
  },
  {
    "speaker": null,
    "timestamp": "00:03:02",
    "line": "där de har frågat ingenjörer då, och det är mer än bara IT, liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:03:07",
    "line": "Över hur folk vill jobba, och det är ju en majoritet som vill ha hybrid."
  },
  {
    "speaker": null,
    "timestamp": "00:03:13",
    "line": "Det tycker jag med att se i alla undersökningar som poppar upp."
  },
  {
    "speaker": null,
    "timestamp": "00:03:16",
    "line": "Men sen är det svårt att se hur kommer det bli när det faktiskt blir en återgång."
  },
  {
    "speaker": null,
    "timestamp": "00:03:22",
    "line": "Hur fort hamnar man i samma hjulspår som förut?"
  },
  {
    "speaker": null,
    "timestamp": "00:03:27",
    "line": "Jag tycker det är skitsvårt att spekulera."
  },
  {
    "speaker": null,
    "timestamp": "00:03:31",
    "line": "Men jag är också inne på, som du nämner, att jag tror att hybridlösningen kommer att vara go to för många bolag."
  },
  {
    "speaker": null,
    "timestamp": "00:03:37",
    "line": "Men sen tror jag också att, till exempel de entymeter som vi pratade om, att det kommer bli en faktor som spelar in när man byter jobb."
  },
  {
    "speaker": null,
    "timestamp": "00:03:47",
    "line": "På ett mycket större sätt nu. Förut har det varit en liten klick människor som har varit remote first, eller remote 100% och liksom kört."
  },
  {
    "speaker": null,
    "timestamp": "00:03:55",
    "line": "\"Nej men jag har bara bytit jobb till bolag eller arbetsgivare som tillåter mig att jobba remote.\""
  },
  {
    "speaker": null,
    "timestamp": "00:04:02",
    "line": "Nu kommer nog klicken människor eller andelen människor som tar det här i beaktande när de byter jobb."
  },
  {
    "speaker": null,
    "timestamp": "00:04:09",
    "line": "\"Okej, vad har ni för kontorspolitis? Är det 100% på kontoret som Mentimeter kör eller är det 100% remote eller är det någon blandning?\""
  },
  {
    "speaker": null,
    "timestamp": "00:04:18",
    "line": "\"Och hur funkar kontoret för er de gångerna? Är det så att det är ett hängkontor eller är det så att alla ska vara in där någon dag i veckan?\""
  },
  {
    "speaker": null,
    "timestamp": "00:04:27",
    "line": "vilken modell kör man. Jag tror att det kommer spela en mycket större roll innan man byter jobb framöver också."
  },
  {
    "speaker": null,
    "timestamp": "00:04:32",
    "line": "Ja, jag tror du har rätt i det. Eller min känsla är den samma."
  },
  {
    "speaker": null,
    "timestamp": "00:04:39",
    "line": "Men jag är ju lite skeptiska till hela hybridgrejen."
  },
  {
    "speaker": null,
    "timestamp": "00:04:44",
    "line": "Det beror ju lite på hur välordna den är."
  },
  {
    "speaker": null,
    "timestamp": "00:04:47",
    "line": "Men min skräck blir ju lite den här."
  },
  {
    "speaker": null,
    "timestamp": "00:04:51",
    "line": "Vi pratar mycket om flexibilitet och hur det har varit."
  },
  {
    "speaker": null,
    "timestamp": "00:04:55",
    "line": "Det har vi absolut haft, men det är mycket för att alla har suttit remote."
  },
  {
    "speaker": null,
    "timestamp": "00:05:00",
    "line": "Det är jätteflexibelt att alla sitter vid en egen dator och kan kasta sig in i videosamtal när som helst och hur som helst."
  },
  {
    "speaker": null,
    "timestamp": "00:05:07",
    "line": "Det tror inte jag kommer kunna fungera på samma sätt om vi har hybrid."
  },
  {
    "speaker": null,
    "timestamp": "00:05:12",
    "line": "För om hälften eller två är på ett kontor medan resten är redo att hoppa in,"
  },
  {
    "speaker": null,
    "timestamp": "00:05:17",
    "line": "Då försvinner den flexibiliteten, tänker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:05:21",
    "line": "För det värsta jag vet, det är en av många saker jag tycker mindre om i öppna kontorslandskap."
  },
  {
    "speaker": null,
    "timestamp": "00:05:28",
    "line": "Det är ju personer som tar videosamtal i kontorslandskapet utan lurar."
  },
  {
    "speaker": null,
    "timestamp": "00:05:34",
    "line": "Ja, verkligen. Jag tror du är inne på något extremt viktigt."
  },
  {
    "speaker": null,
    "timestamp": "00:05:38",
    "line": "Jag tror att kontoren kommer att behöva förändras om man ska köra någon hybridlösning."
  },
  {
    "speaker": null,
    "timestamp": "00:05:43",
    "line": "Jag tror att det optimala för mig hade varit att man har bestämda dagar."
  },
  {
    "speaker": null,
    "timestamp": "00:05:49",
    "line": "Att vi kör två dagar på kontoret i veckan och då är alla i mitt team."
  },
  {
    "speaker": null,
    "timestamp": "00:05:54",
    "line": "Alltså alla på bolaget behöver vi inte vara i, men alla i mitt team kanske är på plats de här två dagarna."
  },
  {
    "speaker": null,
    "timestamp": "00:05:58",
    "line": "För att min erfarenhet är att det är extremt svårt att få det att fungera bra när man har möten där vissa sitter i grupp."
  },
  {
    "speaker": null,
    "timestamp": "00:06:06",
    "line": "Och säga att det är tre personer av ett team på sex som sitter på plats och sen har det tre stycken som sitter hemma och ska vara med på video."
  },
  {
    "speaker": null,
    "timestamp": "00:06:15",
    "line": "Min erfarenhet är att det är svårt att få det att funka bra."
  },
  {
    "speaker": null,
    "timestamp": "00:06:18",
    "line": "Ja, samma. Man kan ju prata om att man kan boka mötesrum och så."
  },
  {
    "speaker": null,
    "timestamp": "00:06:24",
    "line": "Jag har nog inte varit på ett enda ställe där det inte är kaos och för få mötesrum på ett företag."
  },
  {
    "speaker": null,
    "timestamp": "00:06:34",
    "line": "Det är alltid så här, det finns inga."
  },
  {
    "speaker": null,
    "timestamp": "00:06:36",
    "line": "Två som du säger, jag tycker verkligen de här systemen för att ha telefonkonferens och sådana saker, jag tycker inte det funkar väl."
  },
  {
    "speaker": null,
    "timestamp": "00:06:44",
    "line": "Det är mycket eko eller det är någon som laggar efter."
  },
  {
    "speaker": null,
    "timestamp": "00:06:48",
    "line": "Det krävs otroligt mycket energi tycker jag för att hålla igång ett sådant möte."
  },
  {
    "speaker": null,
    "timestamp": "00:06:54",
    "line": "Ja, det håller jag med om. Jag tror att man skulle behöva gå mot någon typ av teamkontor."
  },
  {
    "speaker": null,
    "timestamp": "00:07:01",
    "line": "Där varje team har en uppsättning med telekonferens- eller videomötesutrustning som faktiskt funkar bra."
  },
  {
    "speaker": null,
    "timestamp": "00:07:09",
    "line": "Där man kan på ett väldigt enkelt sätt se till att vi kan köra ett mötesom team oavsett hur många som är på plats och hur många som är på distans."
  },
  {
    "speaker": null,
    "timestamp": "00:07:18",
    "line": "Jag vet inte hur den optimala lösningen ser ut."
  },
  {
    "speaker": null,
    "timestamp": "00:07:20",
    "line": "För som du säger, det är sällan man inte kämpar med att \"ja, vi måste ha ett mötesrum\"."
  },
  {
    "speaker": null,
    "timestamp": "00:07:26",
    "line": "\"Ja, det här mötesrummet var lite för litet. Fan, vi får inte platsa det ihop.\""
  },
  {
    "speaker": null,
    "timestamp": "00:07:30",
    "line": "Jag tror att den problematiken kommer att bli ännu värre när man inser att"
  },
  {
    "speaker": null,
    "timestamp": "00:07:36",
    "line": "\"ja, jag måste också tillhandahålla och se att de som är remote kan vara med på ett bra sätt\"."
  },
  {
    "speaker": null,
    "timestamp": "00:07:42",
    "line": "Men det är också spännande just den för att du säger att man kanske måste bygga om eller göra om lite den grejerna."
  },
  {
    "speaker": null,
    "timestamp": "00:07:50",
    "line": "Vi har ju inte riktigt några svar på hur det här funkar bra än. Någon kanske har det, jag har ingen aning faktiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:07:56",
    "line": "Och just att göra om mycket det kostar ju pengar och resurser så folk kanske inte är så himla sugna på det."
  },
  {
    "speaker": null,
    "timestamp": "00:08:03",
    "line": "Jag tror här kommer vi behöva testa oss fram."
  },
  {
    "speaker": null,
    "timestamp": "00:08:08",
    "line": "Så tror jag verkligen det är. Jag tror kanske att det kommer komma någon hype i stil med öppna kontorslandskap eller aktivitetsbaserade platser."
  },
  {
    "speaker": null,
    "timestamp": "00:08:19",
    "line": "Eller vilka hyper det nu har funnits. Men som kommer vara att nu är det någon tyckare som har insett att vi tycker att vi gör det på bästa sättet här."
  },
  {
    "speaker": null,
    "timestamp": "00:08:28",
    "line": "Och sen så sprider det sig lite grann bland lite olika kända bolag och helt plötsligt ska alla kopiera det."
  },
  {
    "speaker": null,
    "timestamp": "00:08:33",
    "line": "Det finns definitivt en risk, vill jag säga, och inte chans med att det händer."
  },
  {
    "speaker": null,
    "timestamp": "00:08:39",
    "line": "För jag tror att det måste vara ganska ändå personaliserat per bolag, hur det kommer funka."
  },
  {
    "speaker": null,
    "timestamp": "00:08:46",
    "line": "Ja, alltså vilken skräck jag fick upp där."
  },
  {
    "speaker": null,
    "timestamp": "00:08:50",
    "line": "Dels att jag kanske inte är så sugen på att åka in på ett kontor och sen så gör man det några dagar i veckan."
  },
  {
    "speaker": null,
    "timestamp": "00:08:55",
    "line": "Och så måste man kämpa för att hitta en plats."
  },
  {
    "speaker": null,
    "timestamp": "00:08:58",
    "line": "Och så är jag inte morgonpig så kommer jag in sent och så får jag ingen extern skärm."
  },
  {
    "speaker": null,
    "timestamp": "00:09:03",
    "line": "Ångesten sätter redan igång."
  },
  {
    "speaker": null,
    "timestamp": "00:09:05",
    "line": "- Men nu när du har skaffat hund så tänker jag att du måste bli morgonpigg."
  },
  {
    "speaker": null,
    "timestamp": "00:09:09",
    "line": "- Nej, jag ska lära hunden att vara morgontrött. Jag förstår inte."
  },
  {
    "speaker": null,
    "timestamp": "00:09:15",
    "line": "- Ja, det är faktiskt en lösning på problemet."
  },
  {
    "speaker": null,
    "timestamp": "00:09:17",
    "line": "Nej, men jag tror precis som du säger att det kommer att vara en övergångsperiod som kommer att vara lite smärtsam, tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:09:28",
    "line": "Jag undrar hur många som tar sig över den pucken eller om folk ger upp."
  },
  {
    "speaker": null,
    "timestamp": "00:09:34",
    "line": "Ja, och då tror jag att det kommer bli att man söker sig till bolag som man själv vill jobba."
  },
  {
    "speaker": null,
    "timestamp": "00:09:46",
    "line": "Ja, det är sant. Det blir ju helt en prioriteringsfråga i livet."
  },
  {
    "speaker": null,
    "timestamp": "00:09:53",
    "line": "Vad man värdesätter, det var bara en slut på meningen."
  },
  {
    "speaker": null,
    "timestamp": "00:10:03",
    "line": "Utan värde."
  },
  {
    "speaker": null,
    "timestamp": "00:10:05",
    "line": "Jag tror verkligen att det kommer bli så."
  },
  {
    "speaker": null,
    "timestamp": "00:10:07",
    "line": "För idag när man har bytt jobb, jag generaliserar såklart litegrann och skiter i alla som har varit remote first."
  },
  {
    "speaker": null,
    "timestamp": "00:10:15",
    "line": "Men idag när man har bytt jobb så har ju inte det här varit en stor grej."
  },
  {
    "speaker": null,
    "timestamp": "00:10:23",
    "line": "För att alla bolag har haft ett kontor, alla bolag har haft ett kontor där man förväntar sig att infinna sig på."
  },
  {
    "speaker": null,
    "timestamp": "00:10:29",
    "line": "Sen har det ofta varit, i alla fall i vår bransch, så är det ofta flexibelt med att \"Ja men förresten jag behöver jobba hemma idag för jag ska fixa den här grejen\" eller sådär."
  },
  {
    "speaker": null,
    "timestamp": "00:10:36",
    "line": "Men det har inte alls varit på samma sätt att man säger \"Jag jobbar hemma tre dagar den här veckan, kommer in på torsdag och fredag\"."
  },
  {
    "speaker": null,
    "timestamp": "00:10:44",
    "line": "Utan det är mer kontor first eller kontor only."
  },
  {
    "speaker": null,
    "timestamp": "00:10:50",
    "line": "Ja, om jag tittar tillbaka på vad jag har valt förut, då har jag verkligen börjat lägga fokus på vart kontoret är i förhållande till vart jag bor."
  },
  {
    "speaker": null,
    "timestamp": "00:10:59",
    "line": "För att jag hade en period i livet då jag hade en timme, en timme och en kvart enkel resväg."
  },
  {
    "speaker": null,
    "timestamp": "00:11:07",
    "line": "Så det åts upp två och en halv timme varje dag av restid när jag bodde i samma stad."
  },
  {
    "speaker": null,
    "timestamp": "00:11:12",
    "line": "Jag var helt förstörd. Det var mitt fokus att inte hamna i den situationen igen."
  },
  {
    "speaker": null,
    "timestamp": "00:11:18",
    "line": "- Ja, exakt. Jag har kollegor i mitt team som har en halvtimme enkel resa in till kontoret."
  },
  {
    "speaker": null,
    "timestamp": "00:11:26",
    "line": "De tycker att det har varit skitnice att jobba hemifrån. För så mycket tid de har vunnit på det."
  },
  {
    "speaker": null,
    "timestamp": "00:11:32",
    "line": "- Ja, och när man pratar med föräldrar, bara den här hämta-lämna-tiden som har sparat sig in på."
  },
  {
    "speaker": null,
    "timestamp": "00:11:40",
    "line": "Och om någonting händer så är de tillräckligt nära."
  },
  {
    "speaker": null,
    "timestamp": "00:11:44",
    "line": "Och jag menar, i vårt jäktiga samhälle så är väl det här med att hitta tid, är väl typ den bästa valutan som finns nu."
  },
  {
    "speaker": null,
    "timestamp": "00:11:55",
    "line": "Ja, det gör det. Så jag tror att det kommer finnas ett ganska stort motstånd till det här med att gå tillbaka till kontor 100%."
  },
  {
    "speaker": null,
    "timestamp": "00:12:06",
    "line": "Jag tror definitivt att bolag kommer säga \"Vi ska köra från kontoret 100%\""
  },
  {
    "speaker": null,
    "timestamp": "00:12:12",
    "line": "Och då kan man ju få finnas i. Jag tror inte att någon kommer säga det liksom"
  },
  {
    "speaker": null,
    "timestamp": "00:12:18",
    "line": "\"Nu släpper restriktionerna om två veckor\""
  },
  {
    "speaker": null,
    "timestamp": "00:12:21",
    "line": "Jag tror inte att inget bolag kommer säga \"Okej, om två veckor, alla ska på kontoret 100%\""
  },
  {
    "speaker": null,
    "timestamp": "00:12:26",
    "line": "Jag har ytterst svårt att se det, för jag tror att de bolagen som"
  },
  {
    "speaker": null,
    "timestamp": "00:12:31",
    "line": "skulle göra det har nog redan smygit tillbaka folk på kontoret"
  },
  {
    "speaker": null,
    "timestamp": "00:12:35",
    "line": "Sen har det varit bolag som har skickat ut lite \"feelers\" som du beskrev i början där att de har fått intern kritik och ändå känt att de behöver lyssna på sina anställda för att det är dem det berör."
  },
  {
    "speaker": null,
    "timestamp": "00:12:56",
    "line": "De behöver ha sina anställda."
  },
  {
    "speaker": null,
    "timestamp": "00:12:58",
    "line": "Ja, och jag tycker också att för många borde det inte ligga på en bolagsnivå, utan det borde ligga på en teamnivå och bestämma hur man ska arbeta."
  },
  {
    "speaker": null,
    "timestamp": "00:13:06",
    "line": "Om du vill ha ett team som sitter 100% remote, om det funkar bra så borde det inte vara några konstigheter."
  },
  {
    "speaker": null,
    "timestamp": "00:13:12",
    "line": "Sen är det självklart att man alltid samarbetar med andra inom organisationen, men jag är väldigt mycket för autonoma team som bestämmer själva hur de vill att det ska funka."
  },
  {
    "speaker": null,
    "timestamp": "00:13:23",
    "line": "Ja, däremot så kan jag tänka att det blir svårare för roller som verkligen har mycket kontaktytan med alla olika delar av organisationen."
  },
  {
    "speaker": null,
    "timestamp": "00:13:33",
    "line": "Och då är vi väl igen på att vi måste ha en bra lösning för att kunna ha möten allihop."
  },
  {
    "speaker": null,
    "timestamp": "00:13:39",
    "line": "Ja, verkligen. Jag tror att det kommer bli extremt viktigt."
  },
  {
    "speaker": null,
    "timestamp": "00:13:43",
    "line": "Men jag tycker också att det är intressant att se hur blir det nya post-pandemikontoret."
  },
  {
    "speaker": null,
    "timestamp": "00:13:51",
    "line": "Jag har hört några stycken som har gjort om sina kontor så att de är mer aktivitetsanpassade."
  },
  {
    "speaker": null,
    "timestamp": "00:14:01",
    "line": "De har skurit ner på antalet sittplatser och istället använt ytan för att ha ett pingisbord för att ta ett dåligt exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:14:09",
    "line": "Men någonting i den stilen. Att ha mer sådana ytor där man kan umgås snarare än ytor man bara får jobba på."
  },
  {
    "speaker": null,
    "timestamp": "00:14:19",
    "line": "Samtidigt så vet jag också att man skulle bli irriterad om man helt plötsligt kom dit en dag och så var det fullt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:25",
    "line": "Varför har ni inte plats och plats åt mig här? Det måste ni ha."
  },
  {
    "speaker": null,
    "timestamp": "00:14:29",
    "line": "Då hade man ju blivit irriterad."
  },
  {
    "speaker": null,
    "timestamp": "00:14:31",
    "line": "Sitta på pengisbordet."
  },
  {
    "speaker": null,
    "timestamp": "00:14:33",
    "line": "Ja, exakt. Och då blir det ju sådana fula lösningar istället."
  },
  {
    "speaker": null,
    "timestamp": "00:14:36",
    "line": "Det blir ju kast i slutändan."
  },
  {
    "speaker": null,
    "timestamp": "00:14:40",
    "line": "Jag har svårt att föreställa mig hur nya kontoret kommer att se ut."
  },
  {
    "speaker": null,
    "timestamp": "00:14:45",
    "line": "Ja, jag med. Men jag är väldigt så här, när jag tänker tillbaka på öppna kontorslandskap så är det så här, jag vill nästan gråta när jag tänker på det."
  },
  {
    "speaker": null,
    "timestamp": "00:15:00",
    "line": "För det mår så dåligt i öppna kontorslandskap."
  },
  {
    "speaker": null,
    "timestamp": "00:15:06",
    "line": "Och då är jag själv en fiende för andra människor i öppna kontorslandskap."
  },
  {
    "speaker": null,
    "timestamp": "00:15:12",
    "line": "Jag är liksom inte bra på det."
  },
  {
    "speaker": null,
    "timestamp": "00:15:14",
    "line": "Ja, där är vi ju ganska olika."
  },
  {
    "speaker": null,
    "timestamp": "00:15:17",
    "line": "Jag tycker att öppna kontorslandskap är också en ganska bred term."
  },
  {
    "speaker": null,
    "timestamp": "00:15:24",
    "line": "Det kan ju både vara bra och dåliga öppna kontorslandskap tycker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:15:27",
    "line": "Men de jag har suttit med tycker jag har varit ganska nice."
  },
  {
    "speaker": null,
    "timestamp": "00:15:31",
    "line": "Man sitter nära sitt team, man kan höra över om folk pratar litegrann."
  },
  {
    "speaker": null,
    "timestamp": "00:15:35",
    "line": "Så kan man ändå lägga ett öra till och säga \"Det där de pratar om har jag precis suttit med\""
  },
  {
    "speaker": null,
    "timestamp": "00:15:41",
    "line": "\"utan att de visste om det, så då kan jag hoppa in och lägga mig där.\""
  },
  {
    "speaker": null,
    "timestamp": "00:15:43",
    "line": "Det är så mycket sådana grejer som man missar, tycker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:15:47",
    "line": "Om man skulle sitta på sitt eget kontor, till exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:15:52",
    "line": "Men det kanske också är lite därför jag inneför att öppna kontorslandskap kan ju vara bra."
  },
  {
    "speaker": null,
    "timestamp": "00:15:59",
    "line": "Men jag kanske hellre gillar att man har ett litet kontorslandskap med sitt team."
  },
  {
    "speaker": null,
    "timestamp": "00:16:04",
    "line": "Istället för att hela bolaget sitter på en stor äng med datorer."
  },
  {
    "speaker": null,
    "timestamp": "00:16:09",
    "line": "Ja, grejen är att jag gillar de fördelarna med att det är lätt att prata med personer."
  },
  {
    "speaker": null,
    "timestamp": "00:16:16",
    "line": "Men ett problem jag har är att jag har ju noll i attention spans och pratas det någonstans, då blir jag nyfiken och då vill jag veta vad det är och då tappar jag mitt fokus."
  },
  {
    "speaker": null,
    "timestamp": "00:16:26",
    "line": "Sen är det mycket den här att om jag bara ska sätta mig ner och grotta och dra på mig mina hörlurar, det går ju att lösa."
  },
  {
    "speaker": null,
    "timestamp": "00:16:34",
    "line": "om jag ser saker och kanske får attention span series igen. Men just den här om man ska ha diskussioner fokuserat med andra"
  },
  {
    "speaker": null,
    "timestamp": "00:16:41",
    "line": "personer eller parprogrammera eller vad det är så är jag väldigt ljudkänslig. Och det har ju, ja men det är typ diagnostiserat"
  },
  {
    "speaker": null,
    "timestamp": "00:16:50",
    "line": "liksom ljudkänsligt så att jag har ju ganska många sådana saker som jag inte riktigt klarar av. Det är väl en ljudkänslighet"
  },
  {
    "speaker": null,
    "timestamp": "00:16:56",
    "line": "kombinerat med vad heter det här misofini typ. Så att jag blir liksom arg av vissa ljud."
  },
  {
    "speaker": null,
    "timestamp": "00:17:01",
    "line": "Så det är också ganska jobbigt. Jag tror det finns mina hemskaste ljud, det är prassel."
  },
  {
    "speaker": null,
    "timestamp": "00:17:09",
    "line": "Så när det är folk som ska äta, som skalar liksom godis, alltså chokladbitar och så här som prasslar."
  },
  {
    "speaker": null,
    "timestamp": "00:17:16",
    "line": "Mekaniska tangentbord. Det var också, man sitter och prasslar nu."
  },
  {
    "speaker": null,
    "timestamp": "00:17:22",
    "line": "Men det var också någonting, på ett kontorslandskap, då hade de byggt i ordning en egen sådan här arkadmaskin."
  },
  {
    "speaker": null,
    "timestamp": "00:17:30",
    "line": "Och då hade de avsiktligt valt mekaniska knappar istället för plastknappar, för det kändes mera nice."
  },
  {
    "speaker": null,
    "timestamp": "00:17:36",
    "line": "Och sen så stod den bredvid mig."
  },
  {
    "speaker": null,
    "timestamp": "00:17:38",
    "line": "Och folk gick dit för att spela, för att liksom såhär nollställa sig och komma tillbaka till fokus."
  },
  {
    "speaker": null,
    "timestamp": "00:17:45",
    "line": "Så det stod hela dagarna så stod de där och spelade med mekaniska knappar."
  },
  {
    "speaker": null,
    "timestamp": "00:17:49",
    "line": "Sådana saker."
  },
  {
    "speaker": null,
    "timestamp": "00:17:51",
    "line": "Jag kan förstå att öppna kontorslagskap då inte är det optimala."
  },
  {
    "speaker": null,
    "timestamp": "00:17:59",
    "line": "Jag har också ett av mina, det som jag upplevde precis innan vi gick, det var att någon satt på en sån här pilatesboll."
  },
  {
    "speaker": null,
    "timestamp": "00:18:07",
    "line": "Det är ju jättebra ergonomiskt och sådana grejer. Det var bara att personen när så fort den rörde sig så gnisslade den."
  },
  {
    "speaker": null,
    "timestamp": "00:18:13",
    "line": "Så fort man bytte ställning var det så här..."
  },
  {
    "speaker": null,
    "timestamp": "00:18:17",
    "line": "På gummiljud. Vilket var fruktansvärt."
  },
  {
    "speaker": null,
    "timestamp": "00:18:21",
    "line": "- Det är tur vi inte sitter och parprogrammerar så mycket remote."
  },
  {
    "speaker": null,
    "timestamp": "00:18:24",
    "line": "Du och jag, i och med att jag har en kontorstol som knakar."
  },
  {
    "speaker": null,
    "timestamp": "00:18:28",
    "line": "- Ja, precis. Det gör ju min med. Jag är ju bara en stor hicklare."
  },
  {
    "speaker": null,
    "timestamp": "00:18:32",
    "line": "Det är jag ju helt medveten om. Jag borde inte vara hitta på ett kontorstol."
  },
  {
    "speaker": null,
    "timestamp": "00:18:36",
    "line": "- Men du stör dig bara på andras ljud."
  },
  {
    "speaker": null,
    "timestamp": "00:18:38",
    "line": "- Nej, jag stör mig på mina egna ljud också."
  },
  {
    "speaker": null,
    "timestamp": "00:18:40",
    "line": "Jag får typ ångest när jag ska äta något som prasslar."
  },
  {
    "speaker": null,
    "timestamp": "00:18:42",
    "line": "Också det här med att äta med hörlurar, det går ju inte."
  },
  {
    "speaker": null,
    "timestamp": "00:18:46",
    "line": "För jag vet inte hur mycket jag smaskar."
  },
  {
    "speaker": null,
    "timestamp": "00:18:48",
    "line": "- Ja, jag fattar."
  },
  {
    "speaker": null,
    "timestamp": "00:18:50",
    "line": "Det är spännande."
  },
  {
    "speaker": null,
    "timestamp": "00:18:52",
    "line": "Det påminner mig lite grann om att folk som har varit socialt isolerade nu"
  },
  {
    "speaker": null,
    "timestamp": "00:19:00",
    "line": "har också utvecklat... Jag kanske inte riktigt är den här tyfjöömda,"
  },
  {
    "speaker": null,
    "timestamp": "00:19:04",
    "line": "men jag har bekanta och läst om folk som känner att"
  },
  {
    "speaker": null,
    "timestamp": "00:19:08",
    "line": "Nu när restriktionerna släpper så känner de inte så här \"Woohoo, äntligen får jag hänga på kontoret\""
  },
  {
    "speaker": null,
    "timestamp": "00:19:14",
    "line": "Utan att det snarare är tvärtom."
  },
  {
    "speaker": null,
    "timestamp": "00:19:17",
    "line": "Att de bara \"Nej men jag har ju vant mig med det här, jag får liksom ångest av att träffa så mycket folk\""
  },
  {
    "speaker": null,
    "timestamp": "00:19:21",
    "line": "\"Eller behöva vara på kontor\" eller liksom alla sådana grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:19:24",
    "line": "Och jag läste någon artikel för ett tag sedan som försökte sätta namn på den här."
  },
  {
    "speaker": null,
    "timestamp": "00:19:29",
    "line": "Jag vet inte hur mycket det här namnet är vetenskapligt bevisat, men de kallar det för \"Cave Syndrome\" tydligen."
  },
  {
    "speaker": null,
    "timestamp": "00:19:34",
    "line": "Och då handlar det till och med om att man har varit i en grotta så pass länge att man har fått typ, inte social fobi, men lite lite någon typ av fobi mot att träffa människor"
  },
  {
    "speaker": null,
    "timestamp": "00:19:48",
    "line": "Och det tror jag liksom, det tror jag kommer bli spännande att se hur folk tar emot det här nu när restriktionerna faktiskt släpper och allting ska återgå till någon typ av ny normal"
  },
  {
    "speaker": null,
    "timestamp": "00:20:01",
    "line": "Jag identifierade mig jättemycket med det där."
  },
  {
    "speaker": null,
    "timestamp": "00:20:07",
    "line": "Jag förstår att det är jättemånga som firar."
  },
  {
    "speaker": null,
    "timestamp": "00:20:10",
    "line": "Alla har inte mått bra och det är såklart bra att vi inte befinner oss i en pandemi längre."
  },
  {
    "speaker": null,
    "timestamp": "00:20:16",
    "line": "Men när jag hörde att restriktionerna släppte blev jag typ ledsen."
  },
  {
    "speaker": null,
    "timestamp": "00:20:19",
    "line": "Jag blir så stressad och får ångest över att åka tunnelbana och trängsel igen."
  },
  {
    "speaker": null,
    "timestamp": "00:20:26",
    "line": "Bara en sån sak som att gå på konsert."
  },
  {
    "speaker": null,
    "timestamp": "00:20:28",
    "line": "Jag älskar egentligen gå på konsert men jag får typ ångest av att tänka på att stå i någon svettig armhåla igen."
  },
  {
    "speaker": null,
    "timestamp": "00:20:34",
    "line": "Det var så länge sedan."
  },
  {
    "speaker": null,
    "timestamp": "00:20:36",
    "line": "Jag såg samma artikel jag hade i bakgrunden och där står det att 48% av dem som hade fått corona-vaccinet,"
  },
  {
    "speaker": null,
    "timestamp": "00:20:45",
    "line": "eller 49% kände, eller de förväntade sig att de skulle vara obekväma att komma tillbaka till att träffas i verkligheten istället för remote."
  },
  {
    "speaker": null,
    "timestamp": "00:20:56",
    "line": "Och även 48%, alltså bara 1% mindre av de som är vaccinerade känner samma sak."
  },
  {
    "speaker": null,
    "timestamp": "00:21:02",
    "line": "Så även fast man har fått vaccinet så känner man sig obekväm med att träffa människor igen."
  },
  {
    "speaker": null,
    "timestamp": "00:21:06",
    "line": "- Ja, alltså det är ju skönt att träffa människor så men det har också varit väldigt skönt att inte behöva stå nära människor."
  },
  {
    "speaker": null,
    "timestamp": "00:21:16",
    "line": "Alltså att köra har varit mycket rimligare."
  },
  {
    "speaker": null,
    "timestamp": "00:21:18",
    "line": "- Ja men jag älskar ju typ att åka tunnelbanan eller åka tåg."
  },
  {
    "speaker": null,
    "timestamp": "00:21:22",
    "line": "Nu börjar vi lite mer igen, men innan var det underbart."
  },
  {
    "speaker": null,
    "timestamp": "00:21:28",
    "line": "Ja, bara att man slipper råka känna andra människors andedräkt i nacken när man står och köper saker."
  },
  {
    "speaker": null,
    "timestamp": "00:21:35",
    "line": "Eller att de trycker fram en med sin kropp. Jag vill inte ha kropp-mot-kropp-kontakt med okända människor."
  },
  {
    "speaker": null,
    "timestamp": "00:21:44",
    "line": "Nej, och det där undrar jag också lite grann, hur länge kommer det sitta i?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:48",
    "line": "Jag tänker typ när man åker en rullertrappa nu till exempel, då lämnar ju alla lite mer avstånd än vanligt på vägen upp."
  },
  {
    "speaker": null,
    "timestamp": "00:21:55",
    "line": "Och hur länge kommer det sitta i liksom bara att vi har vant oss med att man ska lämna lite mer avstånd?"
  },
  {
    "speaker": null,
    "timestamp": "00:22:01",
    "line": "Jag önskar ju att det sitter i för alltid för att det känns ju mer nice än att man ska stå upptryckta och ihop som sillar som du pratar om."
  },
  {
    "speaker": null,
    "timestamp": "00:22:07",
    "line": "Ja, samma. Och det här med att folk inte går till jobbet med snuva och vinterkrakssjuka och halskänningar och sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:22:16",
    "line": "Utan att är man sjuk så stannar man hemma. Det är väl också en sån här hybridgrej som kan möjliggöra det."
  },
  {
    "speaker": null,
    "timestamp": "00:22:22",
    "line": "Jobba hemifrån om du känner dig tillräckligt frisk för att jobba men inte tillräckligt frisk för att vara bland folk."
  },
  {
    "speaker": null,
    "timestamp": "00:22:30",
    "line": "- Ja, exakt. Och sen, jag vet inte, jag tycker ändå att det borde gå att lösa med de här tekniska lösningar som är bättre än vad vi har idag."
  },
  {
    "speaker": null,
    "timestamp": "00:22:39",
    "line": "Allt vi har idag är verkligen att man ringer upp och så sitter man där och tittar på varandra och man känner att det här inte är riktigt samma sak som det var förut."
  },
  {
    "speaker": null,
    "timestamp": "00:22:50",
    "line": "Vill man tillbaka som det var förut? Nej, det vill man inte."
  },
  {
    "speaker": null,
    "timestamp": "00:22:53",
    "line": "Det måste finnas någon ny typ av tjänst som kan göra det bra."
  },
  {
    "speaker": null,
    "timestamp": "00:22:57",
    "line": "Alltså att det funkar bra att både sitta tre personer i en grupp och prata,"
  },
  {
    "speaker": null,
    "timestamp": "00:23:04",
    "line": "och även några stycken remote och kunna känna att man ändå hänger ihop på ett bra sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:09",
    "line": "Jag vet inte, det borde finnas."
  },
  {
    "speaker": null,
    "timestamp": "00:23:11",
    "line": "– Ja, någon borde komma på det."
  },
  {
    "speaker": null,
    "timestamp": "00:23:15",
    "line": "Någon som är \"bright\"."
  },
  {
    "speaker": null,
    "timestamp": "00:23:19",
    "line": "Man behöver inte vara bright, man behöver bara vara övertygad om att det går att lösa och sen testa sig fram. Growth mindset."
  },
  {
    "speaker": null,
    "timestamp": "00:23:25",
    "line": "Vi ger bort den unicorn-bolags-idén gratis härifrån."
  },
  {
    "speaker": null,
    "timestamp": "00:23:32",
    "line": "Ja, vi är så unika. Ingen annan har tänkt på det där."
  },
  {
    "speaker": null,
    "timestamp": "00:23:35",
    "line": "Nej, nej, nej. Gud, de har inte tänkt på att man ska ha någon ny lösning."
  },
  {
    "speaker": null,
    "timestamp": "00:23:39",
    "line": "Nej. Men hur känner du då? Är du taggad på att gå tillbaks hundra?"
  },
  {
    "speaker": null,
    "timestamp": "00:23:45",
    "line": "Nej, absolut inte 100%, men jag är ändå taggad på att hänga på kontor."
  },
  {
    "speaker": null,
    "timestamp": "00:23:49",
    "line": "Jag tror kanske att den exalteringen är lite missriktad."
  },
  {
    "speaker": null,
    "timestamp": "00:23:59",
    "line": "För jag är ju taggad på att hänga på kontor med kollegor."
  },
  {
    "speaker": null,
    "timestamp": "00:24:03",
    "line": "Alltså att man ska sitta i sitt team och jobba tillsammans och allt sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:24:07",
    "line": "Men som det kommer bli så kommer det ju..."
  },
  {
    "speaker": null,
    "timestamp": "00:24:10",
    "line": "Om det inte blir det som jag vill, att alla i teamet är på kontoret samtidigt, så kommer det inte bli det."
  },
  {
    "speaker": null,
    "timestamp": "00:24:15",
    "line": "Utan det kanske är att man har gått in och träffat två i teamet."
  },
  {
    "speaker": null,
    "timestamp": "00:24:18",
    "line": "Och kanske några andra ur några av de andra teamen som sitter där. Eller att de inte är på plats."
  },
  {
    "speaker": null,
    "timestamp": "00:24:22",
    "line": "Så det kommer inte bli som innan."
  },
  {
    "speaker": null,
    "timestamp": "00:24:24",
    "line": "Men jag är ändå taggad på att kunna hänga på kontor, att man kan gå ut och käka lunch tillsammans."
  },
  {
    "speaker": null,
    "timestamp": "00:24:29",
    "line": "Eller ta en fika tillsammans på dagen, bara snacka lite skit."
  },
  {
    "speaker": null,
    "timestamp": "00:24:32",
    "line": "Typ gå och ta en spontan av efter jobbet och såna här saker."
  },
  {
    "speaker": null,
    "timestamp": "00:24:35",
    "line": "Jag tror att de sociala bitarna runt om jobbet och kaffe, maskinsnacket och allting där."
  },
  {
    "speaker": null,
    "timestamp": "00:24:43",
    "line": "Det har jag saknat väldigt mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:24:45",
    "line": "Jag håller med. Just om man var team på kontoret hade det varit nice."
  },
  {
    "speaker": null,
    "timestamp": "00:24:52",
    "line": "Jag har också cyniken i mig."
  },
  {
    "speaker": null,
    "timestamp": "00:24:54",
    "line": "\"Det här teamet, vi har bestämt att vi ska vara här de här dagarna.\""
  },
  {
    "speaker": null,
    "timestamp": "00:24:57",
    "line": "\"Jag behövde vabba och jag blev sjuk. Jag behöver uträtta ett ärende så jag jobbar hemifrån.\""
  },
  {
    "speaker": null,
    "timestamp": "00:25:02",
    "line": "så blir det liksom att vanan försvinner och folk dyker inte upp och så sakt det ligas"
  },
  {
    "speaker": null,
    "timestamp": "00:25:08",
    "line": "och så rinner det ut i sanden på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:10",
    "line": "Ja, det finns ju definitivt en risk."
  },
  {
    "speaker": null,
    "timestamp": "00:25:14",
    "line": "Men ja, småsnacket."
  },
  {
    "speaker": null,
    "timestamp": "00:25:19",
    "line": "Alltså gissar det här när man får veta göttiga saker."
  },
  {
    "speaker": null,
    "timestamp": "00:25:23",
    "line": "Du vill ha skvaller rätt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:25",
    "line": "Gud ja."
  },
  {
    "speaker": null,
    "timestamp": "00:25:28",
    "line": "Det är den droppen som kommer få dig att få dig tillbaka till kontoret."
  },
  {
    "speaker": null,
    "timestamp": "00:25:33",
    "line": "Vi pratade mycket skvaller idag och då kände du att fan, jag måste vara där."
  },
  {
    "speaker": null,
    "timestamp": "00:25:38",
    "line": "Jag fick ju höra skvaller om vad som hade för sig gått på mitt gym."
  },
  {
    "speaker": null,
    "timestamp": "00:25:43",
    "line": "Jag har egentligen ingen relation till människor där. Jag har kanske sett dem."
  },
  {
    "speaker": null,
    "timestamp": "00:25:48",
    "line": "Det är inte ett företag som jag har en relation till annat än att jag är där."
  },
  {
    "speaker": null,
    "timestamp": "00:25:53",
    "line": "Men ändå blev jag lite glad när jag fick skvaller."
  },
  {
    "speaker": null,
    "timestamp": "00:25:58",
    "line": "Därifrån."
  },
  {
    "speaker": null,
    "timestamp": "00:26:00",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:26:00",
    "line": "Liksom varm."
  },
  {
    "speaker": null,
    "timestamp": "00:26:01",
    "line": "Ja, jag förstår känslan."
  },
  {
    "speaker": null,
    "timestamp": "00:26:03",
    "line": "(skratt)"
  },
  {
    "speaker": null,
    "timestamp": "00:26:05",
    "line": "(skratt)"
  },
  {
    "speaker": null,
    "timestamp": "00:26:07",
    "line": "Ja, det kanske var att jag heller ska skryta om att man gillar skvaller, men så är det."
  },
  {
    "speaker": null,
    "timestamp": "00:26:12",
    "line": "Ja, nej. Jag tycker du kan absolut stå för det."
  },
  {
    "speaker": null,
    "timestamp": "00:26:16",
    "line": "(skratt)"
  },
  {
    "speaker": null,
    "timestamp": "00:26:18",
    "line": "Det är ett..."
  },
  {
    "speaker": null,
    "timestamp": "00:26:19",
    "line": "Jag har en liten rövste mardrömmar här nere tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:26:21",
    "line": "Aha, lilla vovvent."
  },
  {
    "speaker": null,
    "timestamp": "00:26:23",
    "line": "Nej men det kanske är det för den här gången tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:26:29",
    "line": "Ja, vi är ju inte framme vid att restriktionerna släpper än."
  },
  {
    "speaker": null,
    "timestamp": "00:26:36",
    "line": "Nej vi får väl se hur det är om typ ett år tänker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:26:40",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:26:42",
    "line": "Om vilken av våra drömarbetsplatser har slagit in."
  },
  {
    "speaker": null,
    "timestamp": "00:26:46",
    "line": "Vilken har blivit den här hajpade, nya aktivitetsbaserade arbetsplatsen."
  },
  {
    "speaker": null,
    "timestamp": "00:26:51",
    "line": "Och vem har varit så glad och vem har varit så ledsen?"
  },
  {
    "speaker": null,
    "timestamp": "00:26:56",
    "line": "Med det sagt så återkommer vi om två veckor igen."
  },
  {
    "speaker": null,
    "timestamp": "00:27:00",
    "line": "Vill man oss något så finns vi svarande på Twitter."
  },
  {
    "speaker": null,
    "timestamp": "00:27:02",
    "line": "Och med det så säger vi hej då!"
  },
  {
    "speaker": null,
    "timestamp": "00:27:05",
    "line": "Hej då!"
  },
  {
    "speaker": null,
    "timestamp": "00:27:07",
    "line": "[Outromusik]"
  }
]
