[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Varför tycker inte folk om att gå på restaurang på landsbygden?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:06",
    "line": "Jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:00:08",
    "line": "Det är för dålig service."
  },
  {
    "speaker": null,
    "timestamp": "00:00:10",
    "line": "Alltså..."
  },
  {
    "speaker": null,
    "timestamp": "00:00:12",
    "line": "Ja, det var..."
  },
  {
    "speaker": null,
    "timestamp": "00:00:16",
    "line": "Det var bra. Jag gillar den där."
  },
  {
    "speaker": null,
    "timestamp": "00:00:22",
    "line": "Den är så jävla..."
  },
  {
    "speaker": null,
    "timestamp": "00:00:24",
    "line": "Om man inte vet..."
  },
  {
    "speaker": null,
    "timestamp": "00:00:26",
    "line": "-som premissen för att utveckla relaterade skämt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:31",
    "line": "Så är det liksom inget skämt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:34",
    "line": "- Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:00:36",
    "line": "Det är otroligt kontextberoende."
  },
  {
    "speaker": null,
    "timestamp": "00:00:40",
    "line": "- Ja, det funkar bara i kontexten av den här podden."
  },
  {
    "speaker": null,
    "timestamp": "00:00:44",
    "line": "- Ja. Och inte internet."
  },
  {
    "speaker": null,
    "timestamp": "00:00:49",
    "line": "- Ja, exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:52",
    "line": "Välkomna till ett nytt avsnitt av ASDF."
  },
  {
    "speaker": null,
    "timestamp": "00:00:55",
    "line": "Jag har"
  },
  {
    "speaker": null,
    "timestamp": "00:00:58",
    "line": "precis kommit tillbaka från semester"
  },
  {
    "speaker": null,
    "timestamp": "00:01:01",
    "line": "som jag"
  },
  {
    "speaker": null,
    "timestamp": "00:01:02",
    "line": "kände var välbehövlig men jag är som vanligt ännu tröttare efter semester än jag var innan."
  },
  {
    "speaker": null,
    "timestamp": "00:01:07",
    "line": "Så jag tänker att jag låter dig ta lid idag."
  },
  {
    "speaker": null,
    "timestamp": "00:01:12",
    "line": "- Ja, tack. Ja, alltså det nämnde vi ju förra gången va? Men jag har ju skaffat en valp."
  },
  {
    "speaker": null,
    "timestamp": "00:01:19",
    "line": "Så att"
  },
  {
    "speaker": null,
    "timestamp": "00:01:21",
    "line": "Jag vet inte riktigt hur jag existerar längre, men vi kan prova."
  },
  {
    "speaker": null,
    "timestamp": "00:01:27",
    "line": "Jag har funderat lite på privilegier, skulle man kunna säga."
  },
  {
    "speaker": null,
    "timestamp": "00:01:36",
    "line": "Och här igen då, kontext. Men just det som har hänt på sistone, mer eller mindre,"
  },
  {
    "speaker": null,
    "timestamp": "00:01:43",
    "line": "är väl just att spelbolag överlag har uppmärksammats lite kring att det faktiskt är, vad ska man kalla det, lite sexistiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:01:54",
    "line": "Och inte bara kanske då hur i själva spelen utan att det även finns problem internt på bolagen och hos de anställda"
  },
  {
    "speaker": null,
    "timestamp": "00:02:09",
    "line": "och att det finns väldigt många som har varit med om saker som uppfattas som kränkande eller trakasserier och så vidare."
  },
  {
    "speaker": null,
    "timestamp": "00:02:22",
    "line": "Och det som dyker upp mycket som en fråga där är väl dels att, okej men spel kan ju vara sexistiska, men vad har det med internt på bolaget att göra?"
  },
  {
    "speaker": null,
    "timestamp": "00:02:34",
    "line": "folk blir väldigt chockade över att det kan hända internt på bolaget, även personer som"
  },
  {
    "speaker": null,
    "timestamp": "00:02:40",
    "line": "befinner sig på sagda bolag som inte har märkt någonting överhuvudtaget."
  },
  {
    "speaker": null,
    "timestamp": "00:02:44",
    "line": "Det här är lite intressant för att jag tror, det är två saker som jag har tänkt mycket på."
  },
  {
    "speaker": null,
    "timestamp": "00:02:51",
    "line": "Jag tror dels att, okej, men om du har ett spel som är sexistiskt och ingen reagerar på det,"
  },
  {
    "speaker": null,
    "timestamp": "00:02:56",
    "line": "Det är mycket exponerade kvinnor och de är objekt snarare än någonting annat i spel."
  },
  {
    "speaker": null,
    "timestamp": "00:03:06",
    "line": "Så är det väl kanske inte så konstigt att miljön som skapar dessa spel inte är mer uppmärksammande på detta sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:03:18",
    "line": "För om ingen reagerar på att vi skapar produkter som är sexistiska, då är det kanske inte så svårt att tänka sig att miljön som skapar dem är så upplysta heller."
  },
  {
    "speaker": null,
    "timestamp": "00:03:32",
    "line": "Eller vad jag ska kalla det. Nu svamlar jag bara. Hänger du med?"
  },
  {
    "speaker": null,
    "timestamp": "00:03:35",
    "line": "Jag hänger med, och jag håller verkligen med dig."
  },
  {
    "speaker": null,
    "timestamp": "00:03:37",
    "line": "Det känns ju som att..."
  },
  {
    "speaker": null,
    "timestamp": "00:03:39",
    "line": "Precis, alltså så här att..."
  },
  {
    "speaker": null,
    "timestamp": "00:03:42",
    "line": "Det är väl ganska logiskt att miljön som har skapat sexistiska saker också är sexistisk, så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:03:49",
    "line": "Sen behöver man ju inte säga att alla som är där är sexistiska."
  },
  {
    "speaker": null,
    "timestamp": "00:03:54",
    "line": "Men liksom att..."
  },
  {
    "speaker": null,
    "timestamp": "00:03:56",
    "line": "Som du är inne på, att ingen säger ifrån, ingen liksom reagerar på det."
  },
  {
    "speaker": null,
    "timestamp": "00:04:01",
    "line": "Det kan ju såklart ha med en massa saker att göra, som att det finns någon tystnadskultur och allt möjligt."
  },
  {
    "speaker": null,
    "timestamp": "00:04:04",
    "line": "Men jag tror att vi pratade om det här för ganska länge sedan nu."
  },
  {
    "speaker": null,
    "timestamp": "00:04:10",
    "line": "Om den här boken är \"technically wrong\" tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:04:15",
    "line": "Som tar upp det här exemplet med någon handtork som inte reagerade på svartas händer."
  },
  {
    "speaker": null,
    "timestamp": "00:04:23",
    "line": "Det känns lite som samma grej."
  },
  {
    "speaker": null,
    "timestamp": "00:04:28",
    "line": "Det är inte så att det är ett till ett liknelse här, men det är inte rasistiska människor som har gjort det."
  },
  {
    "speaker": null,
    "timestamp": "00:04:37",
    "line": "Men strukturellt sett så kanske det blir därför att de inte har tänkt på att testa på andra än sig själva och så vidare."
  },
  {
    "speaker": null,
    "timestamp": "00:04:42",
    "line": "Nu framlade jag också, men ungefär samma fråga."
  },
  {
    "speaker": null,
    "timestamp": "00:04:47",
    "line": "Precis så blir det ju, för om du är i en miljö där ingen någonsin tycker det är konstigt att kvinnor bara är objekt i spel,"
  },
  {
    "speaker": null,
    "timestamp": "00:04:53",
    "line": "Det är ingen som reagerar på det."
  },
  {
    "speaker": null,
    "timestamp": "00:04:55",
    "line": "Men varför skulle man reagera på real life händelser som antagligen är mindre och som är mindre synliga och som inte alls påverkar en massa?"
  },
  {
    "speaker": null,
    "timestamp": "00:05:05",
    "line": "Det tycker inte jag är så konstigt."
  },
  {
    "speaker": null,
    "timestamp": "00:05:08",
    "line": "Jag är väl kanske cynisk och lite bitter, men jag skulle ju inte säga mig vara ett dugg chockad över att de här senaste sakerna har dykt upp."
  },
  {
    "speaker": null,
    "timestamp": "00:05:17",
    "line": "Det finns så många, så hög procent som man ser sig ha varit utsatta för saker på bolag och så vidare."
  },
  {
    "speaker": null,
    "timestamp": "00:05:24",
    "line": "Jag tror det var någonting, inte Outa, men det stod väl i medierna att Paradox hade 60 procent"
  },
  {
    "speaker": null,
    "timestamp": "00:05:32",
    "line": "som anmälde att de har känt sig kränkta eller utsatta på jobbet."
  },
  {
    "speaker": null,
    "timestamp": "00:05:37",
    "line": "Ja, exakt. För det var väl det senaste svenska exemplet med Paradox."
  },
  {
    "speaker": null,
    "timestamp": "00:05:42",
    "line": "Det var ju någon typ intern undersökning som de hade gjort själva tror jag, eller om det var facket som hade gjort det, jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:05:48",
    "line": "Jag tror att det var ganska låg svarsfrekvens på den, alltså det var typ 120 personer som hade svarat."
  },
  {
    "speaker": null,
    "timestamp": "00:05:53",
    "line": "Men liksom, det är ändå ganska högt antal personer, alltså även om det var 60% av 120 så är det ganska många personer som har blivit utsatta för någonting på jobbet."
  },
  {
    "speaker": null,
    "timestamp": "00:06:04",
    "line": "Och det spelar liksom ingen roll om det är, även om det hade varit 20% som skulle sagt någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:06:11",
    "line": "så är det ju i mitt tycke ett lika stort problem."
  },
  {
    "speaker": null,
    "timestamp": "00:06:15",
    "line": "- Ja, och nu är det inte så här, för jag skulle ju inte säga att det bara gäller spelbolagen, liksom, och det gäller inte bara Paradox, det är mer att det var ett exempel som dykt upp nu, utan jag tror att det är mer utbrett på många bolag än vad folk ville tro eller liksom faktiskt inse."
  },
  {
    "speaker": null,
    "timestamp": "00:06:37",
    "line": "Alla kanske känner någon som har blivit illa behandlad, kränkt eller trakasserad på en arbetsplats."
  },
  {
    "speaker": null,
    "timestamp": "00:06:47",
    "line": "Men det är ingen som känner tillräckligt många som skulle ha utsatt någon för det."
  },
  {
    "speaker": null,
    "timestamp": "00:06:53",
    "line": "Det var en dålig take på det."
  },
  {
    "speaker": null,
    "timestamp": "00:06:56",
    "line": "Jag förstår vad du menar."
  },
  {
    "speaker": null,
    "timestamp": "00:06:58",
    "line": "Jag tror också att det är ett generellt problem för många."
  },
  {
    "speaker": null,
    "timestamp": "00:07:02",
    "line": "för många. Men jag tror ändå, det känns som att, alltså min bild av spelbolag är ju att det är lite sämre kultur där om man inte tillhör den här gruppen personer som liksom"
  },
  {
    "speaker": null,
    "timestamp": "00:07:13",
    "line": "tillhör majoriteten, älskar att liksom, aha jag älskar att sitta uppe på kvällen, jag brinner för mitt jobb, jag har drömt om att vara spelutvecklare hela mitt liv."
  },
  {
    "speaker": null,
    "timestamp": "00:07:22",
    "line": "liv, vilket då till kanske 99,9 procent är vita män."
  },
  {
    "speaker": null,
    "timestamp": "00:07:27",
    "line": "- Ja, och då skulle jag väl ändå vilja komma in på lite den här andra"
  },
  {
    "speaker": null,
    "timestamp": "00:07:33",
    "line": "saken som såklart hänger ihop, men som jag funderat väldigt mycket på, och det är"
  },
  {
    "speaker": null,
    "timestamp": "00:07:37",
    "line": "just privilegier. För att jag kan ha hört en del säga \"men jag har inte märkt"
  },
  {
    "speaker": null,
    "timestamp": "00:07:42",
    "line": "någonting\" och \"jag upplever det inte så här\" och \"jag gör inte det\". Nej, och"
  },
  {
    "speaker": null,
    "timestamp": "00:07:48",
    "line": "Och det kanske är för att de personerna sitter högt upp på privilegiestegen."
  },
  {
    "speaker": null,
    "timestamp": "00:07:55",
    "line": "Och det är inte så att någon gör något fel, och det kanske inte alltid är så lätt att uppmärksamma saker när man inte har en aning om det."
  },
  {
    "speaker": null,
    "timestamp": "00:08:02",
    "line": "Men det faktum är att anledningen till att vissa inte märker någonting är antagligen för att de är så privilegierade."
  },
  {
    "speaker": null,
    "timestamp": "00:08:11",
    "line": "För att grunden är så här, privilegier är osynliga för de som har dem."
  },
  {
    "speaker": null,
    "timestamp": "00:08:20",
    "line": "Och exemplifierat då, jag har jättemycket privilegier."
  },
  {
    "speaker": null,
    "timestamp": "00:08:27",
    "line": "Till exempel, det tog väldigt många år innan jag funderade på hudfärgade plåster till exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:08:38",
    "line": "Det var aldrig något konstigt för mig."
  },
  {
    "speaker": null,
    "timestamp": "00:08:40",
    "line": "Jag var så här, ja men det är ett plåster, det är så här"
  },
  {
    "speaker": null,
    "timestamp": "00:08:42",
    "line": "\"hudfärg\" och alla vet vad jag menar när jag säger \"hudfärg\"."
  },
  {
    "speaker": null,
    "timestamp": "00:08:46",
    "line": "Men det är ju bara för att jag har en privilegierad ljus hudfärg, liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:08:51",
    "line": "Eller ska jag in i en byggnad, kontor, vad som helst, då behöver inte jag fundera på"
  },
  {
    "speaker": null,
    "timestamp": "00:08:57",
    "line": "om det finns en trappa jag ska komma upp för eller inte."
  },
  {
    "speaker": null,
    "timestamp": "00:09:00",
    "line": "För att jag har kroppssfunktion så jag kan bara gå upp för den."
  },
  {
    "speaker": null,
    "timestamp": "00:09:05",
    "line": "Det är också privilegier. Och de här är osynliga för mig. De har varit där, för att jag aldrig behövt tänka på dem."
  },
  {
    "speaker": null,
    "timestamp": "00:09:11",
    "line": "Och på ett bolag där du sitter i en kultur, det kanske inte är lika fysiska saker, men jag menar kulturen på möten, uttryck, skämt, kränkningar."
  },
  {
    "speaker": null,
    "timestamp": "00:09:26",
    "line": "Det är inte att folk avsiktligt väljer att bortse ifrån dem, men de kanske helt enkelt är osynliga för vissa."
  },
  {
    "speaker": null,
    "timestamp": "00:09:34",
    "line": "Ja, och jag tycker en viktig poäng när man pratar om det här är väl just det här med att man kan dra sexistiska skämt utan att vara en sexist."
  },
  {
    "speaker": null,
    "timestamp": "00:09:49",
    "line": "Eller man kan dra rasistiska skämt utan att vara en rasist."
  },
  {
    "speaker": null,
    "timestamp": "00:09:53",
    "line": "I och med att, som du är inne på, mina privilegier är i tomma, så jag är inte medveten om dem"
  },
  {
    "speaker": null,
    "timestamp": "00:09:59",
    "line": "om jag inte aktivt letar efter dem, eller aktivt diskuterar dem, eller tar reda på dem."
  },
  {
    "speaker": null,
    "timestamp": "00:10:04",
    "line": "Och då var det svårt i början att, \"jag fattade inte att det här skämtet var funkofobiskt\""
  },
  {
    "speaker": null,
    "timestamp": "00:10:12",
    "line": "till exempel. För att jag har aldrig tänkt på det utifrån mina privilegier."
  },
  {
    "speaker": null,
    "timestamp": "00:10:17",
    "line": "Men det som också blir problemet då när man diskuterar de här grejerna sen är att alla bara \"Jag är inte rasist\""
  },
  {
    "speaker": null,
    "timestamp": "00:10:23",
    "line": "\"Du anklagar mig för att vara rasist, jag är inte rasist, jag tycker det här\""
  },
  {
    "speaker": null,
    "timestamp": "00:10:27",
    "line": "Och det är förmodligen 100% sant, men man kan ändå vara rasistisk i sina handlingar utan att det liksom är vem du är som person"
  },
  {
    "speaker": null,
    "timestamp": "00:10:38",
    "line": "Ja precis, det är så himla viktigt att skilja på identitet och handling."
  },
  {
    "speaker": null,
    "timestamp": "00:10:45",
    "line": "Jag menar sen kan vi ha en diskussion om du bara gör rasistiska handlingar men fortfarande inte tycker att du är rasist."
  },
  {
    "speaker": null,
    "timestamp": "00:10:51",
    "line": "Det kan vi ha en diskussion om såklart."
  },
  {
    "speaker": null,
    "timestamp": "00:10:53",
    "line": "Men jag menar identiteten och det här är ju, alltså jag har ju dragit skämt i mitt liv som varit både rasistiska och sexistiska."
  },
  {
    "speaker": null,
    "timestamp": "00:11:06",
    "line": "Jag har nog checkat alla de rutorna för att jag har inte förstått bättre."
  },
  {
    "speaker": null,
    "timestamp": "00:11:12",
    "line": "Jag har också dragit extremt många nedvärderande skämt om mig själv"
  },
  {
    "speaker": null,
    "timestamp": "00:11:16",
    "line": "och tyckte att jag har rätt att göra det för att jag blir utsatt för sexism och rasism."
  },
  {
    "speaker": null,
    "timestamp": "00:11:21",
    "line": "Men det får väl stå för det."
  },
  {
    "speaker": null,
    "timestamp": "00:11:26",
    "line": "Men det jag gör i det är att jag spär på en kultur som är extremt problematisk"
  },
  {
    "speaker": null,
    "timestamp": "00:11:31",
    "line": "och jag hjälper människor att hitta en ursäkt för det."
  },
  {
    "speaker": null,
    "timestamp": "00:11:34",
    "line": "\"Det här skämtet drog min kompis och hon är ju asiat så att hon får dra det, då får jag dra det, då är det okej\""
  },
  {
    "speaker": null,
    "timestamp": "00:11:41",
    "line": "Vilket det inte är, för att jag talar inte för en hel grupp."
  },
  {
    "speaker": null,
    "timestamp": "00:11:46",
    "line": "Vi pratar ju nu på en strukturell nivå, vi pratar ju inte på en individnivå."
  },
  {
    "speaker": null,
    "timestamp": "00:11:51",
    "line": "Utan det finns strukturella problem som också dyker upp på en arbetsplats."
  },
  {
    "speaker": null,
    "timestamp": "00:11:56",
    "line": "Och det handlar inte heller om att vara så här \"ja men jag måste göra allting rätt och annars är jag en dålig människa\"."
  },
  {
    "speaker": null,
    "timestamp": "00:12:08",
    "line": "Det är absolut inte det det handlar om. Det handlar om att människor måste lära sig, ta in och förstå."
  },
  {
    "speaker": null,
    "timestamp": "00:12:18",
    "line": "Alltså lyssna på andra människors upplevelser och protester och tankar kring det hela."
  },
  {
    "speaker": null,
    "timestamp": "00:12:26",
    "line": "För att det blir ju också extremt problematiskt när någon är så här"
  },
  {
    "speaker": null,
    "timestamp": "00:12:29",
    "line": "\"Nej, men jag har inte gjort något fel. Jag tänker inte lyssna på vad du säger. Jag har absolut inte gjort det.\""
  },
  {
    "speaker": null,
    "timestamp": "00:12:35",
    "line": "Eller kanske när det också blir så här \"Aha, men vad har jag gjort fel?\""
  },
  {
    "speaker": null,
    "timestamp": "00:12:40",
    "line": "Och så får man en hel ryggdunk av andra. \"Nej, men du har inte gjort något fel. Ingen har kunnat veta det här."
  },
  {
    "speaker": null,
    "timestamp": "00:12:45",
    "line": "Du kan inte se det och hur ska du kunna veta det som aldrig varit i en sådan situation?"
  },
  {
    "speaker": null,
    "timestamp": "00:12:53",
    "line": "När man ursäktar varandras handlingar eller icke-handlingar."
  },
  {
    "speaker": null,
    "timestamp": "00:13:02",
    "line": "Ja, precis. Och det är ju extremt svårt att sitta själv och bara reflektera över det."
  },
  {
    "speaker": null,
    "timestamp": "00:13:15",
    "line": "Det har jag upplevt själv. Om vi pratar privilegier till exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:13:18",
    "line": "Det är ju extremt svårt för mig att sitta själv och bara fundera."
  },
  {
    "speaker": null,
    "timestamp": "00:13:20",
    "line": "Okej, vilka privilegier har jag?"
  },
  {
    "speaker": null,
    "timestamp": "00:13:22",
    "line": "För att det är, om jag inte får någon input utifrån så vet jag inte vilka privilegier som finns."
  },
  {
    "speaker": null,
    "timestamp": "00:13:29",
    "line": "Alltså det kan vara vad som helst, det är mycket som man har tänkt på."
  },
  {
    "speaker": null,
    "timestamp": "00:13:35",
    "line": "Men vi har ju pratat om det här utanför podden också, att fundera på privilegier."
  },
  {
    "speaker": null,
    "timestamp": "00:13:39",
    "line": "Men att man kommer från en bakgrund med universitetsutbildade föräldrar,"
  },
  {
    "speaker": null,
    "timestamp": "00:13:44",
    "line": "eller att ens föräldrar inte är skilda."
  },
  {
    "speaker": null,
    "timestamp": "00:13:47",
    "line": "Eller att man har gått på universitet eller man har högre utbildning."
  },
  {
    "speaker": null,
    "timestamp": "00:13:52",
    "line": "Alltså det är så extremt mycket. Utbildningen i Sverige är ju gratis i stort sett."
  },
  {
    "speaker": null,
    "timestamp": "00:13:56",
    "line": "Och det är ju så sjukt svårt att bara sitta och tänka på själv."
  },
  {
    "speaker": null,
    "timestamp": "00:14:04",
    "line": "Det är lätt att man bara hamnar i så här \"Ja men jag är privilegierad för jag är vit\""
  },
  {
    "speaker": null,
    "timestamp": "00:14:08",
    "line": "\"Jag är privilegierad för jag är man\""
  },
  {
    "speaker": null,
    "timestamp": "00:14:10",
    "line": "Vilket är de här stora som de flesta förhoppningsvis känner till"
  },
  {
    "speaker": null,
    "timestamp": "00:14:14",
    "line": "Men det finns så extremt många mycket mindre små privilegier som man inte tänker på lika ofta"
  },
  {
    "speaker": null,
    "timestamp": "00:14:20",
    "line": "Men som ändå påverkar ens vardag på ett sätt eller annat"
  },
  {
    "speaker": null,
    "timestamp": "00:14:25",
    "line": "Ja, det tycker jag är så intressant för jag har upplevt det fortfarande ibland."
  },
  {
    "speaker": null,
    "timestamp": "00:14:31",
    "line": "Det var för inte så länge sedan, när det satt ett gäng och vi diskuterade resor, specifikt utlandsresor gjorda i barndomen."
  },
  {
    "speaker": null,
    "timestamp": "00:14:40",
    "line": "Det var en person som var helt knäpptyst under hela den konversationen."
  },
  {
    "speaker": null,
    "timestamp": "00:14:46",
    "line": "Det fick jag reda på senare att den personen hade inga utlandsresor när den var yngre för att det fanns inte pengar att göra det."
  },
  {
    "speaker": null,
    "timestamp": "00:14:53",
    "line": "Och det är inget konstigt, men det var ju någonting som vi alla andra bara tog för givet."
  },
  {
    "speaker": null,
    "timestamp": "00:15:00",
    "line": "- Ja, nämen exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:15:02",
    "line": "- Och det blir ju väldigt exkluderande för den personen."
  },
  {
    "speaker": null,
    "timestamp": "00:15:06",
    "line": "Alltså såklart man ska kunna prata om de här sakerna också."
  },
  {
    "speaker": null,
    "timestamp": "00:15:09",
    "line": "För att till slut blir det så här, man får inte prata om någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:15:12",
    "line": "Jo, du får prata om vad du vill, när du vill antar jag."
  },
  {
    "speaker": null,
    "timestamp": "00:15:14",
    "line": "Men man kanske ska läsa situationen och rummet."
  },
  {
    "speaker": null,
    "timestamp": "00:15:18",
    "line": "- Ja, exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:15:20",
    "line": "Jag är också väldigt mycket inne på, man får ta skämtexempel som du var inne på innan."
  },
  {
    "speaker": null,
    "timestamp": "00:15:24",
    "line": "Jag tycker typ att man får skämta om vad som helst."
  },
  {
    "speaker": null,
    "timestamp": "00:15:27",
    "line": "Men det finns ändå en tid och en plats."
  },
  {
    "speaker": null,
    "timestamp": "00:15:31",
    "line": "Man måste kunna vara med på vilken förväntan det finns i rummet man är i."
  },
  {
    "speaker": null,
    "timestamp": "00:15:38",
    "line": "Det finns en komiker som heter Antonij Jaselnik."
  },
  {
    "speaker": null,
    "timestamp": "00:15:40",
    "line": "Hela hans brand är att han skämtar om saker man inte får skämta om."
  },
  {
    "speaker": null,
    "timestamp": "00:15:45",
    "line": "Men..."
  },
  {
    "speaker": null,
    "timestamp": "00:15:47",
    "line": "Då är ju också förväntan när man tittar på honom att så här"
  },
  {
    "speaker": null,
    "timestamp": "00:15:51",
    "line": "Jag vet att han kommer gå över gränser, jag vet att han kommer skämta om saker man inte får skämta om"
  },
  {
    "speaker": null,
    "timestamp": "00:15:55",
    "line": "Sen gör han det på ett väldigt snyggt sätt så att det är lite bättre kanske"
  },
  {
    "speaker": null,
    "timestamp": "00:16:00",
    "line": "Men då är det ändå ett bra sätt att göra det på kan jag tycka"
  },
  {
    "speaker": null,
    "timestamp": "00:16:04",
    "line": "Medans man"
  },
  {
    "speaker": null,
    "timestamp": "00:16:05",
    "line": "Annars kan liksom hamna i att man skämtar"
  },
  {
    "speaker": null,
    "timestamp": "00:16:11",
    "line": "På bekostnad av personer i rummet"
  },
  {
    "speaker": null,
    "timestamp": "00:16:17",
    "line": "Alltså att jag inte vill skämta om sexistiska skämt med folk jag inte har den repertoaren med."
  },
  {
    "speaker": null,
    "timestamp": "00:16:29",
    "line": "Jag vet att vi har pratat om det här förut och de vet att det är skämt och att de är helt med på det här."
  },
  {
    "speaker": null,
    "timestamp": "00:16:36",
    "line": "Så jag kanske inte ställer mig på en ave och pratar med lite nya kollegor och bara \"Dra det här sexistiska skämtet\"."
  },
  {
    "speaker": null,
    "timestamp": "00:16:44",
    "line": "Sen tycker jag fortfarande, för nu inser jag att det låter som att jag tycker att man kan, är man en grupp grabbar så kan man dra sexistiska skäm för att inga kvinnor är allvarande."
  },
  {
    "speaker": null,
    "timestamp": "00:16:52",
    "line": "Det är inte riktigt vad jag menar kanske, utan det handlar mer om att man måste hitta nivån."
  },
  {
    "speaker": null,
    "timestamp": "00:17:01",
    "line": "Ja, för det är ju också..."
  },
  {
    "speaker": null,
    "timestamp": "00:17:03",
    "line": "För att även skämta om vad som helst, det är ju extremt problematiskt om du skämtar med kompisar som inte förstår, som inte har"
  },
  {
    "speaker": null,
    "timestamp": "00:17:10",
    "line": "ett djupare kring det."
  },
  {
    "speaker": null,
    "timestamp": "00:17:13",
    "line": "Att de bara tar det som att spä på sina egna grundade åsikter och så vidare och så vidare. Det kanske är så."
  },
  {
    "speaker": null,
    "timestamp": "00:17:19",
    "line": "Ja, nej men precis. Så att..."
  },
  {
    "speaker": null,
    "timestamp": "00:17:24",
    "line": "Jag tycker det är svårt. Det var ju nyligen i..."
  },
  {
    "speaker": null,
    "timestamp": "00:17:29",
    "line": "I parlamentet var det väl ganska nyligen när Claes Malmberg sjöng någon liten sång som var..."
  },
  {
    "speaker": null,
    "timestamp": "00:17:38",
    "line": "Han sjöng typ om gangstrar i orten, tror jag. Om jag minns rätt. Jag har inte riktigt följt med."
  },
  {
    "speaker": null,
    "timestamp": "00:17:45",
    "line": "Och fick extremt mycket kritik för det."
  },
  {
    "speaker": null,
    "timestamp": "00:17:47",
    "line": "Och där kan jag verkligen förstå kritiken."
  },
  {
    "speaker": null,
    "timestamp": "00:17:51",
    "line": "För att typ en del av kritiken var ju till exempel det här att..."
  },
  {
    "speaker": null,
    "timestamp": "00:17:54",
    "line": "Ni skämtar bara om det här för att ni inte har förstått"
  },
  {
    "speaker": null,
    "timestamp": "00:17:58",
    "line": "magnituden av problemet med att folk blir skjutna i gängvåld"
  },
  {
    "speaker": null,
    "timestamp": "00:18:04",
    "line": "Och den kritiken tycker jag håller"
  },
  {
    "speaker": null,
    "timestamp": "00:18:09",
    "line": "Samtidigt..."
  },
  {
    "speaker": null,
    "timestamp": "00:18:11",
    "line": "För då var kritiken typ \"Ja men ni har inte förstått magnituden av gängvåldet\""
  },
  {
    "speaker": null,
    "timestamp": "00:18:14",
    "line": "\"Ni skulle aldrig skämta om...\""
  },
  {
    "speaker": null,
    "timestamp": "00:18:16",
    "line": "\"Ja, kan det vara...\""
  },
  {
    "speaker": null,
    "timestamp": "00:18:18",
    "line": "\"Dådet på Drottninggatan precis efter att det hade hänt\""
  },
  {
    "speaker": null,
    "timestamp": "00:18:21",
    "line": "\"När det fortfarande var aktuellt\""
  },
  {
    "speaker": null,
    "timestamp": "00:18:23",
    "line": "skämta om Estonia-katastrofen dagen efter att det hänt."
  },
  {
    "speaker": null,
    "timestamp": "00:18:29",
    "line": "Och i och med att gängvåldet är en pågående katastrof"
  },
  {
    "speaker": null,
    "timestamp": "00:18:33",
    "line": "så håller jag med om den kritiken."
  },
  {
    "speaker": null,
    "timestamp": "00:18:36",
    "line": "Jag förstår att man tycker det."
  },
  {
    "speaker": null,
    "timestamp": "00:18:38",
    "line": "Samtidigt förstår jag också parlamentets sida"
  },
  {
    "speaker": null,
    "timestamp": "00:18:40",
    "line": "att de säger \"Vi är ett satirprogram, det här är den kontexten vi gör\""
  },
  {
    "speaker": null,
    "timestamp": "00:18:43",
    "line": "\"Alla våra komiker spelar en karaktär, de är inte sig själva\""
  },
  {
    "speaker": null,
    "timestamp": "00:18:49",
    "line": "och så vidare."
  },
  {
    "speaker": null,
    "timestamp": "00:18:51",
    "line": "Det är väldigt svår balans som jag håller med båda sidorna."
  },
  {
    "speaker": null,
    "timestamp": "00:18:56",
    "line": "I det här fallet kanske lite mer den kritiken som faktiskt riktades mot dem."
  },
  {
    "speaker": null,
    "timestamp": "00:19:02",
    "line": "Just för att jag kanske inte hade tänkt, jag är definitivt en av dem som inte har tänkt att"
  },
  {
    "speaker": null,
    "timestamp": "00:19:07",
    "line": "gängvåld är en så pass pågående katastrof som det egentligen är."
  },
  {
    "speaker": null,
    "timestamp": "00:19:16",
    "line": "Jag har inte riktigt hängt med. Jag har hängt med lite i utkanten."
  },
  {
    "speaker": null,
    "timestamp": "00:19:21",
    "line": "Det jag såg var väl just kanske att han gick ut och sa nånting kring"
  },
  {
    "speaker": null,
    "timestamp": "00:19:29",
    "line": "det är satir, attackera inte mig, attackera de riktiga rasisterna istället."
  },
  {
    "speaker": null,
    "timestamp": "00:19:35",
    "line": "Ja, det har han inte läst, tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:19:38",
    "line": "Det är faktiskt en rubrik, så jag har inte läst hela artikeln, ska jag säga."
  },
  {
    "speaker": null,
    "timestamp": "00:19:43",
    "line": "Men jag tycker ändå att den saken är intressant, och det är det som vi var inne på tidigare,"
  },
  {
    "speaker": null,
    "timestamp": "00:19:50",
    "line": "att de riktiga rasisterna, vilka är de riktiga rasisterna då?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:55",
    "line": "Är det bara de riktiga rasisterna som upprätthåller strukturen rasism?"
  },
  {
    "speaker": null,
    "timestamp": "00:20:00",
    "line": "Eller är det liksom att vi normaliserar att skämta på det här sättet"
  },
  {
    "speaker": null,
    "timestamp": "00:20:09",
    "line": "gemene person som hjälper till att bygga upp det. Man pratar mycket om den här våldstriangeln och likadant. Alltså en triangel vad gäller strukturer."
  },
  {
    "speaker": null,
    "timestamp": "00:20:22",
    "line": "På toppen har du kanske de rena rasisterna som bränner kors och vad de nu gör. Jag menar alltså, ju längre ner du kommer så finns det en platta som underbygger det här beteendet."
  },
  {
    "speaker": null,
    "timestamp": "00:20:36",
    "line": "där vi börjar kanske med skämt och kommentarer och normalisering kring det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:42",
    "line": "Och för att då försöka komma tillbaka lite till det som jag pratade om innan,"
  },
  {
    "speaker": null,
    "timestamp": "00:20:46",
    "line": "liksom med företagskultur, så är det ju likadant där på företaget."
  },
  {
    "speaker": null,
    "timestamp": "00:20:51",
    "line": "Säg att vi har en händelse som är, ja men du vet, klassiskt, vad vet jag,"
  },
  {
    "speaker": null,
    "timestamp": "00:20:58",
    "line": "en personalfest där saker går över styr och någon agerade totalt fel"
  },
  {
    "speaker": null,
    "timestamp": "00:21:03",
    "line": "Alla ser det här som en extremt vidrig handling."
  },
  {
    "speaker": null,
    "timestamp": "00:21:07",
    "line": "Alla ser att de tycker att det här borde aldrig ha fått ske och så vidare."
  },
  {
    "speaker": null,
    "timestamp": "00:21:12",
    "line": "Det är ju toppen antagligen på hela kulturen."
  },
  {
    "speaker": null,
    "timestamp": "00:21:15",
    "line": "Och med det menar jag inte bara att det finns sunkit beteende som ligger till grund för det här,"
  },
  {
    "speaker": null,
    "timestamp": "00:21:20",
    "line": "utan det finns ju även en tystnadskultur som ligger till grund för det."
  },
  {
    "speaker": null,
    "timestamp": "00:21:24",
    "line": "Där har vi igen mycket så att man kan inte hjälpa till om man inte ser att någonting har hänt."
  },
  {
    "speaker": null,
    "timestamp": "00:21:28",
    "line": "Nej, det är kanske sant liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:21:30",
    "line": "Men det är lättare också att komma efter hand och säga \"jag kan inte förstå att det har hänt, är jag privilegierad?\""
  },
  {
    "speaker": null,
    "timestamp": "00:21:36",
    "line": "Ja, du är privilegierad. Vad kan du göra med den här kunskapen? Du kan utbilda dig liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:21:41",
    "line": "Sen kan vi också komma in på det här att det är inte så att någon ska gå till marginaliserade grupper och be dem fixa det här."
  },
  {
    "speaker": null,
    "timestamp": "00:21:48",
    "line": "För det är de facto att marginaliserade grupper, de tampas med det här varje dag. Det är inte upp till dem att fixa det."
  },
  {
    "speaker": null,
    "timestamp": "00:21:56",
    "line": "Du kan hitta resurser själv, du kan även fråga personer om du har en bra relation med dem och de vill prata om det, att liksom ha diskussioner med dig och så vidare och så vidare."
  },
  {
    "speaker": null,
    "timestamp": "00:22:05",
    "line": "Men det här har vi varit inne på tidigare, men man måste utbilda sig."
  },
  {
    "speaker": null,
    "timestamp": "00:22:09",
    "line": "Jag vet inte hur lång tid framåt det kommer vara acceptabelt och hållbart för någon att säga att \"ja, men jag vet inte det där\" eller \"jag lägger mig inte i det där för det påverkar inte mig\"."
  },
  {
    "speaker": null,
    "timestamp": "00:22:23",
    "line": "Det gör mig arg och det gör mig ledsen att höra det."
  },
  {
    "speaker": null,
    "timestamp": "00:22:28",
    "line": "- Ja, det förstår jag verkligen."
  },
  {
    "speaker": null,
    "timestamp": "00:22:32",
    "line": "Det är ju väldigt lätt, och det var det även för mig innan jag började läsa på lite mer och försöka skaffa mer kunskap genom det,"
  },
  {
    "speaker": null,
    "timestamp": "00:22:44",
    "line": "att det händer någonting, man råkar göra något, man märker att det blir fel."
  },
  {
    "speaker": null,
    "timestamp": "00:22:48",
    "line": "Man går till den personen som blev utsatt och försöker be om ursäkt."
  },
  {
    "speaker": null,
    "timestamp": "00:22:54",
    "line": "Men också \"hur ska jag göra bättre i framtiden?\""
  },
  {
    "speaker": null,
    "timestamp": "00:22:59",
    "line": "Så försöker man hämta informationen från den person som blev utsatt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:03",
    "line": "Då blir det ett övergrepp till."
  },
  {
    "speaker": null,
    "timestamp": "00:23:08",
    "line": "Även om det låter väldigt grovt att säga \"övergrepp\" tycker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:23:11",
    "line": "Men det är lättare egentligen för alla att hitta information."
  },
  {
    "speaker": null,
    "timestamp": "00:23:17",
    "line": "I dag är det inte svårt heller. Läs böcker, googla dig till information."
  },
  {
    "speaker": null,
    "timestamp": "00:23:21",
    "line": "Det finns väldigt mycket bra bloggar. Följ lite folk på Twitter som inte ser ut som det är."
  },
  {
    "speaker": null,
    "timestamp": "00:23:26",
    "line": "Det är en diskussion som ändå sker väldigt öppet idag."
  },
  {
    "speaker": null,
    "timestamp": "00:23:32",
    "line": "Det är inte svårt att hitta den informationen om man bara anstränger sig lite."
  },
  {
    "speaker": null,
    "timestamp": "00:23:36",
    "line": "Det är enklare att gå den vägen än att man ska behöva prata med någon som man har sårat på något vänster."
  },
  {
    "speaker": null,
    "timestamp": "00:23:45",
    "line": "Ja, för att det är också så att många tror att om du frågar en person från en marginaliserad grupp och den har svar på mycket saker så är det som att folk kanske tror att den personen bara föddes med den kunskapen."
  },
  {
    "speaker": null,
    "timestamp": "00:24:05",
    "line": "Och så är det ju absolut inte, utan den personen har ju också behövt lära sig det och ta in den informationen och läsa på om det."
  },
  {
    "speaker": null,
    "timestamp": "00:24:12",
    "line": "Sen kanske det har skett mer av en nödvändighet för att den personen, och jag kan ta mig själv som exempel här,"
  },
  {
    "speaker": null,
    "timestamp": "00:24:20",
    "line": "att jag inte har vetat vissa saker eller förstått vilka gränser som finns eller hur jag inte ska behöva bli behandlad."
  },
  {
    "speaker": null,
    "timestamp": "00:24:29",
    "line": "Att jag inte haft den kunskapen har ju lett till att jag har blivit riktigt dåligt behandlad ur ett strukturellt sätt i många situationer."
  },
  {
    "speaker": null,
    "timestamp": "00:24:39",
    "line": "Så det är klart att det kostar mig mer, men det betyder att jag utöver att uppleva det här har behövt samla in den här informationen och lära mig allt det här för att förstå att jag har rätt att sätta gränser."
  },
  {
    "speaker": null,
    "timestamp": "00:24:53",
    "line": "Jag föddes inte med den. Det tog mig många, många, många, många år och många, många riktigt dåliga händelser för mig att ens komma hit."
  },
  {
    "speaker": null,
    "timestamp": "00:25:02",
    "line": "Så det är inte så att jag fick den här kunskapen gratis på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:08",
    "line": "Och det är samma sak för alla andra."
  },
  {
    "speaker": null,
    "timestamp": "00:25:13",
    "line": "Ja, men precis. Jag förstår verkligen folk som tycker att det är svårt, för det tyckte jag också i början."
  },
  {
    "speaker": null,
    "timestamp": "00:25:25",
    "line": "Och det är fortfarande svårt att prata om ibland. För det är ju ett ganska sårbart ämne."
  },
  {
    "speaker": null,
    "timestamp": "00:25:31",
    "line": "Och det är liksom som att erkänna att man \"Jag kan inte det här\"."
  },
  {
    "speaker": null,
    "timestamp": "00:25:35",
    "line": "Och försöka lära sig, för det handlar ju mycket om att lära sig \"Vad har jag gjort för misstag tidigare?\""
  },
  {
    "speaker": null,
    "timestamp": "00:25:41",
    "line": "ska undvika i framtiden och se vart man befinner sig egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:25:47",
    "line": "Så jag tycker det är sjukt svårt, men det finns inget alternativ riktigt, tycker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:25:53",
    "line": "Vill man inte såra andra människor eller göra dem illa så måste man ju lära sig hur."
  },
  {
    "speaker": null,
    "timestamp": "00:26:02",
    "line": "Det finns ju inget alternativ."
  },
  {
    "speaker": null,
    "timestamp": "00:26:05",
    "line": "- Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:26:07",
    "line": "Jag tycker det är svårt. Och samma sak som du var in på lite tidigare, att det handlar inte heller om de här personerna som är superrasister."
  },
  {
    "speaker": null,
    "timestamp": "00:26:18",
    "line": "Det är inte dem man kanske vill nå ut till. Även om det är klart att de vill vi också förändra, men det handlar mer om den breda grunden på pyramiden som du pratar om."
  },
  {
    "speaker": null,
    "timestamp": "00:26:28",
    "line": "Och samma sak på jobbet, att har man som, det kanske verkar på Paradox eller Activision Blizzard som också varit nyheten nyligen"
  },
  {
    "speaker": null,
    "timestamp": "00:26:37",
    "line": "Alltså det känns ju mer som att det är väldigt få som jobbar där som tillhör toppen av pyramiden"
  },
  {
    "speaker": null,
    "timestamp": "00:26:43",
    "line": "Om ens någon liksom"
  },
  {
    "speaker": null,
    "timestamp": "00:26:45",
    "line": "Utan det handlar ju mer om att det är folk i botten på pyramiden som kanske har det på ett strukturellt plan"
  },
  {
    "speaker": null,
    "timestamp": "00:26:51",
    "line": "inte liksom har så djup kunskap om ämnet och därför liksom gör sexistiska eller"
  },
  {
    "speaker": null,
    "timestamp": "00:26:58",
    "line": "rasistiska eller vad det nu kan vara för handlingar istället för att man vet om"
  },
  {
    "speaker": null,
    "timestamp": "00:27:04",
    "line": "det själv. Och sen som sagt tystnadskulturen som du var inne på också."
  },
  {
    "speaker": null,
    "timestamp": "00:27:06",
    "line": "- Ja. Men en annan sak som jag skulle kanske vilja ta med här då innan vi avrundar"
  },
  {
    "speaker": null,
    "timestamp": "00:27:18",
    "line": "är just den här att vad kan jag göra när någonting händer eller när jag ser någonting liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:27:24",
    "line": "Och då vill jag också säga, och igen jag kan inte prata för alla, men jag tror jag pratar för många,"
  },
  {
    "speaker": null,
    "timestamp": "00:27:31",
    "line": "att det kan hända saker som en person som blir utsatt för ibland bara inte orkar ta."
  },
  {
    "speaker": null,
    "timestamp": "00:27:38",
    "line": "Alltså det är ofta väldigt små saker och det kan vara så att det behöver inte vara så att den personen inte registrerat det."
  },
  {
    "speaker": null,
    "timestamp": "00:27:45",
    "line": "Det kan vara att den personen har registrerat det, utvärderat det, funderat på om fighten är värd att ta och kommit fram till att den inte är det."
  },
  {
    "speaker": null,
    "timestamp": "00:27:52",
    "line": "Dels för att man inte vill bli utmålad på ett visst sätt. Jag har inte tillräckligt mycket energi idag. Jag vill inte just nu."
  },
  {
    "speaker": null,
    "timestamp": "00:27:58",
    "line": "Jag har diskuterat med den här personen för att det funkar inte. Det kan vara en eller en miljon anledningar."
  },
  {
    "speaker": null,
    "timestamp": "00:28:03",
    "line": "Så att personen kanske aktivt väljer att inte ta den fighten för att det kostar dem så otroligt mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:28:09",
    "line": "Och det en mer privilegierad person kan göra då, det är ju att välja att ta fighten från ett personligt perspektiv."
  },
  {
    "speaker": null,
    "timestamp": "00:28:17",
    "line": "Inte att du ska ta fighten för att du ska rädda alla andra, utan det är ju för att du personligen känner att det här inte är någonting du tycker är okej."
  },
  {
    "speaker": null,
    "timestamp": "00:28:30",
    "line": "Lägg aldrig över det på någon annan. Du ska aldrig gå in och säga till exempel så här,"
  },
  {
    "speaker": null,
    "timestamp": "00:28:34",
    "line": "\"Ja, men vi pratade om det här och jag vet att Anton blir ledsen över det, så det ska vi inte prata om.\""
  },
  {
    "speaker": null,
    "timestamp": "00:28:39",
    "line": "Nej, det är fel. För då lägger du igen över ansvaret på den utsatta personen."
  },
  {
    "speaker": null,
    "timestamp": "00:28:44",
    "line": "I sådana fall får du vara så här, \"Vi pratade om det här. Jag tycker inte att det är okej. Jag vill inte att vi gör det,"
  },
  {
    "speaker": null,
    "timestamp": "00:28:51",
    "line": "men utgångsläget är du som person som tar ton.\""
  },
  {
    "speaker": null,
    "timestamp": "00:29:01",
    "line": "Jag tycker det är väldigt viktigt och jag kände att det här blev ett lite mindre peppigt avsnitt så, men jag bara kände att vi behövde prata om det."
  },
  {
    "speaker": null,
    "timestamp": "00:29:12",
    "line": "Ja, men det tycker jag är bra. Jag tycker vi håller en stabil nivå på pepp och depp i vårt avsnitt."
  },
  {
    "speaker": null,
    "timestamp": "00:29:24",
    "line": "Ja, vi måste balansera."
  },
  {
    "speaker": null,
    "timestamp": "00:29:29",
    "line": "Exakt. Har man som vanligt några frågor eller sånt så finns vi på Twitter."
  },
  {
    "speaker": null,
    "timestamp": "00:29:35",
    "line": "Och med det sagt så tackar vi för den här gången så hörs vi om en två veckor igen."
  },
  {
    "speaker": null,
    "timestamp": "00:29:42",
    "line": "Har det."
  },
  {
    "speaker": null,
    "timestamp": "00:29:44",
    "line": "Säg så. Bye bye."
  },
  {
    "speaker": null,
    "timestamp": "00:29:46",
    "line": "Hej då."
  },
  {
    "speaker": null,
    "timestamp": "00:29:48",
    "line": "[Outromusik]"
  },
  {
    "speaker": null,
    "timestamp": "00:29:55",
    "line": "[Text]"
  }
]