[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Varför hatar jag skriptutvecklare julen?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:03",
    "line": "- Jag vet inte. - De får så många onödiga paket."
  },
  {
    "speaker": null,
    "timestamp": "00:00:08",
    "line": "- Det här var kul på riktigt. - Det har du sagt om alla skriptor."
  },
  {
    "speaker": null,
    "timestamp": "00:00:16",
    "line": "- Du har sagt att nivån har sjunkit."
  },
  {
    "speaker": null,
    "timestamp": "00:00:19",
    "line": "Och jag är väldigt inne på att nivån har höjts."
  },
  {
    "speaker": null,
    "timestamp": "00:00:23",
    "line": "- Jag har liksom..."
  },
  {
    "speaker": null,
    "timestamp": "00:00:25",
    "line": "Jag har ju räddat mig själv i sista sekund."
  },
  {
    "speaker": null,
    "timestamp": "00:00:29",
    "line": "Men om det kommer en period där jag inte kan rädda mig själv av ett skämt som jag drömde fram, då kommer nivån störtdyka."
  },
  {
    "speaker": null,
    "timestamp": "00:00:39",
    "line": "- Jag är imponerad. Jag tycker det var 5+. 5+ var det. Det här är ett skämt som jag kommer att sno själv om en enda gång."
  },
  {
    "speaker": null,
    "timestamp": "00:00:51",
    "line": "Men ja, hej och välkomna till ett nytt avsnitt av ASDF."
  },
  {
    "speaker": null,
    "timestamp": "00:00:55",
    "line": "Så här är det va, att när jag funderar lite på det här skämtet,"
  },
  {
    "speaker": null,
    "timestamp": "00:01:00",
    "line": "eller på alla skämt, då funderar jag lite på vad jag ska ha för"
  },
  {
    "speaker": null,
    "timestamp": "00:01:03",
    "line": "utvecklad roll, eller för roll, som ska vara vissa grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:01:08",
    "line": "Och det får man ju tänka på liksom,"
  },
  {
    "speaker": null,
    "timestamp": "00:01:10",
    "line": "hur presenterar du dig?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:14",
    "line": "Vad tycker du att du har för yrkestitel?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:18",
    "line": "Alltså tittar man på min LinkedIn så står det ju webbutvecklare tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:01:22",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:01:24",
    "line": "Det är den titeln jag har."
  },
  {
    "speaker": null,
    "timestamp": "00:01:27",
    "line": "Sen tittar man på liksom, nu på mitt uppdrag till exempel hos min kund så är jag ju Scrum Master också."
  },
  {
    "speaker": null,
    "timestamp": "00:01:33",
    "line": "Det är 50%."
  },
  {
    "speaker": null,
    "timestamp": "00:01:35",
    "line": "Men jag höll på att säga att det skryter man inte med."
  },
  {
    "speaker": null,
    "timestamp": "00:01:39",
    "line": "Men det var lite negativt att säga Scrum Masters."
  },
  {
    "speaker": null,
    "timestamp": "00:01:42",
    "line": "Men jag menar så här, för mig är jag liksom kanske i grunden en webbutvecklare."
  },
  {
    "speaker": null,
    "timestamp": "00:01:47",
    "line": "Men det är liksom en epitet eller en titel som du har valt själv, det är den du känner dig bekväm med?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:54",
    "line": "Ja, jag kanske inte har lagt så mycket tankekraft bakom den."
  },
  {
    "speaker": null,
    "timestamp": "00:01:58",
    "line": "Det finns ju många alternativ, eller kanske som webbdeveloper faktiskt, men jag tänker att det är översatt till webbutvecklare."
  },
  {
    "speaker": null,
    "timestamp": "00:02:05",
    "line": "Men det finns ju liksom så här, webbengineer skulle jag kanske aldrig kalla mig själv."
  },
  {
    "speaker": null,
    "timestamp": "00:02:10",
    "line": "Eller system developer, eller något sånt där. För det känns som att det är lite för brett kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:02:18",
    "line": "Och engineer känns också som att det är svårt att spesa exakt vad en engineer gör."
  },
  {
    "speaker": null,
    "timestamp": "00:02:26",
    "line": "För min del, jag har inte gått en ingenjörsutbildning, vilket många kanske använder som spes på vad man ska säga att man är det."
  },
  {
    "speaker": null,
    "timestamp": "00:02:35",
    "line": "Men samtidigt så är det ju liksom så här, man kan ju vara en, jag skulle inte ta, jag skulle inte tycka att det är konstigt om någon kallar sig för webbengineer eller webbdeveloper ingenjör utan har gått en ingenjörsutbildning för att det handlar mer om vad man har gjort och vem man är och sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:02:53",
    "line": "Ja, det där är lite intressant för jag har ju gått en ingenjörsutbildning."
  },
  {
    "speaker": null,
    "timestamp": "00:02:58",
    "line": "Tog inte själva ingenjörsexamen då, men ändå en examen."
  },
  {
    "speaker": null,
    "timestamp": "00:03:04",
    "line": "Jag är också med i Sveriges ingenjörer, men jag vill ju absolut inte ha titeln engineer."
  },
  {
    "speaker": null,
    "timestamp": "00:03:10",
    "line": "För att jag bara känner, det känns tokfel."
  },
  {
    "speaker": null,
    "timestamp": "00:03:14",
    "line": "Den har jag haft några gånger för att man kommer in på ett bolag och så har de den titeln på sina utvecklare typ."
  },
  {
    "speaker": null,
    "timestamp": "00:03:22",
    "line": "Men jag tycker det känns fel. Det känns som att jag borde bygga en bro då liksom och det gör jag inte."
  },
  {
    "speaker": null,
    "timestamp": "00:03:30",
    "line": "- Nej, jag vet inte. Jag tror att vi pratade om det här i något tidigare avsnitt, eventuellt att det smet in någon länklista."
  },
  {
    "speaker": null,
    "timestamp": "00:03:36",
    "line": "Men det är en person som heter Hilla Elwayne, om jag minns rätt, har typ intervjuat, jag håller på att säga riktiga ingenjörer nu."
  },
  {
    "speaker": null,
    "timestamp": "00:03:45",
    "line": "bioingenjörer och mekanikingenjörer och sådana saker"
  },
  {
    "speaker": null,
    "timestamp": "00:03:52",
    "line": "och försökt hitta vad är det vi har gemensamt som programmeringsingenjörer"
  },
  {
    "speaker": null,
    "timestamp": "00:04:02",
    "line": "med andra ingenjörsyrken"
  },
  {
    "speaker": null,
    "timestamp": "00:04:04",
    "line": "eller vad är det vi har gemensamt och vad är det vi inte har gemensamt"
  },
  {
    "speaker": null,
    "timestamp": "00:04:07",
    "line": "och skrev typ en fyra-dels-serie på det här som jag tyckte var svinintressant"
  },
  {
    "speaker": null,
    "timestamp": "00:04:11",
    "line": "Kan varmt rekommendera att läsa den"
  },
  {
    "speaker": null,
    "timestamp": "00:04:13",
    "line": "Det han kommer fram till är väl kanske att vi har mer gemensamt än vad de flesta tror."
  },
  {
    "speaker": null,
    "timestamp": "00:04:19",
    "line": "Ja, det har du nämnt."
  },
  {
    "speaker": null,
    "timestamp": "00:04:24",
    "line": "Men för att jag tänker på, för att jag på engelska brukar väl kalla mig för, om det är kort så brukar jag säga \"developer\"."
  },
  {
    "speaker": null,
    "timestamp": "00:04:35",
    "line": "Vilket kan ibland ramla över på att du är en \"Developer som bygger hus\" eller vad det är de gör."
  },
  {
    "speaker": null,
    "timestamp": "00:04:44",
    "line": "\"City Developer\" och grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:04:47",
    "line": "Men jag är också svårt för att lägga till \"Software Developer\""
  },
  {
    "speaker": null,
    "timestamp": "00:04:52",
    "line": "för det tycker jag låter lite stuffigt."
  },
  {
    "speaker": null,
    "timestamp": "00:04:54",
    "line": "Men det kanske bara är jag som har fördomar mot den titeln själv förr i tiden."
  },
  {
    "speaker": null,
    "timestamp": "00:05:02",
    "line": "Ja, så skulle det väl kunna vara, tänker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:05:06",
    "line": "Jag tror att det är ganska svårt, för många lägger in väldigt mycket egen värdering i alla titlar."
  },
  {
    "speaker": null,
    "timestamp": "00:05:11",
    "line": "Typ \"software developer\", som du säger, eller om man ska vara en \"web-developer\" eller bara \"developer\""
  },
  {
    "speaker": null,
    "timestamp": "00:05:16",
    "line": "eller \"full stack developer\", \"frontend developer\", \"backend developer\""
  },
  {
    "speaker": null,
    "timestamp": "00:05:20",
    "line": "Alltså det finns ju en miljard jävla titlar man kan sätta på sig själv, eller andra."
  },
  {
    "speaker": null,
    "timestamp": "00:05:27",
    "line": "Och jag tror också som du säger att det är vissa som man kan identifiera sig mer med och vissa mindre."
  },
  {
    "speaker": null,
    "timestamp": "00:05:33",
    "line": "Ja, för att alltså jag har ju, fan vad jag har hållit på med det här. Jag vet inte varför jag tror det har varit så här."
  },
  {
    "speaker": null,
    "timestamp": "00:05:38",
    "line": "Att jag vill inte ha en titel som lovar för mycket typ. Så att jag har ju gått fram och tillbaka så extremt mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:05:48",
    "line": "Jag har ju gått från fullstärkt developer till frontend developer till..."
  },
  {
    "speaker": null,
    "timestamp": "00:05:52",
    "line": "Nu kör jag mest på Web Developer för jag tyckte det var kortare att skriva det än typ."
  },
  {
    "speaker": null,
    "timestamp": "00:05:58",
    "line": "\"Developer with a functional frontend focus that also dabbles a bit with backend"
  },
  {
    "speaker": null,
    "timestamp": "00:06:05",
    "line": "but is not really good at backend but is not afraid of doing backend.\""
  },
  {
    "speaker": null,
    "timestamp": "00:06:11",
    "line": "Ja, det känns som att du kortar ner eller breddar din titel ganska mycket, mer och mer."
  },
  {
    "speaker": null,
    "timestamp": "00:06:17",
    "line": "Snart kommer det vara \"Developer\" som de är inne på, eller så blir det bara \"Dev\" som småningom."
  },
  {
    "speaker": null,
    "timestamp": "00:06:22",
    "line": "Och sen blir det ingen titel, alls."
  },
  {
    "speaker": null,
    "timestamp": "00:06:24",
    "line": "Nej, så lite som möjligt helst."
  },
  {
    "speaker": null,
    "timestamp": "00:06:27",
    "line": "Jag är inte ens utvecklare, jag bara är."
  },
  {
    "speaker": null,
    "timestamp": "00:06:30",
    "line": "Exakt, du arbetar."
  },
  {
    "speaker": null,
    "timestamp": "00:06:32",
    "line": "I'm a worker."
  },
  {
    "speaker": null,
    "timestamp": "00:06:34",
    "line": "Exakt, det är din titel."
  },
  {
    "speaker": null,
    "timestamp": "00:06:36",
    "line": "Men vad har du för titel? Skulle du sätta på en titel för dig själv nu? Är det \"Web Developer\"?"
  },
  {
    "speaker": null,
    "timestamp": "00:06:41",
    "line": "Ja, det är det väl."
  },
  {
    "speaker": null,
    "timestamp": "00:06:44",
    "line": "Jag har svårt att se vart den gränsen går också."
  },
  {
    "speaker": null,
    "timestamp": "00:06:52",
    "line": "För vissa när man säger webb-developer verkar tycka att då handlar det bara om fronten."
  },
  {
    "speaker": null,
    "timestamp": "00:06:57",
    "line": "För att du skulle inte tänka dig att bygga bara API-er."
  },
  {
    "speaker": null,
    "timestamp": "00:07:00",
    "line": "Men i min hjärna, allting är ju på webben nu."
  },
  {
    "speaker": null,
    "timestamp": "00:07:02",
    "line": "Och det är väl kanske därför jag också tycker att software-developer känns fel."
  },
  {
    "speaker": null,
    "timestamp": "00:07:06",
    "line": "För det är så brett nu."
  },
  {
    "speaker": null,
    "timestamp": "00:07:07",
    "line": "Förr var det mer tydligt, men nu är ju allting mjukvara."
  },
  {
    "speaker": null,
    "timestamp": "00:07:11",
    "line": "Allting, överallt och hela tiden."
  },
  {
    "speaker": null,
    "timestamp": "00:07:13",
    "line": "Det blir lite intetsägande att säga software-developer, men på samma sätt tycker jag att webb-developer är så svårdefinierbart också."
  },
  {
    "speaker": null,
    "timestamp": "00:07:22",
    "line": "Vi har varit inne på de här sakerna lite grann tidigare också, vart drar man gränserna för gränssnittsutvecklare, frontend-utvecklare och de här grejerna."
  },
  {
    "speaker": null,
    "timestamp": "00:07:29",
    "line": "Men jag är väl mera, om man bara tittar på det rent titelmässigt nu, så är jag väl fast i den här att jag vet inte vad jag är och jag vill inte lova för mycket med min titel."
  },
  {
    "speaker": null,
    "timestamp": "00:07:40",
    "line": "Vi pratade om det i något avsnitt runt avsnitt 30, kanske om front of the front end och back of the front end."
  },
  {
    "speaker": null,
    "timestamp": "00:07:47",
    "line": "Den kan vi länka till om man har missat det."
  },
  {
    "speaker": null,
    "timestamp": "00:07:50",
    "line": "Men du skulle aldrig, som det låter, sätta \"senior web developer\"?"
  },
  {
    "speaker": null,
    "timestamp": "00:07:57",
    "line": "Nej, det skulle jag aldrig göra självmående."
  },
  {
    "speaker": null,
    "timestamp": "00:08:01",
    "line": "Om någon tvingar dig, skriker högt?"
  },
  {
    "speaker": null,
    "timestamp": "00:08:05",
    "line": "Nej men alltså de, alltså det epitetet sätts väl ibland när det ska säljas och vad det ska göras."
  },
  {
    "speaker": null,
    "timestamp": "00:08:13",
    "line": "Eller när folk, alltså det finns ju även rekryterare som har haft det ibland."
  },
  {
    "speaker": null,
    "timestamp": "00:08:19",
    "line": "\"Bara jag letar efter en senior till det här, lalalala\""
  },
  {
    "speaker": null,
    "timestamp": "00:08:22",
    "line": "Och jag vet inte, jag menar, vart drar man gränsen för det?"
  },
  {
    "speaker": null,
    "timestamp": "00:08:26",
    "line": "Vad är en seniorutvecklare ens? Alltså vad är, vad är,"
  },
  {
    "speaker": null,
    "timestamp": "00:08:30",
    "line": "Det är ju junior förr."
  },
  {
    "speaker": null,
    "timestamp": "00:08:32",
    "line": "Men det är väl för att jag är extremt mycket bättre på att nedvärdera mig än att höja mig själv."
  },
  {
    "speaker": null,
    "timestamp": "00:08:36",
    "line": "Men det kändes ändå väldigt tydligt. Jag är ny i branschen och jag vet vart det går."
  },
  {
    "speaker": null,
    "timestamp": "00:08:40",
    "line": "Men vad är en senior?"
  },
  {
    "speaker": null,
    "timestamp": "00:08:44",
    "line": "Ja, verkligen."
  },
  {
    "speaker": null,
    "timestamp": "00:08:46",
    "line": "Jag har ju relativt starka åsikter om just titlarna senior och junior."
  },
  {
    "speaker": null,
    "timestamp": "00:08:53",
    "line": "Och just på grund av det du är inne på, vart går gränsen?"
  },
  {
    "speaker": null,
    "timestamp": "00:08:58",
    "line": "Alltså, det man vill att det ska handla om är typ erfarenhet"
  },
  {
    "speaker": null,
    "timestamp": "00:09:03",
    "line": "Men det det egentligen handlar om oftast är tid"
  },
  {
    "speaker": null,
    "timestamp": "00:09:06",
    "line": "Och de blandas ihop ganska ofta, alltså erfarenhet och tid"
  },
  {
    "speaker": null,
    "timestamp": "00:09:11",
    "line": "Att de är ett 1 till 1 förhållande så att säga"
  },
  {
    "speaker": null,
    "timestamp": "00:09:15",
    "line": "Medans i verkligheten ser det ytterst sällan ut så"
  },
  {
    "speaker": null,
    "timestamp": "00:09:19",
    "line": "Alltså en person kan ha suttit och gjort exakt samma sak"
  },
  {
    "speaker": null,
    "timestamp": "00:09:25",
    "line": "Och om och om igen, säkert på ett jättebra sätt, men gjort exakt samma sak om och om igen."
  },
  {
    "speaker": null,
    "timestamp": "00:09:29",
    "line": "Verkligen suttit inom sin bubbla och lärt sig just den lilla biten i jättemånga år."
  },
  {
    "speaker": null,
    "timestamp": "00:09:37",
    "line": "Samtidigt som en annan person kan ha suttit ett år och gjort extremt mycket saker."
  },
  {
    "speaker": null,
    "timestamp": "00:09:41",
    "line": "Blivit utmanade i vad de måste göra och vad de kan."
  },
  {
    "speaker": null,
    "timestamp": "00:09:45",
    "line": "Och lärt sig extremt mycket på det sättet."
  },
  {
    "speaker": null,
    "timestamp": "00:09:48",
    "line": "Och på det sättet kan den personen då vara senior inom något område."
  },
  {
    "speaker": null,
    "timestamp": "00:09:53",
    "line": "medan den andra personen kanske är junior om man ska använda de begreppen."
  },
  {
    "speaker": null,
    "timestamp": "00:09:55",
    "line": "- Ja, men jag tycker inte att man helt kan utesluta tid heller när man pratar om det begreppet egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:10:05",
    "line": "För jag kan ju tycka att många, även om jag inte riktigt kan säga vad gränserna går,"
  },
  {
    "speaker": null,
    "timestamp": "00:10:11",
    "line": "men jag tycker att många kanske börjar kalla sig för senior väldigt tidigt."
  },
  {
    "speaker": null,
    "timestamp": "00:10:15",
    "line": "Alltså på ett sätt inte då att de inte kan vara väldigt kunniga inom vissa områden."
  },
  {
    "speaker": null,
    "timestamp": "00:10:21",
    "line": "Men jag, för min del, är det liksom att det måste till erfarenhet också."
  },
  {
    "speaker": null,
    "timestamp": "00:10:28",
    "line": "Att det är det som gör en senior. Inte bara kring specifika tekniska aspekter,"
  },
  {
    "speaker": null,
    "timestamp": "00:10:34",
    "line": "men att du blir jättebra på någonting på ett år, det är ju toppen."
  },
  {
    "speaker": null,
    "timestamp": "00:10:37",
    "line": "Men det kanske tillkommer så mycket annat som är sociala biten i rollen,"
  },
  {
    "speaker": null,
    "timestamp": "00:10:42",
    "line": "eller vad man har för erfarenhet kring produktutveckling,"
  },
  {
    "speaker": null,
    "timestamp": "00:10:46",
    "line": "eller bolagsdelarna och roadmaps, budgetering, snacka med stakeholders, vad vet jag."
  },
  {
    "speaker": null,
    "timestamp": "00:10:53",
    "line": "Så jag tycker att det är en mer väl rundad sak som måste till."
  },
  {
    "speaker": null,
    "timestamp": "00:10:58",
    "line": "Och den tror jag är svårt att få om det inte har gått i viss tid."
  },
  {
    "speaker": null,
    "timestamp": "00:11:03",
    "line": "Jag håller med dig till viss del i alla fall."
  },
  {
    "speaker": null,
    "timestamp": "00:11:06",
    "line": "Jag tror också att, om vi jämför de här två hypotetiska personerna,"
  },
  {
    "speaker": null,
    "timestamp": "00:11:11",
    "line": "en person som har jobbat i fem eller tio år och en person som har jobbat i ett år,"
  },
  {
    "speaker": null,
    "timestamp": "00:11:16",
    "line": "så är det naturligt att den personen som har jobbat längre förmodligen har upplevt mer."
  },
  {
    "speaker": null,
    "timestamp": "00:11:21",
    "line": "Särskilt om man pratar konsulter, för då har man förmodligen varit på flera olika uppdrag"
  },
  {
    "speaker": null,
    "timestamp": "00:11:26",
    "line": "hos flera olika kunder. Man ser väldigt mycket olika saker, man får lite perspektiv på hur andra vill jobba med saker."
  },
  {
    "speaker": null,
    "timestamp": "00:11:34",
    "line": "Man får olika tillvägagångssätt och man upplever dem."
  },
  {
    "speaker": null,
    "timestamp": "00:11:37",
    "line": "Jag håller med dig i den biten att tid borde spela in i den här formen på hur man räknar ut hur erfaren man är."
  },
  {
    "speaker": null,
    "timestamp": "00:11:47",
    "line": "Men jag tycker det är oftare åt andra hållet att man struntar i de som inte har så mycket erfarenhet"
  },
  {
    "speaker": null,
    "timestamp": "00:11:56",
    "line": "men ändå har varit med. Och då pratar jag inte bara tekniska saker utan jag pratar även typ att"
  },
  {
    "speaker": null,
    "timestamp": "00:12:01",
    "line": "Du kan ha kommit in på ett uppdrag eller på ett jobb och fått hoppa rakt ner i poolen"
  },
  {
    "speaker": null,
    "timestamp": "00:12:10",
    "line": "Du får inte sätta på dig några armpuffar för att kunna flyta utan det är bara ner och lära dig simma direkt"
  },
  {
    "speaker": null,
    "timestamp": "00:12:17",
    "line": "Och även om det kanske inte är det vettigaste sättet att lära sig på så är det ju ofta så man gör det"
  },
  {
    "speaker": null,
    "timestamp": "00:12:23",
    "line": "Alltså att du hamnar i en situation där du måste lära dig saker"
  },
  {
    "speaker": null,
    "timestamp": "00:12:26",
    "line": "Och då kan det vara att man får ansvaret för den här produkten och då måste du lära dig massor av saker om hur det funkar kring produktutvecklingen till exempel"
  },
  {
    "speaker": null,
    "timestamp": "00:12:34",
    "line": "Eller hur teamet funkar eller vad det kan vara"
  },
  {
    "speaker": null,
    "timestamp": "00:12:36",
    "line": "Och då jämfört med en annan person som kan ha suttit väldigt still på sin kammare och bara skrivit kod under en längre tid"
  },
  {
    "speaker": null,
    "timestamp": "00:12:44",
    "line": "Även om den här personen kanske har plockat upp lite grann så har man inte fått den praktiska erfarenheten"
  },
  {
    "speaker": null,
    "timestamp": "00:12:48",
    "line": "Så därför tycker jag att det här med tid har lite för stort fokus kanske, mer än att det inte ska vara med överhuvudtaget"
  },
  {
    "speaker": null,
    "timestamp": "00:12:55",
    "line": "Jag håller med dig där. Jag tycker att det finns en minimigräns mer än en gräns där det är tydligt att har det gått så här lång tid så är du senior."
  },
  {
    "speaker": null,
    "timestamp": "00:13:09",
    "line": "För det är inte sant. Men har det gått ett halvår, ett år så kanske det inte har gått tillräckligt lång tid för att du ens haft chans att samla på dig den erfarenhet som behövs."
  },
  {
    "speaker": null,
    "timestamp": "00:13:20",
    "line": "Jag vet inte, det kan ju också vara så att jag skjuter på den här titeln när man sätter den längre och längre för att jag själv inte vill ha den på mig."
  },
  {
    "speaker": null,
    "timestamp": "00:13:29",
    "line": "Och det går för mer tid så jag måste skjuta den framför mig."
  },
  {
    "speaker": null,
    "timestamp": "00:13:33",
    "line": "Men du har ändå jobbat i sex år nu typ, du borde vara senior."
  },
  {
    "speaker": null,
    "timestamp": "00:13:38",
    "line": "Ja exakt, men eftersom tid bara inte räknas så, så är det lugnt."
  },
  {
    "speaker": null,
    "timestamp": "00:13:44",
    "line": "Nej, men jag förstår vad du menar."
  },
  {
    "speaker": null,
    "timestamp": "00:13:47",
    "line": "Men för mig så tycker jag att det faller på just begreppen kanske senior och junior."
  },
  {
    "speaker": null,
    "timestamp": "00:13:53",
    "line": "För att de har blivit så liksom värdeladdade med att det handlar väldigt mycket om tid egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:14:02",
    "line": "Alltså jag kan hålla med dig om att om vi ska ha junior och senior så tycker jag att folk blir seniora för tidigt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:09",
    "line": "Men jag tycker att de begreppen inte riktigt räcker till för att man ska kunna prata om hur erfarna folk är"
  },
  {
    "speaker": null,
    "timestamp": "00:14:17",
    "line": "Så att om någon säger \"han är en seniorutvecklare\" det säger mig ingenting"
  },
  {
    "speaker": null,
    "timestamp": "00:14:21",
    "line": "Det kan säga mig att han har jobbat i något år, men det betyder ingenting av hur många saker han har lärt sig"
  },
  {
    "speaker": null,
    "timestamp": "00:14:28",
    "line": "Eller vilka kontexter han har varit i, eller vad han kan egentligen"
  },
  {
    "speaker": null,
    "timestamp": "00:14:32",
    "line": "Och det är därför jag tycker att de är så dåliga."
  },
  {
    "speaker": null,
    "timestamp": "00:14:37",
    "line": "Visst att man ska räkna med att det finns en kontext runt omkring varje gång"
  },
  {
    "speaker": null,
    "timestamp": "00:14:41",
    "line": "Att man ska kanske prata om att \"ja men det här är en seniorutvecklare med fyra års erfarenhet\""
  },
  {
    "speaker": null,
    "timestamp": "00:14:45",
    "line": "\"har gjort de här sakerna\" bla bla bla"
  },
  {
    "speaker": null,
    "timestamp": "00:14:48",
    "line": "Problemet för mig är väl att den ofta saknas när det dyker upp"
  },
  {
    "speaker": null,
    "timestamp": "00:14:52",
    "line": "Alltså är det annonser till exempel för seniora utvecklare"
  },
  {
    "speaker": null,
    "timestamp": "00:14:56",
    "line": "Då står det bara \"ja men du ska ha jobbat så här många år\""
  },
  {
    "speaker": null,
    "timestamp": "00:14:59",
    "line": "\"Jaha, men det betyder ju ingenting. Det är ju skitsamma hur många år man har jobbat egentligen.\""
  },
  {
    "speaker": null,
    "timestamp": "00:15:05",
    "line": "Jag håller med dig egentligen. Jag tycker senior är ett helt värdelöst begrepp."
  },
  {
    "speaker": null,
    "timestamp": "00:15:11",
    "line": "För att det är också så här, \"Ja, du har jobbat så här många år, som du säger, det säger ingenting. Det beror helt på vad man har jobbat med.\""
  },
  {
    "speaker": null,
    "timestamp": "00:15:18",
    "line": "men också, du kan de här teknikerna, ja okej, jag kanske kan de teknikerna men hur applicerar jag det i mitt arbete?"
  },
  {
    "speaker": null,
    "timestamp": "00:15:28",
    "line": "Och vad har jag för erfarenhet kring att jobba i team och bygga en produkt?"
  },
  {
    "speaker": null,
    "timestamp": "00:15:33",
    "line": "Det är så många aspekter, det är mycket mer välrundat än vad som går att beskriva med så här, kan du det här så är det lugnt, det funkar ju inte så."
  },
  {
    "speaker": null,
    "timestamp": "00:15:46",
    "line": "Men om man ska bortse ifrån, för att jag tycker senior tycker jag är svårt."
  },
  {
    "speaker": null,
    "timestamp": "00:15:51",
    "line": "Junior är svårt, absolut. Men där tycker jag ändå att det finns en poäng."
  },
  {
    "speaker": null,
    "timestamp": "00:15:58",
    "line": "För att när jag började, då var jag väldigt ängslig. Jag menar jag är alltid ängslig."
  },
  {
    "speaker": null,
    "timestamp": "00:16:05",
    "line": "Men då var jag väldigt ängslig."
  },
  {
    "speaker": null,
    "timestamp": "00:16:07",
    "line": "Och där tror jag att jag såg junior som ändå någon typ av skydd."
  },
  {
    "speaker": null,
    "timestamp": "00:16:15",
    "line": "Jag kan inte det här än. Jag är anställd som junior så kraven kan inte vara skyhöga på mig."
  },
  {
    "speaker": null,
    "timestamp": "00:16:23",
    "line": "För jag måste få lite spelrum att utvecklas, ta in information och lära mig nya saker."
  },
  {
    "speaker": null,
    "timestamp": "00:16:30",
    "line": "Vilket jag tänkte då i alla fall att det framför min titel skulle hjälpa mig att få förståelse kring."
  },
  {
    "speaker": null,
    "timestamp": "00:16:41",
    "line": "Ja, men det kan jag förstå ändå. Jag tror också att junior kanske inte är lika problematiskt som jag tycker senior kan vara."
  },
  {
    "speaker": null,
    "timestamp": "00:16:56",
    "line": "Och ser ju också definitivt ett värde i det. Samtidigt så finns det ju också en risk att man istället undervärderar sig själv."
  },
  {
    "speaker": null,
    "timestamp": "00:17:03",
    "line": "Som du kanske fortfarande gör."
  },
  {
    "speaker": null,
    "timestamp": "00:17:06",
    "line": "Men där man ändå måste känna att om jag hamnar i en juniorroll då visst att man kanske slipper vissa förväntningar."
  },
  {
    "speaker": null,
    "timestamp": "00:17:16",
    "line": "Men det kan ju också vara att man har tillräckligt mycket erfarenhet för att inte vara en junior och då ändå sitter fast där inom situationsstecken."
  },
  {
    "speaker": null,
    "timestamp": "00:17:26",
    "line": "Så jag tror att det finns både plus och minus med det, vilket kanske är självklart."
  },
  {
    "speaker": null,
    "timestamp": "00:17:34",
    "line": "Ja, och sen om man ska vara sådant så är det väl säkert ofta en potentiellt så att det finns vissa könsskillnader också i vad man sätter för titel."
  },
  {
    "speaker": null,
    "timestamp": "00:17:58",
    "line": "Jag kommer ihåg att jag hade en chef som faktiskt tog upp mig som ett exempel i ett snack hon höll på en konferens."
  },
  {
    "speaker": null,
    "timestamp": "00:18:06",
    "line": "Vi tog in tre stycken utvecklare till vårt program och så gick jag in på deras LinkedIn."
  },
  {
    "speaker": null,
    "timestamp": "00:18:15",
    "line": "Det var en person som var den som vi tog in först och som gjorde bäst ifrån sig på test och så vidare."
  },
  {
    "speaker": null,
    "timestamp": "00:18:22",
    "line": "Går in på den personen så länkte in junior fullstärkt utvecklare."
  },
  {
    "speaker": null,
    "timestamp": "00:18:26",
    "line": "Går in på de andra två personerna så länkte in fullstärkt utvecklare."
  },
  {
    "speaker": null,
    "timestamp": "00:18:30",
    "line": "Typ första månaden."
  },
  {
    "speaker": null,
    "timestamp": "00:18:32",
    "line": "Och kan ni gissa, om jag säger att det var två män och en kvinna, kan ni gissa vem som var vän?"
  },
  {
    "speaker": null,
    "timestamp": "00:18:38",
    "line": "Så jag blev liksom en så här färdigt exempel i en snack."
  },
  {
    "speaker": null,
    "timestamp": "00:18:44",
    "line": "Och jag tror att det finns väl också, som du säger, risken att nedvärdera sig."
  },
  {
    "speaker": null,
    "timestamp": "00:18:49",
    "line": "är väl kanske viktad mer åt det ena hållet?"
  },
  {
    "speaker": null,
    "timestamp": "00:18:55",
    "line": "Ja, definitivt. Och ett annat perspektiv som jag tycker är jätteviktigt på det här, särskilt kanske för det jag säger, är ju också att"
  },
  {
    "speaker": null,
    "timestamp": "00:19:03",
    "line": "min titel spelar inte jättestor roll för mig, så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:19:09",
    "line": "Medan det för andra skulle kunna spela väldigt stor roll i att ge dem en naturlig auktoritet."
  },
  {
    "speaker": null,
    "timestamp": "00:19:17",
    "line": "Alltså att man kan luta sig tillbaka på sin titel för att få auktoriteten"
  },
  {
    "speaker": null,
    "timestamp": "00:19:21",
    "line": "Medan för mig så kan det vara så att jag har ett visst förtroende och kan prata utifrån det"
  },
  {
    "speaker": null,
    "timestamp": "00:19:27",
    "line": "Men också att jag är man och vit och ser ut som alla andra utvecklare"
  },
  {
    "speaker": null,
    "timestamp": "00:19:33",
    "line": "Gör ju att folk har enklare att lyssna på mig"
  },
  {
    "speaker": null,
    "timestamp": "00:19:36",
    "line": "Medan om vi ska ta kvinnor som exempel"
  },
  {
    "speaker": null,
    "timestamp": "00:19:39",
    "line": "Eller om vi ska ta för svarta för att inte nöta ut kvinnotropen"
  },
  {
    "speaker": null,
    "timestamp": "00:19:44",
    "line": "Så kan det vara enklare för svarta att få förtroendet om de kan visa att de har en officiell titel som är seniorarkitekt, seniorutvecklare eller vad det nu kan vara."
  },
  {
    "speaker": null,
    "timestamp": "00:19:56",
    "line": "Det är ett perspektiv som jag inte har haft jättelänge men som jag tycker är jätteviktigt att man ändå tar med sig när man pratar om det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:05",
    "line": "Jag är kanske inte den som bryr mig mest om titlar och inte bryr mig mest om karriär."
  },
  {
    "speaker": null,
    "timestamp": "00:20:12",
    "line": "Men jag kan ju verkligen förstå att om man kommer från ett sådant perspektiv att det kan vara viktigare för de personerna."
  },
  {
    "speaker": null,
    "timestamp": "00:20:19",
    "line": "Ja, det förstår jag absolut. Mandatet. Speciellt om de ska gå in och verkligen ta och fatta. Var beslutsfattare."
  },
  {
    "speaker": null,
    "timestamp": "00:20:29",
    "line": "Men jag tycker också en väldigt viktig sak när man pratar om titlar på papper."
  },
  {
    "speaker": null,
    "timestamp": "00:20:34",
    "line": "Och då menar jag liksom, vad är du anställd som? Och sådana bitar."
  },
  {
    "speaker": null,
    "timestamp": "00:20:37",
    "line": "Det tycker jag också blir så himla viktigt, för jag är så här..."
  },
  {
    "speaker": null,
    "timestamp": "00:20:40",
    "line": "Ja men till exempel som när jag var juniorutvecklare."
  },
  {
    "speaker": null,
    "timestamp": "00:20:43",
    "line": "Då är jag så här, men då ska inte jag ha jour."
  },
  {
    "speaker": null,
    "timestamp": "00:20:46",
    "line": "För ska jag ha jour, då ska jag ha lön för att ha jour."
  },
  {
    "speaker": null,
    "timestamp": "00:20:48",
    "line": "Och på pappret fick juniorutvecklare inte ha det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:51",
    "line": "Och då är jag så här, då tänker jag inte göra det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:53",
    "line": "- Nej, precis."
  },
  {
    "speaker": null,
    "timestamp": "00:20:55",
    "line": "Du ska inte göra mer heller än vad du får betalt för."
  },
  {
    "speaker": null,
    "timestamp": "00:21:02",
    "line": "Då ska det vara på papper också. Jag tänker inte jobba gratis bara för att jag vill vara duktig."
  },
  {
    "speaker": null,
    "timestamp": "00:21:09",
    "line": "Det är klart jag har gjort det, men i teorin så ska det inte vara så."
  },
  {
    "speaker": null,
    "timestamp": "00:21:15",
    "line": "På det sättet tycker jag titlar också blir väldigt viktiga."
  },
  {
    "speaker": null,
    "timestamp": "00:21:18",
    "line": "Vad förväntas på dig?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:21",
    "line": "- Ja, det håller jag verkligen med om."
  },
  {
    "speaker": null,
    "timestamp": "00:21:23",
    "line": "Och om vi ska snurra tillbaka till det här med senior i nionor."
  },
  {
    "speaker": null,
    "timestamp": "00:21:28",
    "line": "För nu har jag varit väldigt så här \"Äh, men säg inte senior\" för att det suger."
  },
  {
    "speaker": null,
    "timestamp": "00:21:31",
    "line": "Men jag har inte levererat så mycket läsningar."
  },
  {
    "speaker": null,
    "timestamp": "00:21:33",
    "line": "Men jag tror att oavsett om man säger senior eller inte så tror jag att det viktigaste kanske är att man kommunicerar det med den här kontexten runt omkring."
  },
  {
    "speaker": null,
    "timestamp": "00:21:42",
    "line": "Alltså det vill säga, vi pratar om en person med tre års erfarenhet inom mjukvårdutveckling men som samtidigt har jobbat med produktutveckling och varit en team lead."
  },
  {
    "speaker": null,
    "timestamp": "00:21:54",
    "line": "Och visst, kollar man på ett CV så finns det oftast den kontexten, men när man bara pratar om det så är det svårt att säga \"Han är en seniorutvecklare\"."
  },
  {
    "speaker": null,
    "timestamp": "00:22:04",
    "line": "Då kan man ta 30 sekunder extra och säga varför mer än att bara säga senior."
  },
  {
    "speaker": null,
    "timestamp": "00:22:11",
    "line": "Och detsamma gäller väl egentligen om junior, men då kanske det är lite mer självklart."
  },
  {
    "speaker": null,
    "timestamp": "00:22:17",
    "line": "För då är det snarare avsaknaden av saker som finns än att det finns saker bakom som ska befästa något ord."
  },
  {
    "speaker": null,
    "timestamp": "00:22:24",
    "line": "– Ja, men det är verkligen så de säger att man måste prata om vad som är bakomliggande."
  },
  {
    "speaker": null,
    "timestamp": "00:22:31",
    "line": "Det finns ju andra sådana titlar som också är \"team lead\" eller \"tech lead\"."
  },
  {
    "speaker": null,
    "timestamp": "00:22:36",
    "line": "Och det betyder väldigt olika saker beroende på vem du pratar med eller vilket företag du pratar om."
  },
  {
    "speaker": null,
    "timestamp": "00:22:42",
    "line": "Vissa kanske har jättemycket mandat, vissa kanske har jättemycket personalansvar och vissa kanske bara råkar ha det som en titel för att någon skulle ha det för att veta vem som ska gå på mötet."
  },
  {
    "speaker": null,
    "timestamp": "00:22:53",
    "line": "Så det blir väldigt så, vad ligger bakom där? För det kan skilja sig så oerhört mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:23:01",
    "line": "Likaså när man pratar om \"managers\". Alltså \"engineering manager\" kan ju vara allt från att bara inom situationstecken ha personalansvar och se till att personalen mår bra till."
  },
  {
    "speaker": null,
    "timestamp": "00:23:14",
    "line": "Att vara facilitator för hela teamet och \"scrum master\" och det här och det här och det här."
  },
  {
    "speaker": null,
    "timestamp": "00:23:20",
    "line": "Så det är ingenting... Det är svårt är något jag säger, kanske bara."
  },
  {
    "speaker": null,
    "timestamp": "00:23:28",
    "line": "Ja, det är väl kanske där man landar."
  },
  {
    "speaker": null,
    "timestamp": "00:23:33",
    "line": "Men jag tycker också att det är svårt, det kan jag hålla med om."
  },
  {
    "speaker": null,
    "timestamp": "00:23:37",
    "line": "Men samtidigt, det räcker ju egentligen med att prata om det lite grann."
  },
  {
    "speaker": null,
    "timestamp": "00:23:42",
    "line": "Alltså att lägga mer än fem sekunder på att läsa senior eller junior"
  },
  {
    "speaker": null,
    "timestamp": "00:23:48",
    "line": "och istället lägga 30 sekunder på att läsa lite mer bakgrund."
  },
  {
    "speaker": null,
    "timestamp": "00:23:53",
    "line": "Så inget lydigt att man har den där bakgrunden också såklart."
  },
  {
    "speaker": null,
    "timestamp": "00:23:57",
    "line": "Men också fråga om man har en konversation till exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:24:02",
    "line": "Varje gång någon frågar \"Är du en senior utvecklare?\""
  },
  {
    "speaker": null,
    "timestamp": "00:24:06",
    "line": "Då säger jag nog nej."
  },
  {
    "speaker": null,
    "timestamp": "00:24:08",
    "line": "\"Är du senior?\" \"Nej.\""
  },
  {
    "speaker": null,
    "timestamp": "00:24:11",
    "line": "Och om de vill ha en mer \"accurate\" bild av det, då kanske du säger \"har du gjort det här? Har du den här erfarenheten?\""
  },
  {
    "speaker": null,
    "timestamp": "00:24:22",
    "line": "Alltså som du säger, mer faktaföljdfrågor. För att det är väl det som benar ut det."
  },
  {
    "speaker": null,
    "timestamp": "00:24:28",
    "line": "Jag undrar om jag någonsin kommer komma till en punkt där jag är senior, och tror på det, och äger det. Jag har svårt att se det."
  },
  {
    "speaker": null,
    "timestamp": "00:24:37",
    "line": "Det manliga Therese hade ju varit senior för två år sedan."
  },
  {
    "speaker": null,
    "timestamp": "00:24:41",
    "line": "[Skratt]"
  },
  {
    "speaker": null,
    "timestamp": "00:24:45",
    "line": "– Han hade varit för ängslig, stackarn."
  },
  {
    "speaker": null,
    "timestamp": "00:24:49",
    "line": "– Jag vet inte, jag tycker också som sagt att det är svårt."
  },
  {
    "speaker": null,
    "timestamp": "00:24:53",
    "line": "Men om någon hade frågat dig, är du en erfaren utvecklare?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:57",
    "line": "– Hur menar du då?"
  },
  {
    "speaker": null,
    "timestamp": "00:25:01",
    "line": "– Det är en bra följdfråga."
  },
  {
    "speaker": null,
    "timestamp": "00:25:05",
    "line": "Det är ett bra argument för min sida att hellre fråga om man är erfaren än senior."
  },
  {
    "speaker": null,
    "timestamp": "00:25:12",
    "line": "För då kanske det leder till en diskussion mer än att man säger bara ja eller nej."
  },
  {
    "speaker": null,
    "timestamp": "00:25:16",
    "line": "– Ja, det är fan sant. – Eller att man frågar hur erfaren är du?"
  },
  {
    "speaker": null,
    "timestamp": "00:25:24",
    "line": "– Erfarenhet kontra tid. Har du kurvor som följer varandra eller ligger tidskurvan över erfarenhetskurvan?"
  },
  {
    "speaker": null,
    "timestamp": "00:25:32",
    "line": "Exakt, det kanske där alla borde ha en graf som mappar kunskap vs tid."
  },
  {
    "speaker": null,
    "timestamp": "00:25:41",
    "line": "Och klart det var i axeln hur den ska räknas ut, men det kan ju vara ett problem för någon statistiker."
  },
  {
    "speaker": null,
    "timestamp": "00:25:50",
    "line": "Alla kommer sätta olika skala på sina axlar ändå, så det spelar ingen roll."
  },
  {
    "speaker": null,
    "timestamp": "00:25:55",
    "line": "Ja, exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:57",
    "line": "Ja, jag tycker det är intressant men svårt att åsätta som du säger."
  },
  {
    "speaker": null,
    "timestamp": "00:26:04",
    "line": "Alltså att verkligen spika en titel överlag."
  },
  {
    "speaker": null,
    "timestamp": "00:26:07",
    "line": "Nu har vi snöat in oss själv med grupp och senior i junior, men"
  },
  {
    "speaker": null,
    "timestamp": "00:26:10",
    "line": "även titlar överlag tycker jag är svåra att sätta på ett vettigt sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:26:18",
    "line": "Ja, för det är kul. För när jag pratar kanske överlag, då är ju"
  },
  {
    "speaker": null,
    "timestamp": "00:26:24",
    "line": "När jag pratar med folk som jobbar inom IT så kanske jag säger att jag är konsult för att då vet alla det."
  },
  {
    "speaker": null,
    "timestamp": "00:26:29",
    "line": "Men jag säger kanske inte IT-konsult när det är personer som inte är i samma kontext."
  },
  {
    "speaker": null,
    "timestamp": "00:26:33",
    "line": "Om det är någon som inte alls jobbar i närheten av IT, då kanske jag inte ens säger att jag utvecklar det."
  },
  {
    "speaker": null,
    "timestamp": "00:26:39",
    "line": "Då säger jag nog att jag är programmerare."
  },
  {
    "speaker": null,
    "timestamp": "00:26:41",
    "line": "Och det är ju konstigt att säga det, men det är för att jag vill att det ska vara mer självförklarande för personer som kanske inte alls är insatta i begreppen som vi rör oss kring."
  },
  {
    "speaker": null,
    "timestamp": "00:26:53",
    "line": "Det kanske alla är nu för tiden, jag vet inte. Jag kanske bara sitter på någon höghäst."
  },
  {
    "speaker": null,
    "timestamp": "00:26:58",
    "line": "I vår bubbla, kanske, absolut."
  },
  {
    "speaker": null,
    "timestamp": "00:27:00",
    "line": "Men utanför tror jag att jag är webbutvecklare."
  },
  {
    "speaker": null,
    "timestamp": "00:27:04",
    "line": "Det kan vara typ vad som helst för de flesta, tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:27:07",
    "line": "Ja, det är sant."
  },
  {
    "speaker": null,
    "timestamp": "00:27:09",
    "line": "Så jag tror att programmerare är det absolut tydligaste."
  },
  {
    "speaker": null,
    "timestamp": "00:27:12",
    "line": "Då tänker de \"ja, men hon skriver kod\" eller \"hon programmerar\"."
  },
  {
    "speaker": null,
    "timestamp": "00:27:16",
    "line": "Alltså sitter i terminal och har lite kompis."
  },
  {
    "speaker": null,
    "timestamp": "00:27:19",
    "line": "Det är säkert bilden att få. Då får vi Matrix framför sig."
  },
  {
    "speaker": null,
    "timestamp": "00:27:26",
    "line": "Så att det finns fördelar med allt."
  },
  {
    "speaker": null,
    "timestamp": "00:27:32",
    "line": "Ja, men jag känner ändå att jag fick luft där här lite."
  },
  {
    "speaker": null,
    "timestamp": "00:27:40",
    "line": "Så vi kanske bara ska avsluta där helt enkelt."
  },
  {
    "speaker": null,
    "timestamp": "00:27:44",
    "line": "Absolut, det tycker vi kan göra."
  },
  {
    "speaker": null,
    "timestamp": "00:27:47",
    "line": "Vill man oss något eller har man några åsikter om senior vs junior vs erfaren vs något annat så kan man väl höra av sig."
  },
  {
    "speaker": null,
    "timestamp": "00:27:55",
    "line": "Annars hörs vi igen om två veckor vilket jag tror kanske är på nyårsafton."
  },
  {
    "speaker": null,
    "timestamp": "00:28:03",
    "line": "– Ja, jag vet inte. Det är säkert."
  },
  {
    "speaker": null,
    "timestamp": "00:28:07",
    "line": "– Vi ses och hörs. Ses gör vi inte. Vi hörs då om två veckor."
  },
  {
    "speaker": null,
    "timestamp": "00:28:12",
    "line": "– Det gör vi. Hej då."
  },
  {
    "speaker": null,
    "timestamp": "00:28:14",
    "line": "[Outromusik]"
  }
]