[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Hur kollar jag att något är fel med maggan?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:04",
    "line": "Jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:00:06",
    "line": "Jag får kolla datadog."
  },
  {
    "speaker": null,
    "timestamp": "00:00:08",
    "line": "Det är så jävla dåligt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:13",
    "line": "Ja men jag sa att det var dåligt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:15",
    "line": "Det var ju roligt dåligt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:17",
    "line": "Och så att det kräver ändå, det kräver, alltså de som kommer uppskatta skämtet är ju också de som har, alltså det är våra superfans."
  },
  {
    "speaker": null,
    "timestamp": "00:00:29",
    "line": "Alltså de som är engagerade lyssnare som vet att Maggan är en hund."
  },
  {
    "speaker": null,
    "timestamp": "00:00:35",
    "line": "- Ja, min hund. Man behöver ju verkligen inte vara ett superfan för det."
  },
  {
    "speaker": null,
    "timestamp": "00:00:39",
    "line": "För att jag pratar ju om Maggan så fort jag får en chans."
  },
  {
    "speaker": null,
    "timestamp": "00:00:42",
    "line": "- Ja, jag vet inte. Det är inte så många avsnitt ändå."
  },
  {
    "speaker": null,
    "timestamp": "00:00:45",
    "line": "Nu kan vi passa på att... vad heter det?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:48",
    "line": "Att pusha för att det finns en sökfunktion på vår hemsida nu."
  },
  {
    "speaker": null,
    "timestamp": "00:00:51",
    "line": "Så där skulle man kunna gå in nu och skriva Maggan."
  },
  {
    "speaker": null,
    "timestamp": "00:00:53",
    "line": "Och så kan man säga att det är ändå en, två, tre avsnitt som du har sagt Maggan i."
  },
  {
    "speaker": null,
    "timestamp": "00:00:58",
    "line": "Jo men hon finns ju också med på sidan tänker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:01:01",
    "line": "Jo absolut, det är sant."
  },
  {
    "speaker": null,
    "timestamp": "00:01:03",
    "line": "Välkomna hörni till ett nytt avsnitt av asdf."
  },
  {
    "speaker": null,
    "timestamp": "00:01:08",
    "line": "Jajjemen, låt mig också börja med att brasklappa."
  },
  {
    "speaker": null,
    "timestamp": "00:01:12",
    "line": "Mm."
  },
  {
    "speaker": null,
    "timestamp": "00:01:13",
    "line": "Ja, att jag i nattverk har bitit mitt tunga eller något så att jag pratar som att jag har tagit en lunchöl men det har jag inte."
  },
  {
    "speaker": null,
    "timestamp": "00:01:21",
    "line": "Det är ju en fem plus ursäkt för om du har tagit en lunchöl dock."
  },
  {
    "speaker": null,
    "timestamp": "00:01:26",
    "line": "-Aa, ja just det. Eller om man bara ska se det som att såhär, ja men det var meant to be, det är bäst att jag tar en lunchöl."
  },
  {
    "speaker": null,
    "timestamp": "00:01:34",
    "line": "-Ja, där har vi det. Det är så det ska vara."
  },
  {
    "speaker": null,
    "timestamp": "00:01:38",
    "line": "-Om jag ändå har behövt leva med den här smärtan så får jag dricka öl. Jag dricker ju inte öl, jag tycker ju inte om öl, men principiellt."
  },
  {
    "speaker": null,
    "timestamp": "00:01:48",
    "line": "Nej, precis. Men alla förstår det menar jag."
  },
  {
    "speaker": null,
    "timestamp": "00:01:53",
    "line": "Idag, jag är så jävla trött. Jag blev matförgiftad i helgen så jag skyller helt hållet på det."
  },
  {
    "speaker": null,
    "timestamp": "00:01:57",
    "line": "Men vi tänkte väl i alla fall att vi skulle beta av det här som nu måste ändå vara, för alla poddar som någon IT-relation överhuvudtaget,"
  },
  {
    "speaker": null,
    "timestamp": "00:02:07",
    "line": "inte ens det, alla poddar överhuvudtaget har ju liksom haft ett AI-avsnitt för det här laget."
  },
  {
    "speaker": null,
    "timestamp": "00:02:14",
    "line": "Ja, vi har också fått in mycket förslag på att prata om AI."
  },
  {
    "speaker": null,
    "timestamp": "00:02:19",
    "line": "Ja, exakt det är därför vi gör det, för att våra lyssnare vill."
  },
  {
    "speaker": null,
    "timestamp": "00:02:24",
    "line": "Exakt, så att jag menar vi måste ju abide by..."
  },
  {
    "speaker": null,
    "timestamp": "00:02:31",
    "line": "Grupptrycket."
  },
  {
    "speaker": null,
    "timestamp": "00:02:32",
    "line": "Fan base, jag vet inte vad jag försöker säga."
  },
  {
    "speaker": null,
    "timestamp": "00:02:36",
    "line": "Jag är också lite trött."
  },
  {
    "speaker": null,
    "timestamp": "00:02:38",
    "line": "Jag har liksom jobbat lite med GDP-relaterade saker under några veckor nu."
  },
  {
    "speaker": null,
    "timestamp": "00:02:47",
    "line": "Jag känner att energin, alltså jag tänker mycket på den här mimen med \"\"regular headache\"\" och så är det lite rött på ut."
  },
  {
    "speaker": null,
    "timestamp": "00:02:55",
    "line": "Och så är det \"\"migraine\"\" och så lite mer rött. Och så är det \"\"GDPR\"\" i hela huvudet."
  },
  {
    "speaker": null,
    "timestamp": "00:02:59",
    "line": "Just det, just det."
  },
  {
    "speaker": null,
    "timestamp": "00:03:01",
    "line": "Lite så."
  },
  {
    "speaker": null,
    "timestamp": "00:03:02",
    "line": "Ja, jag förstår det. GDPR är väl ingenting som ger så mycket energi så att säga?"
  },
  {
    "speaker": null,
    "timestamp": "00:03:08",
    "line": "Nej, illa i och för sig regler så kanske. Men det har varit en lång väg på många sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:03:19",
    "line": "Det kanske blir ett obligatoriskt GDPR-avsnitt också?"
  },
  {
    "speaker": null,
    "timestamp": "00:03:23",
    "line": "Oj, oj. Ja, vad har vi att säga om det? Ingenting?"
  },
  {
    "speaker": null,
    "timestamp": "00:03:29",
    "line": "Vi har inte fått så många lyssnare och förfrågningar på det heller, så vi kanske skiter i det och hoppar in och pratar lite AI istället."
  },
  {
    "speaker": null,
    "timestamp": "00:03:37",
    "line": "Det är ju liksom en större buzz än när under pandemin Tiger King gick på Netflix."
  },
  {
    "speaker": null,
    "timestamp": "00:03:45",
    "line": "Ja, men det är väl kanske inte super konstigt. Är det en större buzz än Animal Crossing dock? Det vet jag inte."
  },
  {
    "speaker": null,
    "timestamp": "00:03:55",
    "line": "Animal Crossing, det känns klickigt. Det är inte alls lika brett."
  },
  {
    "speaker": null,
    "timestamp": "00:04:02",
    "line": "Nej, men det var väldigt intensivt."
  },
  {
    "speaker": null,
    "timestamp": "00:04:05",
    "line": "Ja, men Tiger King och AI, det är för allmänheten. Det är generellt."
  },
  {
    "speaker": null,
    "timestamp": "00:04:13",
    "line": "Gud, okej, okej. Ja, men alltså det finns ju väldigt många olika delar i det här."
  },
  {
    "speaker": null,
    "timestamp": "00:04:19",
    "line": "Jag menar från IT-hållet så har vi kanske mer så här, ja, den naturliga, ja, hur funkar det här, funkar det här, kommer det ta våra jobb, jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:04:28",
    "line": "Men jag tycker det är mer spännande med liksom den här kulturella delen, för att den är mycket mer problematisk tycker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:04:36",
    "line": "Ja, men konsten, om den tränar upp sig på konst och sen snor jobben för det, vad händer då?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:42",
    "line": "Att Grimes är såhär, jag kommer dela hälften av royalties med dem som gör en hit med min röst."
  },
  {
    "speaker": null,
    "timestamp": "00:04:48",
    "line": "Alltså det är mycket galenskap på gång."
  },
  {
    "speaker": null,
    "timestamp": "00:04:52",
    "line": "- Alltså hade jag varit i Grimes position och för det första kunnat sjunga då,"
  },
  {
    "speaker": null,
    "timestamp": "00:04:57",
    "line": "det är ju en jävla kanondeal."
  },
  {
    "speaker": null,
    "timestamp": "00:04:59",
    "line": "Folk gör låtar och gör sina pengar."
  },
  {
    "speaker": null,
    "timestamp": "00:05:03",
    "line": "- Ja, jag bara sitter hemma. - Det är noll effort."
  },
  {
    "speaker": null,
    "timestamp": "00:05:06",
    "line": "- Ja, verkligen."
  },
  {
    "speaker": null,
    "timestamp": "00:05:09",
    "line": "Jag håller ändå med den kulturella biten, det finns så jävla mycket där som man kan röra på."
  },
  {
    "speaker": null,
    "timestamp": "00:05:17",
    "line": "Det senaste är väl just att folk kan göra, alltså imitera röster, eller inte imitera men återskapa rösterna."
  },
  {
    "speaker": null,
    "timestamp": "00:05:25",
    "line": "Den stora var väl den här Drake och Jay Z låten va?"
  },
  {
    "speaker": null,
    "timestamp": "00:05:29",
    "line": "Som blev superpoppis."
  },
  {
    "speaker": null,
    "timestamp": "00:05:31",
    "line": "Och sen har det varit lite annat. Du har ju typ Mid Journey är väl en av de större."
  },
  {
    "speaker": null,
    "timestamp": "00:05:37",
    "line": "Och vad heter den andra? Jag har tappat namnen på den nu."
  },
  {
    "speaker": null,
    "timestamp": "00:05:42",
    "line": "-Jag har ingen aning. -Skitsamma, det kommer komma upp sen i avsnittet."
  },
  {
    "speaker": null,
    "timestamp": "00:05:47",
    "line": "Men Mid Journey är väl en av de som är bäst på att återskapa realistiska bilder på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:05:55",
    "line": "Sen finns det ju Dalí och alla de runt omkring. Men jag vet inte, det är..."
  },
  {
    "speaker": null,
    "timestamp": "00:06:00",
    "line": "Men alltså deepfakes, så himla obehagligt."
  },
  {
    "speaker": null,
    "timestamp": "00:06:04",
    "line": "- Ja, gud, ja. - Vad av..."
  },
  {
    "speaker": null,
    "timestamp": "00:06:05",
    "line": "Jag menar, jag kan inte ens hantera första april i världen, för jag är så naiv."
  },
  {
    "speaker": null,
    "timestamp": "00:06:11",
    "line": "Hur ska jag hantera deepfakes?"
  },
  {
    "speaker": null,
    "timestamp": "00:06:14",
    "line": "- Nej, men jag läste någon... Jag kommer inte ihåg om det där var en artikel eller en video eller nåt så jag har svårt att länka till den."
  },
  {
    "speaker": null,
    "timestamp": "00:06:19",
    "line": "Men jag läste någonting om..."
  },
  {
    "speaker": null,
    "timestamp": "00:06:22",
    "line": "Att nån var så här, är det här liksom slutet på historia?"
  },
  {
    "speaker": null,
    "timestamp": "00:06:26",
    "line": "Eller historien, alltså förstår du, alltså ämnet historia?"
  },
  {
    "speaker": null,
    "timestamp": "00:06:30",
    "line": "För att du kan inte veta om den här bilden är en bild som är genererad eller om den är en bild som faktiskt är sand."
  },
  {
    "speaker": null,
    "timestamp": "00:06:39",
    "line": "- Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:06:41",
    "line": "Ja, verkligen så här att \"\"ja men vi kunde inte sprida information och sen fick alla tillgång till informationen och det var superviktigt och nu kan ingen lita på den informationen\"\"."
  },
  {
    "speaker": null,
    "timestamp": "00:06:51",
    "line": "Jag tycker det är jätteobagligt."
  },
  {
    "speaker": null,
    "timestamp": "00:06:53",
    "line": "Ja, och man vet ju liksom, alltså i ett traditionellt sätt när det kommer ny teknik och ny allt möjligt, om man tar den negativa sidan, eller om man ska vara ännu mer karaktäriserande så är det kanske den onda sidan som är bäst på att använda teknik."
  },
  {
    "speaker": null,
    "timestamp": "00:07:13",
    "line": "eller ny teknik. För de har inte de här skruplorna, som är ett uttryck man använder alldeles för lite, som den då goda sidan har."
  },
  {
    "speaker": null,
    "timestamp": "00:07:23",
    "line": "Alltså det vill säga, hur ska vi använda den här, hur använder vi den här på rätt sätt, vilken etik och moral och allting runt omkring det ska vi applicera på den."
  },
  {
    "speaker": null,
    "timestamp": "00:07:31",
    "line": "Medan de som till exempel vill då sprida desinformation till exempel, eller vad fan det nu kan vara, de kommer ju bara köra på."
  },
  {
    "speaker": null,
    "timestamp": "00:07:37",
    "line": "Ja, alltså för det är verkligen så här, det finns ingenting kanske som stoppar, gud vad elakt det känns säger den onda sidan, men det blir lite så här, ja men det är helt sjukt, jag skulle aldrig kunna komma på tanken att ta en person och göra en deepfake och en porrfilm på den personen, för det skulle ta emot, inte för att jag kan göra det, men du förstår principen."
  },
  {
    "speaker": null,
    "timestamp": "00:08:02",
    "line": "- Det skulle ta emot, men... - Om jag kunde. Det är bara att jag inte kan som tar emot."
  },
  {
    "speaker": null,
    "timestamp": "00:08:09",
    "line": "Nej, men alltså det känns på något sätt för mig också, för det är så himla tydligt att man vet att det här är inte rätt."
  },
  {
    "speaker": null,
    "timestamp": "00:08:17",
    "line": "- Ja, exakt. - Det är liksom tydligt kränkande på ett sätt som inte är kanske om man råkar dela information om någon som man inte hade tänkt att man ens delade information om."
  },
  {
    "speaker": null,
    "timestamp": "00:08:29",
    "line": "Jag vet inte vart jag är på väg. Jag tänkte att vi också var på väg in mer mot bara använda AI i vårt arbetsliv."
  },
  {
    "speaker": null,
    "timestamp": "00:08:41",
    "line": "Vi kommer nog dit också. Men jag tycker ändå som du var inne på i början, det är de här bitarna som är de mest intressanta på en större skala."
  },
  {
    "speaker": null,
    "timestamp": "00:08:51",
    "line": "Just nu om man jämför med, ja visst man kan använda, jag vet inte, chatt-GPT för att generera saker och oj folk luktar läcka lite företagshemligheter."
  },
  {
    "speaker": null,
    "timestamp": "00:09:00",
    "line": "Det är inte så jävla allvarligt."
  },
  {
    "speaker": null,
    "timestamp": "00:09:03",
    "line": "- Nej, det är mer bara, ja men det blev jobbigt för kommersialismen att, ja det blev fel, det blev som konkurrens mellan företag som det kan bli lite sämre, det händer."
  },
  {
    "speaker": null,
    "timestamp": "00:09:17",
    "line": "Ja, exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:09:19",
    "line": "Men alltså, konsten, kulturen, historien, alltså det som är på något sätt människan känns det som."
  },
  {
    "speaker": null,
    "timestamp": "00:09:27",
    "line": "Ja, jag undrar liksom om det kommer ha någon typ av pendel-effekt där, ja men till exempel om man tar just musik så lär det ju bli ännu viktigare med live-framträdanden."
  },
  {
    "speaker": null,
    "timestamp": "00:09:45",
    "line": "Alltså om det helt plötsligt kan vara så att det finns 10 000 nya Jay Z låtar eller Drake låtar eller vad det nu kan vara."
  },
  {
    "speaker": null,
    "timestamp": "00:09:57",
    "line": "Bleachers för att ta ett av mina favoritband och plugga dem lite här i podden också."
  },
  {
    "speaker": null,
    "timestamp": "00:10:03",
    "line": "Då kommer det ju bli såhär \"\"ah\"\" fast det spär ljudet lite grann."
  },
  {
    "speaker": null,
    "timestamp": "00:10:09",
    "line": "Sen är det klart att man kanske kommer kunna veta att det här är musik som jag faktiskt har,"
  },
  {
    "speaker": null,
    "timestamp": "00:10:13",
    "line": "eller det här bandet har gjort själv och de står bakom dig och allting sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:10:17",
    "line": "Men jag vet inte, det kommer fortfarande bli någon konstig grej när man kan lyssna på så många låtar."
  },
  {
    "speaker": null,
    "timestamp": "00:10:24",
    "line": "Jämfört med om man går på en spelning med en band eller en konsert och faktiskt ser personen sjunga låtarna"
  },
  {
    "speaker": null,
    "timestamp": "00:10:31",
    "line": "och liksom att det blir faktiskt äktat att vara på riktigt."
  },
  {
    "speaker": null,
    "timestamp": "00:10:34",
    "line": "- Tänk om någon kör playback?"
  },
  {
    "speaker": null,
    "timestamp": "00:10:36",
    "line": "- Ja, men sen kommer det att sluta med att det blir playback."
  },
  {
    "speaker": null,
    "timestamp": "00:10:39",
    "line": "Fast helt plötsligt så kan man liksom ställa in vilken röst som kommer ut ur högtalarna när du själv sjunger i mikrofonen."
  },
  {
    "speaker": null,
    "timestamp": "00:10:45",
    "line": "- Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:10:47",
    "line": "Åh."
  },
  {
    "speaker": null,
    "timestamp": "00:10:49",
    "line": "Alltså jag brukar bara lyssna på låtar, de brukar ju bara få rulla."
  },
  {
    "speaker": null,
    "timestamp": "00:10:52",
    "line": "Jag vet ju inte vad det är för artist, jag vet ju inte vad som händer."
  },
  {
    "speaker": null,
    "timestamp": "00:10:55",
    "line": "- Nej. - Alla bara lyssnar på radion."
  },
  {
    "speaker": null,
    "timestamp": "00:10:58",
    "line": "Vi bara lämnar kulturen. Vi skiter i kulturen. Vi har på väg ner i ett mörkt och deppigt hål i det här avsnittet och det ska vi fan inte ner i."
  },
  {
    "speaker": null,
    "timestamp": "00:11:09",
    "line": "Alltså vår energi räcker inte till till det. Vi kan liksom inte parera det mörkret just nu."
  },
  {
    "speaker": null,
    "timestamp": "00:11:15",
    "line": "Nej, det är sant."
  },
  {
    "speaker": null,
    "timestamp": "00:11:17",
    "line": "Så, med tanke på att vi pratar som att vi tror att AI är värdelöst och kommer ställa till det mer än vad det hjälper."
  },
  {
    "speaker": null,
    "timestamp": "00:11:23",
    "line": "Men, hur mycket använder du AI? Och fan, det är också när vi säger AI idag så menar vi ofta generativ AI."
  },
  {
    "speaker": null,
    "timestamp": "00:11:32",
    "line": "Alltså det vill säga typ chat-GPT eller någon annan GPT-modell eller typ GitHub Copilot eller vad det nu kan vara."
  },
  {
    "speaker": null,
    "timestamp": "00:11:40",
    "line": "Alltså det är det vi pratar om idag för att det är det som är Tiger King AI."
  },
  {
    "speaker": null,
    "timestamp": "00:11:46",
    "line": "Jag vet, jag var väldigt sen på det här, för det har varit så hypat, och jag har bara känt \"\"Uch\"\" lite så."
  },
  {
    "speaker": null,
    "timestamp": "00:11:55",
    "line": "För jag har inte heller det här drivet, bara \"\"Åh vad coolt, hur funkar det här då? Är det verkligen så bra?\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:12:01",
    "line": "Jag är mer såhär \"\"Uch\"\" så känner jag lite."
  },
  {
    "speaker": null,
    "timestamp": "00:12:04",
    "line": "Men sen kände jag någon dag, och det här tror jag faktiskt var när jag satt med..."
  },
  {
    "speaker": null,
    "timestamp": "00:12:10",
    "line": "Jag fastnade på att lyckas seleniumtesta en Shadow Dom i RubyCode."
  },
  {
    "speaker": null,
    "timestamp": "00:12:20",
    "line": "Ett Ruby seleniumtest."
  },
  {
    "speaker": null,
    "timestamp": "00:12:22",
    "line": "Något du kanske inte är jättefamiljär med från första början, alltså Ruby till exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:12:26",
    "line": "Nej exakt, kan inte ett piss."
  },
  {
    "speaker": null,
    "timestamp": "00:12:29",
    "line": "Jag var verkligen så här, jag vet inte vad jag ska göra. Jag satt i typ en dag och bara,"
  },
  {
    "speaker": null,
    "timestamp": "00:12:33",
    "line": "Nej, och sen satt jag där och bara, nej men jag tar väl hem Copilot, ser om Copilot kan hjälpa mig."
  },
  {
    "speaker": null,
    "timestamp": "00:12:41",
    "line": "Skrev lite kommentarer på vad jag ville göra, och Copilot hjälpte mig ju lite grann, men lyckades ju aldrig lösa problemet och då blev det lite såhär, nej men jag frågar ChatGPT."
  },
  {
    "speaker": null,
    "timestamp": "00:12:55",
    "line": "- Det kanske... - Vi går till nästa."
  },
  {
    "speaker": null,
    "timestamp": "00:12:57",
    "line": "- Kanske det räcker något."
  },
  {
    "speaker": null,
    "timestamp": "00:12:59",
    "line": "Och ChatGPT gav ju då samma lösning som inte heller riktigt löste problemet."
  },
  {
    "speaker": null,
    "timestamp": "00:13:05",
    "line": "Så att där började jag."
  },
  {
    "speaker": null,
    "timestamp": "00:13:07",
    "line": "Och nu har jag lite grann... Alltså jag har Copilot på."
  },
  {
    "speaker": null,
    "timestamp": "00:13:11",
    "line": "Och har på skämt vissa gånger när vi sitter."
  },
  {
    "speaker": null,
    "timestamp": "00:13:16",
    "line": "Jag har suttit på ganska många problem som liksom inte hittat någon lösning på."
  },
  {
    "speaker": null,
    "timestamp": "00:13:22",
    "line": "Och då är det så här, har du frågat chat-GPT?"
  },
  {
    "speaker": null,
    "timestamp": "00:13:25",
    "line": "Så har jag frågat chat-GPT lite grann."
  },
  {
    "speaker": null,
    "timestamp": "00:13:27",
    "line": "Men det är med så jag använt det."
  },
  {
    "speaker": null,
    "timestamp": "00:13:28",
    "line": "Hur har du det med den här typen av generativ AI i ditt liv?"
  },
  {
    "speaker": null,
    "timestamp": "00:13:33",
    "line": "- Nej, men jag är väl ganska lik."
  },
  {
    "speaker": null,
    "timestamp": "00:13:36",
    "line": "För jag var också väldigt sen på bollen på Copilot just till exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:13:42",
    "line": "Men den tycker jag, alltså så här,"
  },
  {
    "speaker": null,
    "timestamp": "00:13:45",
    "line": "jag använder den inte jättemycket för det som, alltså så här, skriva kommentarer"
  },
  {
    "speaker": null,
    "timestamp": "00:13:48",
    "line": "och sen får den generera kod utifrån kommentarerna."
  },
  {
    "speaker": null,
    "timestamp": "00:13:51",
    "line": "Det händer någon gång ibland när man har något superlitet problem som man vill lösa."
  },
  {
    "speaker": null,
    "timestamp": "00:13:55",
    "line": "Men oftast så tycker jag att den är väldigt mycket bättre på autocomplete."
  },
  {
    "speaker": null,
    "timestamp": "00:14:00",
    "line": "För den ger ju autocomplete förslag också."
  },
  {
    "speaker": null,
    "timestamp": "00:14:03",
    "line": "Det vill säga att om jag till exempel, vad fan kan det vara, om jag skriver liksom"
  },
  {
    "speaker": null,
    "timestamp": "00:14:09",
    "line": "börjar skriva en use state i React"
  },
  {
    "speaker": null,
    "timestamp": "00:14:14",
    "line": "så kommer den autocomplete efter första"
  },
  {
    "speaker": null,
    "timestamp": "00:14:18",
    "line": "Efter första, vad heter det? Hårda masfingen höll jag på att säga. Hårda parantesen."
  },
  {
    "speaker": null,
    "timestamp": "00:14:23",
    "line": "Vad fan heter hårda paranteser på?"
  },
  {
    "speaker": null,
    "timestamp": "00:14:25",
    "line": "Vad menar du med hårda paranteser?"
  },
  {
    "speaker": null,
    "timestamp": "00:14:27",
    "line": "Du fattar, de är fyrkantiga paranteserna."
  },
  {
    "speaker": null,
    "timestamp": "00:14:29",
    "line": "Kantiga paranteserna. En bracket."
  },
  {
    "speaker": null,
    "timestamp": "00:14:31",
    "line": "Ja en bracket, exakt. Men jag försökte komma på det lite på svenska."
  },
  {
    "speaker": null,
    "timestamp": "00:14:33",
    "line": "Ehm."
  },
  {
    "speaker": null,
    "timestamp": "00:14:35",
    "line": "Pfff."
  },
  {
    "speaker": null,
    "timestamp": "00:14:37",
    "line": "Vet du vad vi gör? Vet du vad jag ska göra nu?"
  },
  {
    "speaker": null,
    "timestamp": "00:14:39",
    "line": "Fråga chattgpt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:41",
    "line": "Jag ska gå in och fråga chattgpt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:43",
    "line": "Och se om det funkar."
  },
  {
    "speaker": null,
    "timestamp": "00:14:47",
    "line": "Jag måste såklart logga in."
  },
  {
    "speaker": null,
    "timestamp": "00:14:48",
    "line": "Nej men det som jag håller på med är oftast att jag gör så."
  },
  {
    "speaker": null,
    "timestamp": "00:14:53",
    "line": "Att den autocompleter saker på ett mycket bättre sätt än vanlig autocomplete."
  },
  {
    "speaker": null,
    "timestamp": "00:14:59",
    "line": "För den är ju mycket smartare så den får ju liksom kontexten på saker runt omkring."
  },
  {
    "speaker": null,
    "timestamp": "00:15:02",
    "line": "Så att ibland kan den autocomplete hela rader."
  },
  {
    "speaker": null,
    "timestamp": "00:15:04",
    "line": "Vilket är väldigt väldigt trevligt."
  },
  {
    "speaker": null,
    "timestamp": "00:15:06",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:15:08",
    "line": "Alltså jag har ju också det."
  },
  {
    "speaker": null,
    "timestamp": "00:15:10",
    "line": "Men någonting som jag stör mig enormt på det är om jag gör typ en..."
  },
  {
    "speaker": null,
    "timestamp": "00:15:15",
    "line": "för att göra en sträng."
  },
  {
    "speaker": null,
    "timestamp": "00:15:17",
    "line": "Och då skriver nu två."
  },
  {
    "speaker": null,
    "timestamp": "00:15:19",
    "line": "Men ChatGPT kompletterar och så lämnar den en jävla fnutt kvar."
  },
  {
    "speaker": null,
    "timestamp": "00:15:23",
    "line": "Så att det blir alltid lite error. Det stör mig något enormt."
  },
  {
    "speaker": null,
    "timestamp": "00:15:27",
    "line": "Har jag ChatGPT? Jag menade Copilot."
  },
  {
    "speaker": null,
    "timestamp": "00:15:31",
    "line": "- Ja, precis. - Jo."
  },
  {
    "speaker": null,
    "timestamp": "00:15:33",
    "line": "Jag frågade ChatGPT."
  },
  {
    "speaker": null,
    "timestamp": "00:15:35",
    "line": "Jag skrev, \"\"Vad heter en parentes med kanter på svenska?\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:15:39",
    "line": "En parentes med kanter kallas vanligtvis för parentes, eller runda parentes på svenska."
  },
  {
    "speaker": null,
    "timestamp": "00:15:44",
    "line": "Det är helt fel!"
  },
  {
    "speaker": null,
    "timestamp": "00:15:46",
    "line": "Du är dumma jävla oj!"
  },
  {
    "speaker": null,
    "timestamp": "00:15:48",
    "line": "Men du är också svenska."
  },
  {
    "speaker": null,
    "timestamp": "00:15:50",
    "line": "Men snackar du med chattgrupping på svenska?"
  },
  {
    "speaker": null,
    "timestamp": "00:15:52",
    "line": "Nej, men nu ville jag ju veta vad den heter på svenska."
  },
  {
    "speaker": null,
    "timestamp": "00:15:54",
    "line": "Så då tänkte jag att då skriver jag på svenska."
  },
  {
    "speaker": null,
    "timestamp": "00:15:56",
    "line": "Sen skrev jag den. Det finns också"
  },
  {
    "speaker": null,
    "timestamp": "00:15:58",
    "line": "fyrkantiga parenteser och klammer parenteser."
  },
  {
    "speaker": null,
    "timestamp": "00:16:00",
    "line": "Klammer parentes då?"
  },
  {
    "speaker": null,
    "timestamp": "00:16:02",
    "line": "Ja, klammer parentes kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:16:04",
    "line": "Men om jag skriver nu då."
  },
  {
    "speaker": null,
    "timestamp": "00:16:06",
    "line": "Vad det här är en klammer parentes."
  },
  {
    "speaker": null,
    "timestamp": "00:16:08",
    "line": "Det här är bra radio det här."
  },
  {
    "speaker": null,
    "timestamp": "00:16:10",
    "line": "Verkligen."
  },
  {
    "speaker": null,
    "timestamp": "00:16:12",
    "line": "Verkligen."
  },
  {
    "speaker": null,
    "timestamp": "00:16:14",
    "line": "Klammerparentes är bra bla bla bla bla."
  },
  {
    "speaker": null,
    "timestamp": "00:16:16",
    "line": "Vad fan är det som?"
  },
  {
    "speaker": null,
    "timestamp": "00:16:20",
    "line": "Spanningen är olidlig."
  },
  {
    "speaker": null,
    "timestamp": "00:16:22",
    "line": "Nej, det är..."
  },
  {
    "speaker": null,
    "timestamp": "00:16:24",
    "line": "Den skriver inte ut vad en klammerparentes..."
  },
  {
    "speaker": null,
    "timestamp": "00:16:26",
    "line": "Men gud, kunde du inte bara fråga"
  },
  {
    "speaker": null,
    "timestamp": "00:16:28",
    "line": "\"\"What's the word for bracket parenthesis in Swedish?\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:16:32",
    "line": "Jo, men då hade jag kunnat gå till translate.google.com istället."
  },
  {
    "speaker": null,
    "timestamp": "00:16:36",
    "line": "Ja, men..."
  },
  {
    "speaker": null,
    "timestamp": "00:16:38",
    "line": "Vad håller vi på med?"
  },
  {
    "speaker": null,
    "timestamp": "00:16:40",
    "line": "- Det här är varför AI tar över. - Ja, jag vet. Vi kommer aldrig göra det igen."
  },
  {
    "speaker": null,
    "timestamp": "00:16:45",
    "line": "Kanske att jag klipper bort det till och med, för det var så jävla ointressant."
  },
  {
    "speaker": null,
    "timestamp": "00:16:49",
    "line": "Men alltså, en sak som jag tycker med Copilot, det är att ibland så gör den lite fel."
  },
  {
    "speaker": null,
    "timestamp": "00:16:56",
    "line": "Ja, Gud ja. Gud ja."
  },
  {
    "speaker": null,
    "timestamp": "00:16:59",
    "line": "Och sen störigt lite, lite fel. Och det var ju ganska svårt när jag befann mig i ett Ruby-kontext som jag inte har koll på."
  },
  {
    "speaker": null,
    "timestamp": "00:17:06",
    "line": "Det är väldigt svårt för mig att avgöra om det är fel eller inte."
  },
  {
    "speaker": null,
    "timestamp": "00:17:11",
    "line": "Det är lättare för mig att skripta, det är vanligt."
  },
  {
    "speaker": null,
    "timestamp": "00:17:13",
    "line": "Det här kan jag se ganska fort, det här är inte rätt."
  },
  {
    "speaker": null,
    "timestamp": "00:17:15",
    "line": "Men i Ruby är det så här, jaha, okej."
  },
  {
    "speaker": null,
    "timestamp": "00:17:19",
    "line": "Det där tror jag är en ganska viktig grej att tänka på när man använder de här modellerna."
  },
  {
    "speaker": null,
    "timestamp": "00:17:26",
    "line": "De vet ju inte vad som är rätt eller fel."
  },
  {
    "speaker": null,
    "timestamp": "00:17:29",
    "line": "Ofta pratar vi till exempel om GPT-modellerna."
  },
  {
    "speaker": null,
    "timestamp": "00:17:33",
    "line": "Det man gör när man ställer en fråga till dem, eller om vi tar specifikt chatt-QPT,"
  },
  {
    "speaker": null,
    "timestamp": "00:17:37",
    "line": "är att frågan du ställer är ju egentligen inte där du skriver i chatten."
  },
  {
    "speaker": null,
    "timestamp": "00:17:42",
    "line": "Utan frågan är ju vad är det statistiskt mest sannolika svaret på det här?"
  },
  {
    "speaker": null,
    "timestamp": "00:17:50",
    "line": "Eller vad är det statistiskt mest sannolika texten att komma efter den här texten som du har skickat in?"
  },
  {
    "speaker": null,
    "timestamp": "00:17:54",
    "line": "- Ja, och vart finns det mest en relation med de här texterna?"
  },
  {
    "speaker": null,
    "timestamp": "00:18:00",
    "line": "Ja exakt, så att det handlar ju om det. Alltså så här, folk är så här \"\"Åh wow, den kan svara på frågor\"\"."
  },
  {
    "speaker": null,
    "timestamp": "00:18:05",
    "line": "Det är inte riktigt det den gör egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:18:08",
    "line": "Vilket gör att den kan väldigt ofta ha fel och väldigt ofta hallucinera som det kallas när den hittar på saker."
  },
  {
    "speaker": null,
    "timestamp": "00:18:14",
    "line": "Alltså det har jag märkt också väldigt mycket att så här, man skriver och frågar någonting och så får man så här \"\"Ja men använda här NPM-biblioteket\"\"."
  },
  {
    "speaker": null,
    "timestamp": "00:18:20",
    "line": "Man bara går dit och bara \"\"Äh, det var en 404-sida på NPM för det finns inte\"\"."
  },
  {
    "speaker": null,
    "timestamp": "00:18:24",
    "line": "Men det är ju fortfarande så pass bra att det skulle klara Turing-testet."
  },
  {
    "speaker": null,
    "timestamp": "00:18:29",
    "line": "Man kan ju fortfarande inte säga att det är 100% en AI jag chattar med."
  },
  {
    "speaker": null,
    "timestamp": "00:18:35",
    "line": "Nej, inte alltid. Men det känns som att det är ganska enkelt."
  },
  {
    "speaker": null,
    "timestamp": "00:18:40",
    "line": "Det känns som att man skulle kunna klura ut det om man fick chatta lite fram och tillbaka."
  },
  {
    "speaker": null,
    "timestamp": "00:18:44",
    "line": "Jo, klura ut det ja, men är inte Turing-testet så att du ska med säkerhet kunna avgöra att du inte pratar med en människa?"
  },
  {
    "speaker": null,
    "timestamp": "00:18:52",
    "line": "Jo, det kan väl stämma."
  },
  {
    "speaker": null,
    "timestamp": "00:18:54",
    "line": "Att det ska vara ett svar som en människa aldrig skulle ge tillbaka."
  },
  {
    "speaker": null,
    "timestamp": "00:18:59",
    "line": "Det var väldigt länge sedan jag läste det här på universitetet."
  },
  {
    "speaker": null,
    "timestamp": "00:19:04",
    "line": "Ja, det här... Jag tror..."
  },
  {
    "speaker": null,
    "timestamp": "00:19:10",
    "line": "Har du frågat ChattGPT?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:12",
    "line": "Nej, jag har inte frågat ChattGPT."
  },
  {
    "speaker": null,
    "timestamp": "00:19:14",
    "line": "Jag gick till Wikipedia."
  },
  {
    "speaker": null,
    "timestamp": "00:19:16",
    "line": "Det är som du säger, att man ska kunna ställa frågor till en dator."
  },
  {
    "speaker": null,
    "timestamp": "00:19:19",
    "line": "och sen ska man kunna bedöma om det är liksom en..."
  },
  {
    "speaker": null,
    "timestamp": "00:19:25",
    "line": "Om du ställer frågor till flera datorer samtidigt"
  },
  {
    "speaker": null,
    "timestamp": "00:19:31",
    "line": "så ska du kunna bedöma då vilka är AI's och vilka är människor."
  },
  {
    "speaker": null,
    "timestamp": "00:19:37",
    "line": "- Ja, men alltså för att om någon svarar så här \"\"ja, jag kan inte svara på det här\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:19:44",
    "line": "Det är inte en indikation på att det är en AI nödvändigtvis, för att det skulle en människa också kunna ha sagt."
  },
  {
    "speaker": null,
    "timestamp": "00:19:52",
    "line": "Ja, men så kan det absolut vara."
  },
  {
    "speaker": null,
    "timestamp": "00:19:54",
    "line": "Jo, alltså texten den spottar ur sig är ju ändå tillräckligt förtroendeingivande för att man ska kunna lita på den."
  },
  {
    "speaker": null,
    "timestamp": "00:20:02",
    "line": "Men också att den använder så här sociala konventioner att den upprepar frågan först."
  },
  {
    "speaker": null,
    "timestamp": "00:20:08",
    "line": "Du ställer den här frågan, då svarar jag så här."
  },
  {
    "speaker": null,
    "timestamp": "00:20:12",
    "line": "Det är absolut imponerande."
  },
  {
    "speaker": null,
    "timestamp": "00:20:16",
    "line": "ChatGPT har jag inte använt jättemycket aktivt."
  },
  {
    "speaker": null,
    "timestamp": "00:20:20",
    "line": "Ibland för lite mer kreativa saker som att formulera om det här"
  },
  {
    "speaker": null,
    "timestamp": "00:20:26",
    "line": "eller korta ner meningen lite grann."
  },
  {
    "speaker": null,
    "timestamp": "00:20:30",
    "line": "Sådana saker tycker jag den är ganska bra på."
  },
  {
    "speaker": null,
    "timestamp": "00:20:32",
    "line": "Och att transformera data från olika format."
  },
  {
    "speaker": null,
    "timestamp": "00:20:38",
    "line": "Och med format så behöver det inte vara JSON till XML utan det kan lika gärna vara från en akademisk text till en text som en femåring förstår."
  },
  {
    "speaker": null,
    "timestamp": "00:20:46",
    "line": "Ja, jag har ju hört många exempel på att använda ChatGPT för att frambringa management lingo."
  },
  {
    "speaker": null,
    "timestamp": "00:20:56",
    "line": "Ja exakt, jag har också sett någon som skrev så här, jag är så jävla arg på den här personen, kan du skriva ett, han är dum i huvudet, han kan ingenting, bla bla bla, kan du skriva ett mail så det låter lite mer professionellt."
  },
  {
    "speaker": null,
    "timestamp": "00:21:11",
    "line": "Och så kommer det ändå ett vettigt mail som är typ så här, jag har lite feedback till dig, bla bla bla."
  },
  {
    "speaker": null,
    "timestamp": "00:21:19",
    "line": "Men också att det är väldigt tekniska texter, kan du skriva det här så att en icke-teknisk person förstår det på ett bra sätt?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:30",
    "line": "Ja exakt, och det är ju sånt jag tror att det här kommer slå i till slut, när folk har satt sig ner och faktiskt förstår vad det gör."
  },
  {
    "speaker": null,
    "timestamp": "00:21:38",
    "line": "Vi har testat lite på jobbet."
  },
  {
    "speaker": null,
    "timestamp": "00:21:44",
    "line": "Det är svårt att förklara vad det är utan att ge alltför mycket iväg."
  },
  {
    "speaker": null,
    "timestamp": "00:21:47",
    "line": "Det tror jag inte jag får göra."
  },
  {
    "speaker": null,
    "timestamp": "00:21:49",
    "line": "Men vi har ett formulär där man ska fylla i text som visas för slutanvändare."
  },
  {
    "speaker": null,
    "timestamp": "00:21:55",
    "line": "Och den texten ska innehålla ganska mycket fakta."
  },
  {
    "speaker": null,
    "timestamp": "00:21:58",
    "line": "Då har vi testat att köra OpenAI API."
  },
  {
    "speaker": null,
    "timestamp": "00:22:04",
    "line": "Och då slänger man in då så här, \"\"Ja men här är vår fakta, skriv en text som följer det här formatet typ.\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:22:12",
    "line": "Och den är hyfsad på att spotta ur sig ändå ganska bra texter."
  },
  {
    "speaker": null,
    "timestamp": "00:22:17",
    "line": "Så jag tror att, nu har vi inte gått live med det här än, men jag tror ändå att om vi labbar lite mer så kommer det att kunna spara ganska mycket tid för de som sitter och skriver de här texterna."
  },
  {
    "speaker": null,
    "timestamp": "00:22:24",
    "line": "Mm, spännande."
  },
  {
    "speaker": null,
    "timestamp": "00:22:27",
    "line": "Men ja, alltså annars har man väl också hört SCO-texter kanske, eventuellt."
  },
  {
    "speaker": null,
    "timestamp": "00:22:33",
    "line": "Det här ger mig också lite skräck, jag menar riten kring att skriva en teknisk rapport som du skickar in och så kommer det en språkprofessor och rejekta dig 500 gånger för att du har skrivit det i jag-form."
  },
  {
    "speaker": null,
    "timestamp": "00:22:51",
    "line": "Och inte i liksom, alltså det är, det är fan..."
  },
  {
    "speaker": null,
    "timestamp": "00:22:56",
    "line": "Jo men exakt, men det är lite samma som du var inne på tidigare med ditt Ruby exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:23:00",
    "line": "Jag tror att det är en risk om man tror att nu behöver jag inte lära mig att skriva bra tekniska texter eller vad det nu kan vara."
  },
  {
    "speaker": null,
    "timestamp": "00:23:09",
    "line": "Utan man måste fortfarande kunna liksom, på samma sätt som det är lättare om du kan Ruby att utvärdera resultatet."
  },
  {
    "speaker": null,
    "timestamp": "00:23:17",
    "line": "så kanske de här texterna som ChatGPT spottar ur sig eller GPT är urusla om du inte kan bedöma dem."
  },
  {
    "speaker": null,
    "timestamp": "00:23:24",
    "line": "Jo, men det beror ju också lite på vilken nivå du är."
  },
  {
    "speaker": null,
    "timestamp": "00:23:28",
    "line": "Alltså går du i typ högstadiet eller gymnasiet kanske, så då behöver du kanske inte ha en nivå som är..."
  },
  {
    "speaker": null,
    "timestamp": "00:23:36",
    "line": "Alltså..."
  },
  {
    "speaker": null,
    "timestamp": "00:23:38",
    "line": "På den... Då behöver du kanske inte vara på den nivån att det är detaljer som kan make or break fakta, liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:23:46",
    "line": "Nej, så kan det vara."
  },
  {
    "speaker": null,
    "timestamp": "00:23:48",
    "line": "Jag undrar om jag inte såg någon rubrik om att någon universitetsstudent i Lund kanske slänger ur med det."
  },
  {
    "speaker": null,
    "timestamp": "00:23:53",
    "line": "Tänk att de är lite lite sämre än Uppsala."
  },
  {
    "speaker": null,
    "timestamp": "00:23:55",
    "line": "Är det för Lund där?"
  },
  {
    "speaker": null,
    "timestamp": "00:23:57",
    "line": "Det var någon där som hade blivit anmäld för fusk."
  },
  {
    "speaker": null,
    "timestamp": "00:24:03",
    "line": "Och de trodde att de hade använt en AI."
  },
  {
    "speaker": null,
    "timestamp": "00:24:05",
    "line": "Det fanns två grejer här som jag tyckte var intressant."
  },
  {
    "speaker": null,
    "timestamp": "00:24:08",
    "line": "Det ena var att de sa typ såhär \"\"Texten innehöll massa referenser till böcker som inte finns\"\"."
  },
  {
    "speaker": null,
    "timestamp": "00:24:13",
    "line": "Det lutar väl ändå kanske åt, det är ett ganska tydligt tecken på att det förmodligen är så."
  },
  {
    "speaker": null,
    "timestamp": "00:24:24",
    "line": "Men sen stod det också att de hade utvärderat texten med någon programvara som hade bedömt att det var 99,9% sannolikhet att den var skriven av en AI."
  },
  {
    "speaker": null,
    "timestamp": "00:24:37",
    "line": "Och det går såvitt jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:24:41",
    "line": "Så det skulle vara en AI som bedömde en annan AI?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:47",
    "line": "Ja, och jag vet att det finns online tjänster för det som påstår att de kan det."
  },
  {
    "speaker": null,
    "timestamp": "00:24:52",
    "line": "Men jag har inte sett något bevis på att de faktiskt kan bedöma texterna olika, att de kan se skillnad på dem."
  },
  {
    "speaker": null,
    "timestamp": "00:25:00",
    "line": "Och jag vet att OpenAI har någon egen AI-bedömning om det här är en AI-text eller inte tjänst."
  },
  {
    "speaker": null,
    "timestamp": "00:25:08",
    "line": "Och dom påstår att dom har ungefär kanske, jag vet inte, nu var det ett tag sedan jag kollade, men typ 30% träffsäkerhet."
  },
  {
    "speaker": null,
    "timestamp": "00:25:14",
    "line": "- Mm. - Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:25:18",
    "line": "Och det där känns ju också som att det kommer att bli, alltså det kommer ju garanterat vara någon som blir liksom anklagad för att skriva något med AI, fast aldrig har gjort det."
  },
  {
    "speaker": null,
    "timestamp": "00:25:26",
    "line": "Ja det där får man nog passa sig jävligt mycket för alltså."
  },
  {
    "speaker": null,
    "timestamp": "00:25:31",
    "line": "Och då ska vi inte komma igen på det med bias inom tekniska grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:25:37",
    "line": "Herregud vilka trubbel vi skulle kunna försätta oss i tänker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:25:41",
    "line": "För att man också börjar lita blind på den här skiten."
  },
  {
    "speaker": null,
    "timestamp": "00:25:43",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:25:44",
    "line": "Ja nu sa jag skiten men det är lite så jag känner."
  },
  {
    "speaker": null,
    "timestamp": "00:25:46",
    "line": "Jag tycker inte att livet blir bättre med AI."
  },
  {
    "speaker": null,
    "timestamp": "00:25:50",
    "line": "Jag är väldigt skeptisk."
  },
  {
    "speaker": null,
    "timestamp": "00:25:52",
    "line": "Jag är också bakåtsträv..."
  },
  {
    "speaker": null,
    "timestamp": "00:25:54",
    "line": "Jag tror det behövs, jag uppskattar folk som experimenterar med det och försöker bygga ganska vettiga tjänster."
  },
  {
    "speaker": null,
    "timestamp": "00:26:04",
    "line": "Det finns ändå användarfall som jag tycker att det där skulle nog kunna funka."
  },
  {
    "speaker": null,
    "timestamp": "00:26:10",
    "line": "Men det är också väldigt många som tror att det här är the holy grail."
  },
  {
    "speaker": null,
    "timestamp": "00:26:15",
    "line": "Det är nu vi har, det här kommer lösa alla världens problem för att vi har det här."
  },
  {
    "speaker": null,
    "timestamp": "00:26:20",
    "line": "Alltså det finns så många LinkedIn influencers som sprider att \"\"om inte ditt bolag har sadlat om och satsar på AI nu då är ni körda\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:26:33",
    "line": "\"\"Om inte ditt bolag använder typ chatt-GPT i er verksamhet då är ni körda\"\" och det där är ju domedagsprofessina."
  },
  {
    "speaker": null,
    "timestamp": "00:26:41",
    "line": "Det är ju, vet du vad det är? Det är samma personer som innan det här pratade om NFT och krypto."
  },
  {
    "speaker": null,
    "timestamp": "00:26:48",
    "line": "Oj, oj, oj, det här är kulen du vill dö på så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:26:53",
    "line": "Alla personer som nu älskar AI, de älskade ju krypto och NFT för sex månader sedan."
  },
  {
    "speaker": null,
    "timestamp": "00:27:03",
    "line": "Ja, jag har svårt att se det, men jag hoppas att det här blir lite som 3D-TV hemma."
  },
  {
    "speaker": null,
    "timestamp": "00:27:10",
    "line": "Ja, 3D-TV hemma, det fanns det ingen användning för."
  },
  {
    "speaker": null,
    "timestamp": "00:27:16",
    "line": "Här känns det ändå som att det finns någonting."
  },
  {
    "speaker": null,
    "timestamp": "00:27:20",
    "line": "Jag tror ändå att det här kommer påverka ganska mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:27:23",
    "line": "Redan nu, det är ju svintidigt än ska sägas, så har ju liksom så här..."
  },
  {
    "speaker": null,
    "timestamp": "00:27:29",
    "line": "Om man pratar bara textgenereringen med typ Copilot som exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:27:34",
    "line": "Jag tycker ju att den ger mig lite värde."
  },
  {
    "speaker": null,
    "timestamp": "00:27:36",
    "line": "Jag vet inte hur värt det är i längden, men den kommer ju förbättras."
  },
  {
    "speaker": null,
    "timestamp": "00:27:43",
    "line": "Det är så tidigt, det är en helt ny teknik egentligen, en ny teknologi."
  },
  {
    "speaker": null,
    "timestamp": "00:27:48",
    "line": "Och jag tror ändå att det kommer finnas någon värde i det."
  },
  {
    "speaker": null,
    "timestamp": "00:27:51",
    "line": "Vilket det absolut inte gjorde i 3D-TV hemma."
  },
  {
    "speaker": null,
    "timestamp": "00:27:54",
    "line": "Nej, det är sant. Men jag är ju inte en person som känner att jag är redo att betala för Copilot."
  },
  {
    "speaker": null,
    "timestamp": "00:28:01",
    "line": "Nej, men precis."
  },
  {
    "speaker": null,
    "timestamp": "00:28:03",
    "line": "Så pass mycket värde tycker jag inte att det ger mig. Nu när jag har den, den skadar mig inte så mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:28:09",
    "line": "Det är ganska nice. Men när min 60-dagars-trial går ut kommer jag nog inte känna att den här ska jag börja betala för."
  },
  {
    "speaker": null,
    "timestamp": "00:28:15",
    "line": "Nej, jag håller med. Jag tycker inte heller att den ger mig liksom..."
  },
  {
    "speaker": null,
    "timestamp": "00:28:20",
    "line": "Jag tror att den sparar mig lite tid varje dag. Det tror jag absolut."
  },
  {
    "speaker": null,
    "timestamp": "00:28:24",
    "line": "Men jag vet inte om det är värt pengarna."
  },
  {
    "speaker": null,
    "timestamp": "00:28:26",
    "line": "Nej, och sen för chatt-GPT, jag förstår användningen och jag förstår att det här är här för att stanna, att det kommer och jag tror att jag fan vill leva i förnekelse ett tag till."
  },
  {
    "speaker": null,
    "timestamp": "00:28:36",
    "line": "Men jag som inte gillar att läsa mycket saker, alltså chatt-GPT är tjatig alltså. Det är jättemycket text, det är massa utfyllnadsord och man bara \"\"Uch, måste jag läsa allt här?\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:28:46",
    "line": "Det där är det enda tipset jag har här som kommer faktiskt vara något praktiskt tips om det här."
  },
  {
    "speaker": null,
    "timestamp": "00:28:51",
    "line": "Du kan ju skriva i ditt meddelande, svara så kort som möjligt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:54",
    "line": "Så kommer du få ett väldigt kort svar."
  },
  {
    "speaker": null,
    "timestamp": "00:28:56",
    "line": "Men gud vad otrevligt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:58",
    "line": "Alltså jag känner ju..."
  },
  {
    "speaker": null,
    "timestamp": "00:29:00",
    "line": "Det är inte människa Therese."
  },
  {
    "speaker": null,
    "timestamp": "00:29:02",
    "line": "Nej men jag känner att jag måste vara trevlig mot AI-n."
  },
  {
    "speaker": null,
    "timestamp": "00:29:05",
    "line": "För när Skynet kommer, då kommer någon komma ihåg mig som en trevlig användare."
  },
  {
    "speaker": null,
    "timestamp": "00:29:11",
    "line": "Jag brukar i och för sig säga tack till Siri, nej inte till Siri, till Alexa när jag pratar med henne hemma."
  },
  {
    "speaker": null,
    "timestamp": "00:29:16",
    "line": "Du har ju inte att säga henne också."
  },
  {
    "speaker": null,
    "timestamp": "00:29:18",
    "line": "Ja, nu är det snart här. Men ja, hitta användningsområden i jobbet. Jag vet inte, kommer det ta våra jobb?"
  },
  {
    "speaker": null,
    "timestamp": "00:29:31",
    "line": "Alltså gud, jag hoppas det. Jag är så trött."
  },
  {
    "speaker": null,
    "timestamp": "00:29:33",
    "line": "Jag tror inte det kommer ta våra jobb. Jag tror att det kommer förenkla ganska mycket av våra jobb i längden."
  },
  {
    "speaker": null,
    "timestamp": "00:29:39",
    "line": "Men det är inte som många som säger att i nästa år finns det inga utvecklare längre."
  },
  {
    "speaker": null,
    "timestamp": "00:29:44",
    "line": "Man bara \"\"Nu lugnar vi oss\"\"."
  },
  {
    "speaker": null,
    "timestamp": "00:29:48",
    "line": "Ja då tror jag inte riktigt att man vet vad vi gör."
  },
  {
    "speaker": null,
    "timestamp": "00:29:52",
    "line": "Nej exakt. Alltså det är ganska mycket tid som inte är att skriva kod."
  },
  {
    "speaker": null,
    "timestamp": "00:29:59",
    "line": "Ja alltså de här senaste veckorna har jag ju spenderat en majoritet med att bara prata med andra individer om uppgifter liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:30:09",
    "line": "Ja men exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:12",
    "line": "- Nej, jag tycker... - Du ser chatt-GPT göra det va?"
  },
  {
    "speaker": null,
    "timestamp": "00:30:16",
    "line": "Nu har vi betat av det här avsnittet."
  },
  {
    "speaker": null,
    "timestamp": "00:30:20",
    "line": "Jag ska inte lova något, men det kommer fan vara lång tid innan vi pratar om AI igen."
  },
  {
    "speaker": null,
    "timestamp": "00:30:26",
    "line": "- Ja, eller? - Ja, kanske tills jag har ändrat mig och bygger en jävla tjänst med AI som..."
  },
  {
    "speaker": null,
    "timestamp": "00:30:34",
    "line": "- Exakt, du har ändå tränat tjänster på AI som en kul grej. - Ja, ja, ja, men det där..."
  },
  {
    "speaker": null,
    "timestamp": "00:30:41",
    "line": "Transkriberingen på sidan."
  },
  {
    "speaker": null,
    "timestamp": "00:30:43",
    "line": "Ja just det, den använder också AI."
  },
  {
    "speaker": null,
    "timestamp": "00:30:45",
    "line": "Men..."
  },
  {
    "speaker": null,
    "timestamp": "00:30:47",
    "line": "Ehh..."
  },
  {
    "speaker": null,
    "timestamp": "00:30:49",
    "line": "Annars kan vi ha ett avsnitt bara om NFT"
  },
  {
    "speaker": null,
    "timestamp": "00:30:51",
    "line": "för att höra dig gå upp i"
  },
  {
    "speaker": null,
    "timestamp": "00:30:53",
    "line": "limningen."
  },
  {
    "speaker": null,
    "timestamp": "00:30:55",
    "line": "Ja, nej det..."
  },
  {
    "speaker": null,
    "timestamp": "00:30:57",
    "line": "Vi behöver inte gå dit."
  },
  {
    "speaker": null,
    "timestamp": "00:30:59",
    "line": "Det vet du vad det är?"
  },
  {
    "speaker": null,
    "timestamp": "00:31:01",
    "line": "Det är fan mer värdelöst än 3D-TV hemma."
  },
  {
    "speaker": null,
    "timestamp": "00:31:03",
    "line": "Hahaha..."
  },
  {
    "speaker": null,
    "timestamp": "00:31:05",
    "line": "En curved-TV också."
  },
  {
    "speaker": null,
    "timestamp": "00:31:09",
    "line": "- Bara om samtidigt. - Ja, nej jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:31:11",
    "line": "Det där, nej, vi är på väg in i en mörk del av världen nu."
  },
  {
    "speaker": null,
    "timestamp": "00:31:17",
    "line": "Jag hör också en katt som skriker bakom mig."
  },
  {
    "speaker": null,
    "timestamp": "00:31:21",
    "line": "Jag sitter ju instängd här."
  },
  {
    "speaker": null,
    "timestamp": "00:31:23",
    "line": "Vi kanske säger så på den här gången."
  },
  {
    "speaker": null,
    "timestamp": "00:31:28",
    "line": "- Ja, vi får nog göra det. - Toppen att ni lyssnar."
  },
  {
    "speaker": null,
    "timestamp": "00:31:32",
    "line": "Vi blir väldigt glada för det."
  },
  {
    "speaker": null,
    "timestamp": "00:31:34",
    "line": "Fortsätt höra av er med avsnittsförslag och allt sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:31:37",
    "line": "och allt sånt. Skicka in skämt och sånt. Allt går att göra på vår hemsida nu."
  },
  {
    "speaker": null,
    "timestamp": "00:31:40",
    "line": "- Skicka skämt till mig istället. - Ja men det kan ni också göra."
  },
  {
    "speaker": null,
    "timestamp": "00:31:43",
    "line": "Skicka skämt direkt till Therese om ni har någon kontaktväg."
  },
  {
    "speaker": null,
    "timestamp": "00:31:46",
    "line": "Om vi är så ledsen är det bara jag som får alla."
  },
  {
    "speaker": null,
    "timestamp": "00:31:48",
    "line": "- Exakt, det känns fel. - Ja, just det. Följ oss på Instagram."
  },
  {
    "speaker": null,
    "timestamp": "00:31:52",
    "line": "- Det finns trevligt content där. - Fick jag Instagram?"
  },
  {
    "speaker": null,
    "timestamp": "00:31:55",
    "line": "- Kanske. - Okej, det här är Outro. Folk har redan lagt på."
  },
  {
    "speaker": null,
    "timestamp": "00:32:02",
    "line": "- Vi hörs igen om två veckor. - Gör vi. Hejdå."
  },
  {
    "speaker": null,
    "timestamp": "00:32:05",
    "line": "Bye bye!"
  },
  {
    "speaker": null,
    "timestamp": "00:32:07",
    "line": "Bye bye!"
  },
  {
    "speaker": null,
    "timestamp": "00:32:09",
    "line": "[Musik spelas]"
  }
]
