[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Vilken är den läskigaste datatypen?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:04",
    "line": "Jag vet, men du kan få säga det."
  },
  {
    "speaker": null,
    "timestamp": "00:00:08",
    "line": "Nej, säg det nu."
  },
  {
    "speaker": null,
    "timestamp": "00:00:12",
    "line": "Boolean."
  },
  {
    "speaker": null,
    "timestamp": "00:00:14",
    "line": "Exakt. Jajamän!"
  },
  {
    "speaker": null,
    "timestamp": "00:00:16",
    "line": "Fan, ibland."
  },
  {
    "speaker": null,
    "timestamp": "00:00:18",
    "line": "Ibland, ibland."
  },
  {
    "speaker": null,
    "timestamp": "00:00:20",
    "line": "Jag kan också dra ett skämt nu, bara för det här."
  },
  {
    "speaker": null,
    "timestamp": "00:00:22",
    "line": "Det blir en dubbel idag."
  },
  {
    "speaker": null,
    "timestamp": "00:00:24",
    "line": "Det här är ett skämt för vilka av våra lyssnare i Baltic."
  },
  {
    "speaker": null,
    "timestamp": "00:00:26",
    "line": "Och det passar väldigt bra för det är Halloween."
  },
  {
    "speaker": null,
    "timestamp": "00:00:28",
    "line": "Jag måste, och Cliffhanger måste hitta skämtet."
  },
  {
    "speaker": null,
    "timestamp": "00:00:32",
    "line": "Fuck, eller fuck."
  },
  {
    "speaker": null,
    "timestamp": "00:00:34",
    "line": "Jag ska inte svara i podden, men det är här någonstans."
  },
  {
    "speaker": null,
    "timestamp": "00:00:36",
    "line": "Okej, nu."
  },
  {
    "speaker": null,
    "timestamp": "00:00:38",
    "line": "Vilket ramverk gör fronten du utvecklar det rädda?"
  },
  {
    "speaker": null,
    "timestamp": "00:00:42",
    "line": "Jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:00:48",
    "line": "Bootstrap."
  },
  {
    "speaker": null,
    "timestamp": "00:00:50",
    "line": "Oj, vilken blast from the past."
  },
  {
    "speaker": null,
    "timestamp": "00:00:56",
    "line": "Jajamän, fan vilken härlig start idag."
  },
  {
    "speaker": null,
    "timestamp": "00:01:00",
    "line": "Men alltså, är det Halloween nu?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:04",
    "line": "Nej, jag vet inte. Alldeles strax, innan folk har lagt på det här avsnittet"
  },
  {
    "speaker": null,
    "timestamp": "00:01:08",
    "line": "så ska vi prata om någonting som jag har sett fram emot att prata om i tre år."
  },
  {
    "speaker": null,
    "timestamp": "00:01:12",
    "line": "Och ingen överdrift, men absolut, det är väl Halloween den här helgen."
  },
  {
    "speaker": null,
    "timestamp": "00:01:16",
    "line": "Varför tänker du alltid att alla ska sätta på avsnittet och stänga av direkt?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:20",
    "line": "Bara för att vi blajar."
  },
  {
    "speaker": null,
    "timestamp": "00:01:22",
    "line": "Ja, men folk gillar inte, jag tänker att folk har en lägre tröskel för de här ordvitsarna än vad vi har."
  },
  {
    "speaker": null,
    "timestamp": "00:01:28",
    "line": "Men också, om folk inte bara vill höra blaj, då bör de verkligen inte lyssna på den här podden."
  },
  {
    "speaker": null,
    "timestamp": "00:01:34",
    "line": "Alltså förlåt, men nej."
  },
  {
    "speaker": null,
    "timestamp": "00:01:36",
    "line": "Så kan det absolut vara. Det är absolut så."
  },
  {
    "speaker": null,
    "timestamp": "00:01:40",
    "line": "Men ja, du har helt rätt."
  },
  {
    "speaker": null,
    "timestamp": "00:01:42",
    "line": "Men ja, Halloween den här helgen, eller allhelgorna är det väl i Sverige, om man ska vara svensk."
  },
  {
    "speaker": null,
    "timestamp": "00:01:48",
    "line": "Men det är också så himla stökigt för att det är ingen som vet när det är rätt."
  },
  {
    "speaker": null,
    "timestamp": "00:01:52",
    "line": "Och det betyder att det kommer komma folk att ringa på i flera olika dagar"
  },
  {
    "speaker": null,
    "timestamp": "00:01:56",
    "line": "för att några missade och några kör den här helgen och några kör söndagen."
  },
  {
    "speaker": null,
    "timestamp": "00:02:00",
    "line": "Ja, jag kollade också min kalender, det är tydligen nästa helg som det är, eller allhelgorna."
  },
  {
    "speaker": null,
    "timestamp": "00:02:04",
    "line": "Ja, okej. Vad bra då."
  },
  {
    "speaker": null,
    "timestamp": "00:02:07",
    "line": "Ja, men det blir det ändå. Det här avsnittet är ju Halloween-avsnittet."
  },
  {
    "speaker": null,
    "timestamp": "00:02:11",
    "line": "Okej, okej, okej."
  },
  {
    "speaker": null,
    "timestamp": "00:02:13",
    "line": "Ja, och det här avsnittet är det du har sett fram emot."
  },
  {
    "speaker": null,
    "timestamp": "00:02:18",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:02:20",
    "line": "I hela poddens livstid."
  },
  {
    "speaker": null,
    "timestamp": "00:02:22",
    "line": "Ja, i stort sett. Alltså det är verkligen bokstavligen tre år sedan som det här vi ska prata om nu föddes."
  },
  {
    "speaker": null,
    "timestamp": "00:02:28",
    "line": "Och jag har liksom svårt att..."
  },
  {
    "speaker": null,
    "timestamp": "00:02:31",
    "line": "Alltså jag är så fruktansvärt taggad."
  },
  {
    "speaker": null,
    "timestamp": "00:02:34",
    "line": "Men jag har svårt att bestämma vart det ska börja."
  },
  {
    "speaker": null,
    "timestamp": "00:02:37",
    "line": "Men du var ju ändå med när det här började."
  },
  {
    "speaker": null,
    "timestamp": "00:02:41",
    "line": "Ja, jag var inte så engagerad."
  },
  {
    "speaker": null,
    "timestamp": "00:02:47",
    "line": "Nej, det var du inte. Du var absolut inte så engagerad."
  },
  {
    "speaker": null,
    "timestamp": "00:02:49",
    "line": "Men du kan ju minnas ungefär snacket som gick."
  },
  {
    "speaker": null,
    "timestamp": "00:02:54",
    "line": "Kan du ge oss två minuters intro till vad det var?"
  },
  {
    "speaker": null,
    "timestamp": "00:02:59",
    "line": "Två minuter är jättelång tid. Kan du ge mig tjugo sekunders intro till vad som hände?"
  },
  {
    "speaker": null,
    "timestamp": "00:03:03",
    "line": "Nej, men det här var väl liksom mitt under pandemin i princip."
  },
  {
    "speaker": null,
    "timestamp": "00:03:10",
    "line": "Och då var alla hemma och vi hängde inte så mycket på kontoret och så."
  },
  {
    "speaker": null,
    "timestamp": "00:03:14",
    "line": "Så att helt plötsligt började det också dyka upp lite skumma saker överallt."
  },
  {
    "speaker": null,
    "timestamp": "00:03:18",
    "line": "Det var liksom en ny okänd person i slacken."
  },
  {
    "speaker": null,
    "timestamp": "00:03:22",
    "line": "Det var något typ av märkligt instakonto som började följa."
  },
  {
    "speaker": null,
    "timestamp": "00:03:26",
    "line": "Det var liksom att ingen annan än den mystiska personen var admin på slack längre."
  },
  {
    "speaker": null,
    "timestamp": "00:03:33",
    "line": "Så började poppa upp sticker på kontoret och med en märklig logga på och sådana grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:03:38",
    "line": "Och sen så nyster det där upp mer och mer."
  },
  {
    "speaker": null,
    "timestamp": "00:03:41",
    "line": "Jag kommer inte ihåg hur det startade men det var liksom att det var som ett mysterium som alla behövde komma tillsammans för att lösa."
  },
  {
    "speaker": null,
    "timestamp": "00:03:50",
    "line": "Och så startades det någon kanal för att diskutera det där och så fort någon sa något så sa alla sus."
  },
  {
    "speaker": null,
    "timestamp": "00:03:57",
    "line": "För det var då när man körde det här, vad heter det spelet?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:00",
    "line": "Among Us."
  },
  {
    "speaker": null,
    "timestamp": "00:04:01",
    "line": "Just det, Among Us där alla var sus."
  },
  {
    "speaker": null,
    "timestamp": "00:04:04",
    "line": "Så det blev Among Us emojis och grejer så fort någon sa något."
  },
  {
    "speaker": null,
    "timestamp": "00:04:08",
    "line": "Om vem som låg bakom det här liksom."
  },
  {
    "speaker": null,
    "timestamp": "00:04:11",
    "line": "Men ja, det var ett mysterium."
  },
  {
    "speaker": null,
    "timestamp": "00:04:15",
    "line": "Så det blev en stor del av det här och så sprev det hem till folk, folk la in info i kanalen, folk samarbetade för att lösa det."
  },
  {
    "speaker": null,
    "timestamp": "00:04:22",
    "line": "Jag kommer också ihåg att du sa till mig en gång, det här mysteriet, det var också någon gång när vi skulle spela in några av våra första avsnitt."
  },
  {
    "speaker": null,
    "timestamp": "00:04:29",
    "line": "Och du bara, har du sett det här mysteriet eller något?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:32",
    "line": "Jag bara, ja jag bryr mig inte."
  },
  {
    "speaker": null,
    "timestamp": "00:04:34",
    "line": "Du bara, ja okej."
  },
  {
    "speaker": null,
    "timestamp": "00:04:36",
    "line": "Nej exakt, för det här mysteriet."
  },
  {
    "speaker": null,
    "timestamp": "00:04:40",
    "line": "Jag och en till kollega och kompis, jag fick en idé om då att, just det var ju under pandemin, alla kämpade ju med hur fan funkar det att vara helt remote?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:55",
    "line": "Hur bygger man en kultur kring det?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:57",
    "line": "Hur får man någon typ av sammanhållning?"
  },
  {
    "speaker": null,
    "timestamp": "00:05:00",
    "line": "Och det var ju väldigt, inte bara att vara remote utan det var ju en jävla speciell situation i övrigt i att folk var isolerade och man träffade inte så mycket folk och sådär."
  },
  {
    "speaker": null,
    "timestamp": "00:05:08",
    "line": "Och då fick jag en idé då att jag skulle försöka skapa någon typ av gemensam fiende då till konsultbolaget som jag jobbade på och som du jobbade på då."
  },
  {
    "speaker": null,
    "timestamp": "00:05:21",
    "line": "Och då landade egentligen i att vi gör det som ett mysterium, alltså vi berättar inte att vi ligger bakom det."
  },
  {
    "speaker": null,
    "timestamp": "00:05:31",
    "line": "För första gången vi körde det här, för vi ska komma tillbaka till varför jag tagit tre år att prata om det här."
  },
  {
    "speaker": null,
    "timestamp": "00:05:40",
    "line": "Men den gången då för tre år sedan, det var ju så mycket som var improviserat, alltså det var så extremt mycket som var improviserat."
  },
  {
    "speaker": null,
    "timestamp": "00:05:47",
    "line": "Men det som vi gjorde var egentligen att vi tog fram ett litet brand, vi tog fram lite bakgrundshistoria till den här organisationen om varför de hatade alla värderingar som då mitt konsultbolag står för."
  },
  {
    "speaker": null,
    "timestamp": "00:05:58",
    "line": "Och vi hittade på det här som en liten grej och sen så drog vi igång genom att jag smög runt på kontoret på kvällar och nätter och satte upp stickers med den här loggan lite här och där."
  },
  {
    "speaker": null,
    "timestamp": "00:06:12",
    "line": "Jag ritade den på whiteboard och lite allt möjligt."
  },
  {
    "speaker": null,
    "timestamp": "00:06:15",
    "line": "Och sen hade vi den här karaktären som då jojnade slack som folk först trodde var någon som hade hackat sig in i slack, eller någon som hade på något sätt tagit sig in i slack."
  },
  {
    "speaker": null,
    "timestamp": "00:06:25",
    "line": "Så den blev bannad först av en admin innan vi var tvungna att berätta att den ska vara där, den använder den, låt den vara."
  },
  {
    "speaker": null,
    "timestamp": "00:06:34",
    "line": "Och det upplägget sen var ju då som du sa där att folk behövde liksom samarbeta för att lösa olika saker."
  },
  {
    "speaker": null,
    "timestamp": "00:06:41",
    "line": "Och jag har ju verkligen ingen bra pitch kring det här på att beskriva vad det är så det är bra att vi har en halvtimme på oss."
  },
  {
    "speaker": null,
    "timestamp": "00:06:49",
    "line": "Men saker som kunde vara då var att första som skickades till exempel var att vi skickade ett brev, eller vi tejpade upp ett brev i taket på kontoret."
  },
  {
    "speaker": null,
    "timestamp": "00:06:58",
    "line": "Vilket också är kul för alla bara det måste vara en långjävel för det är så himla hög takhöjd så hur fan har de nått upp till taket?"
  },
  {
    "speaker": null,
    "timestamp": "00:07:07",
    "line": "Ja men det var också 4 meters takhöjd, det var ju liksom inte så att man tjänade jättemycket på att vara lång."
  },
  {
    "speaker": null,
    "timestamp": "00:07:12",
    "line": "Nej men det var liksom grund, såhär, ja det måste vara någon som är lång."
  },
  {
    "speaker": null,
    "timestamp": "00:07:18",
    "line": "Ja, så det skickade vi ut det och det här brevet, första puslet som man skulle lösa egentligen, det var att i det här brevet så hade vi fetmarkerat vissa saker,"
  },
  {
    "speaker": null,
    "timestamp": "00:07:32",
    "line": "strykit under vissa saker, vi hade gjort vissa texter, remsokursgivar och grejer och la man ihop dem på ett visst sätt så fick man ut en url till en hemsida."
  },
  {
    "speaker": null,
    "timestamp": "00:07:41",
    "line": "Och typ gick man till den hemsidan så hittade man en film på den här onda karaktären som satt med någon typ vit mask för ansiktet och typ en huva för och så man inte såg vem det var."
  },
  {
    "speaker": null,
    "timestamp": "00:07:53",
    "line": "Som vi också satt och spelade in hemma i min lägenhet och använde typ såhär Philips hulampor för att göra det rött runt omkring för att deras brand var rött och så vidare."
  },
  {
    "speaker": null,
    "timestamp": "00:08:03",
    "line": "Väldigt amatörmässigt, men kul. Och sen från typ den videon, typ lyssnade man på den videon så nämnde dom i videon så var det ett tal och i det talet så var det typ, det nämndes massa av det här, heter det fonetiska alfabetet?"
  },
  {
    "speaker": null,
    "timestamp": "00:08:20",
    "line": "Alltså det som är, på engelska det är ju alfa, beta, charlie."
  },
  {
    "speaker": null,
    "timestamp": "00:08:26",
    "line": "Ja, frågar du mig? Militäralfabetet?"
  },
  {
    "speaker": null,
    "timestamp": "00:08:29",
    "line": "Ja, exakt. Så det nämndes ju sånt där som ledde vidare och så vidare. Och sen, jag vet inte, det är helt omöjligt att hinna gå igenom allt, men vi körde det här då egentligen en gång och det som slutade med att man löste det där och sen så fick man lite tissjor typ."
  },
  {
    "speaker": null,
    "timestamp": "00:08:47",
    "line": "Där det stod typ SUS 2020, eller vad fan det nu var för år då, på ryggen. Och sen så tänkte de flesta så här, ja men nu kommer dom avslöja sig. Men då bestämde jag och min kompis så här, nej vi avslöjar inte att vi har lägga bakom det här, utan vi håller på det."
  },
  {
    "speaker": null,
    "timestamp": "00:09:06",
    "line": "Och sen tog det ungefär ett år och så insåg vi, fan nu kör vi en gång till. Så då tog vi fram samma organisation, kom tillbaka och skulle göra ett nytt försök."
  },
  {
    "speaker": null,
    "timestamp": "00:09:18",
    "line": "Och så hade vi ett litet annat upplägg på det, men det var samma idé med att alla skulle samarbeta med olika. Tänk att vi kan gå igenom lite grejer som vi gjorde snart, men bara för att folk ska få en överblick först."
  },
  {
    "speaker": null,
    "timestamp": "00:09:29",
    "line": "Och så körde dom där ett år, eller ett år, det var typ under tre veckor. Och i slutet på den, så den gången så fick dom ett Nintendo Switch i slutet som vi hade till kontoret som vi hade köpt in."
  },
  {
    "speaker": null,
    "timestamp": "00:09:42",
    "line": "Och sen gick det ett år till och sen så var det nu för några veckor sedan så körde vi då en tredje gång. Och den här gången så avslöjade vi oss på slutet."
  },
  {
    "speaker": null,
    "timestamp": "00:09:51",
    "line": "Så det var den stora grejen den här gången, att nu kände vi oss ganska nöjda med det här och då kan vi ändå avslöja att det är vi som ligger bakom det."
  },
  {
    "speaker": null,
    "timestamp": "00:09:58",
    "line": "Och då var det väldigt roligt för då hade vi en stor ave på kontoret där vi kom in utklädda och fick avslöja oss själva och lite sånt där."
  },
  {
    "speaker": null,
    "timestamp": "00:10:05",
    "line": "Så det var väldigt kul och då var det ett väldigt roligt koncept som har kört hela tiden. Och du var ju med första gången, eller andra också?"
  },
  {
    "speaker": null,
    "timestamp": "00:10:14",
    "line": "Nej, första tror jag. Det är kul också att du sa det där, så bestämde jag för mig att inte säga det till någon."
  },
  {
    "speaker": null,
    "timestamp": "00:10:21",
    "line": "Det gick typ en dag och du bara, mysteriet, det är jag och Emil!"
  },
  {
    "speaker": null,
    "timestamp": "00:10:25",
    "line": "Men sa jag inte det till dig när du hade sagt upp dig?"
  },
  {
    "speaker": null,
    "timestamp": "00:10:30",
    "line": "Nej, det tror jag inte. Jag tror du sa det ganska så direkt efteråt."
  },
  {
    "speaker": null,
    "timestamp": "00:10:40",
    "line": "Jag kanske var tvungen att avslöja det för någon. Jag kände inte att jag kunde sitta här och prata."
  },
  {
    "speaker": null,
    "timestamp": "00:10:45",
    "line": "Om det skulle dyka upp så skulle jag inte kunna hålla masken på dig tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:10:49",
    "line": "Nej, men det var också så att jag var ju inte den drivande i det så det var ganska safe att säga det till mig."
  },
  {
    "speaker": null,
    "timestamp": "00:10:54",
    "line": "Men jag kommer ihåg att jag fortfarande var på bolaget för att jag fick en sån otrolig känsla av att jävlar vilken bra grej ni har gjort i den här kaostiden vi befinner oss i."
  },
  {
    "speaker": null,
    "timestamp": "00:11:05",
    "line": "För sammanhållningen och få människor att ha lite social interaktion och faktiskt ha kul tillsammans."
  },
  {
    "speaker": null,
    "timestamp": "00:11:12",
    "line": "Jag kommer ihåg att det verkligen var så här, jävlar vad bra! Så att jag var kvar."
  },
  {
    "speaker": null,
    "timestamp": "00:11:19",
    "line": "Det är verkligen en av de sakerna jag har gjort som är det absolut roligaste."
  },
  {
    "speaker": null,
    "timestamp": "00:11:26",
    "line": "Eller det som jag har känt varit mest lyckat eller det som har fått mest uppskattning."
  },
  {
    "speaker": null,
    "timestamp": "00:11:30",
    "line": "Och en grej som jag har kunnat njuta av uppskattningen utan att min narcissistiska sida har tagit över."
  },
  {
    "speaker": null,
    "timestamp": "00:11:37",
    "line": "Jag skrikade och jag som gjorde det. Hylla mig, hylla mig allihopa, folket."
  },
  {
    "speaker": null,
    "timestamp": "00:11:42",
    "line": "För att du fick inte avslöja det heller."
  },
  {
    "speaker": null,
    "timestamp": "00:11:45",
    "line": "Jag hade ju kunnat gjort det men det som gjorde att vi inte avslöjade oss var ju att det var så jävla roligt att folk gick runt och misstänkte vilka det var."
  },
  {
    "speaker": null,
    "timestamp": "00:11:55",
    "line": "Det var ju en stor diskussionspunkt som dök upp framförallt under de här intensiva veckorna när vi körde varje år."
  },
  {
    "speaker": null,
    "timestamp": "00:12:02",
    "line": "Men också då och då under året så kunde vi bara säga, men fan kommer ni ihåg det här mysteriumet?"
  },
  {
    "speaker": null,
    "timestamp": "00:12:07",
    "line": "Vilka är det som låg bakom det? Och det diskuterades, är det en inköpt produkt?"
  },
  {
    "speaker": null,
    "timestamp": "00:12:13",
    "line": "Eller är det någon här som gör det? Eller vart kommer det ifrån? Vilka är inblandade?"
  },
  {
    "speaker": null,
    "timestamp": "00:12:19",
    "line": "Och det var ju en stor anledning till att vi tyckte att fan vad kul det här är att göra internt på bolaget."
  },
  {
    "speaker": null,
    "timestamp": "00:12:25",
    "line": "Det var ju också lite jobbigt för att man började tåga ner grund och ljuga för alla men det var ändå en väldigt rolig detalj."
  },
  {
    "speaker": null,
    "timestamp": "00:12:32",
    "line": "Ja, det var ju ganska kul också för att det var väl ett sätt för dig att liksom låtsas som att det inte var du för du var väldigt engagerad i det också."
  },
  {
    "speaker": null,
    "timestamp": "00:12:43",
    "line": "Du var ju ganska drivande i att lösa mysteriet i gruppen."
  },
  {
    "speaker": null,
    "timestamp": "00:12:46",
    "line": "Jag kommer också ihåg någon gång där någon sa suss om mig och du bara, nej nej det är inte hon. Jag har frågat hon fattar ingenting."
  },
  {
    "speaker": null,
    "timestamp": "00:12:53",
    "line": "Jajamän, nej men det är så var det absolut. Eftersom vi kan återkomma till det här så kan jag berätta lite saker som vi har gjort."
  },
  {
    "speaker": null,
    "timestamp": "00:13:02",
    "line": "För jag tror att det är lättare att få en förståelse av vad som behövs för att lösa saker."
  },
  {
    "speaker": null,
    "timestamp": "00:13:06",
    "line": "Tittar man första gången så var det så här att vi hade det här brevet, vi hade den här lilla filmen, man skulle lösa från det som läses upp."
  },
  {
    "speaker": null,
    "timestamp": "00:13:16",
    "line": "Men sen från där så gick det till ganska mycket mer tekniska saker."
  },
  {
    "speaker": null,
    "timestamp": "00:13:19",
    "line": "Vi hade till exempel ett webbaserat textspel, alltså ett klassiskt gammalt spel där man typ är så här, du är i en grotta."
  },
  {
    "speaker": null,
    "timestamp": "00:13:29",
    "line": "Du ser det här framför dig, vad vill du göra? Vill du gå åt höger, gå åt vänster eller plocka upp en sten?"
  },
  {
    "speaker": null,
    "timestamp": "00:13:35",
    "line": "Alltså typ ett sånt som min kompis Emil byggde som var helt webbaserat och där man skulle lösa det här spelet genom att hitta lite saker och hitta saker därifrån som låste upp dörrar."
  },
  {
    "speaker": null,
    "timestamp": "00:13:51",
    "line": "Och sen när man kom till slutet så kom man fram till typ en spegel och den spegeln så stod det bara, när man kom dit så stod det ofta bara typ så här, spegeln stirrar tillbaka på dig men den blinkar en gång."
  },
  {
    "speaker": null,
    "timestamp": "00:14:03",
    "line": "Och då hade vi byggt så att man var tvungen att lösa det här flera personer samtidigt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:07",
    "line": "Så om två personer kom till den här spegeln i slutet samtidigt så trodde spegeln stirra tillbaka men den blinkar två gånger."
  },
  {
    "speaker": null,
    "timestamp": "00:14:13",
    "line": "Och då var det byggt så att jag tror att vi hade åtta personer, eller tio kanske, som då behövde komma till slutet av spegeln samtidigt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:19",
    "line": "Och det där upptäcktes ganska snabbt, det fanns väl nog ledtrådar som liksom hintade om det."
  },
  {
    "speaker": null,
    "timestamp": "00:14:23",
    "line": "Men, och det gjorde ju då att folk liksom drog in folk, att hörni vi behöver hjälp med att lösa det här spelet, kan ni liksom komma hit och köra det här spelet med oss."
  },
  {
    "speaker": null,
    "timestamp": "00:14:33",
    "line": "Och det var ju liksom det som var lite poängen med det, att så här folk skulle behöva dra in andra för att samarbeta och liksom förklara vad man skulle göra och liksom allting sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:43",
    "line": "Och det tycker jag funkar väldigt bra."
  },
  {
    "speaker": null,
    "timestamp": "00:14:45",
    "line": "Ja, organiserat lite. Var det det där som du sa att du typ panikpushade en buggfix mitt under brinnande?"
  },
  {
    "speaker": null,
    "timestamp": "00:14:53",
    "line": "Nej, det var inte det. För att det här var första året och då var väldigt mycket improviserat, storyn hängde inte ihop så mycket, det var väldigt mycket konstiga saker."
  },
  {
    "speaker": null,
    "timestamp": "00:15:02",
    "line": "Alltså, en sak vi gjorde första året som jag tyckte var ganska kul var liksom att vi skickade ut 30 fysiska brev hem till mina kollegor."
  },
  {
    "speaker": null,
    "timestamp": "00:15:10",
    "line": "Och på de här breven så var det liksom en liten liten del av en rebus. Sen var rebusen helt värdelös egentligen. Alltså det var typ referenser till Sagan och ringen av någon jävla anledning."
  },
  {
    "speaker": null,
    "timestamp": "00:15:21",
    "line": "Alltså det var massa jävla skit. Men det i sin tur ledde till en annan grej som var också en, som blev en återkommande sak som kanske var det roligaste."
  },
  {
    "speaker": null,
    "timestamp": "00:15:32",
    "line": "Och det är att vi byggde en telefonsvarare. Alltså en telefonsvarare som i en sån här att man ringer till banken och så får man ett alternativ att typ tryck fyra för att kolla ditt saldo."
  },
  {
    "speaker": null,
    "timestamp": "00:15:44",
    "line": "Och vi byggde då en sådan med ett API som heter 46Elks, eller en tjänst som de har. Och då var det liksom ett riktigt telefonnummer som vi hade byggt en liten Node-snurra bakom som liksom stod och tog emot massa samtal."
  },
  {
    "speaker": null,
    "timestamp": "00:15:56",
    "line": "Och baserat i den då så kunde man hitta olika ledtråd som ledde en vidare och så där. Och då var det också någonting om att man var tvungen att vara ett visst antal personer för att lösa det."
  },
  {
    "speaker": null,
    "timestamp": "00:16:06",
    "line": "Det var mycket sånt som återkom. Och jag tror att slutet på den här första omgången då, som var för tre år sedan, det var att då hade vi byggt någon liten site om jag minns rätt, där man var tvungen att fylla i något lösnord i ordning."
  },
  {
    "speaker": null,
    "timestamp": "00:16:28",
    "line": "Jag tror att man var tvungen att vara inne 20 personer på hemsidan för att den skulle låsa upp och sen kunde man fylla i ett lösnord. Och sen efter det så vann man. Och allt som sagt, första året, det var så oerhört improviserat."
  },
  {
    "speaker": null,
    "timestamp": "00:16:40",
    "line": "Alltså vi byggde ju saker liksom under tiden det pågick och så att det liksom höll på. Och det var också därför jag blev ganska inblandad som du var inne på tidigare."
  },
  {
    "speaker": null,
    "timestamp": "00:16:48",
    "line": "Det var mycket saker som jag insåg ganska snabbt, var så här, jävlar vad svårt det här var. Det här kommer de aldrig komma på. Så då var jag liksom tvungen att på något sätt hitta åt vilket håll de skulle."
  },
  {
    "speaker": null,
    "timestamp": "00:17:00",
    "line": "Och det enklaste sättet för mig att göra det där var att vara aktiv själv. Sen löste jag ju ingenting i stort sett. Utan jag, när folk satt fast så slängde jag ut mig lite grann så här att, ja men nu fan har ni tänkt på det här, det kanske vi borde kolla på."
  },
  {
    "speaker": null,
    "timestamp": "00:17:16",
    "line": "Och så fick andra lösa det. För att det var ju liksom poängen. Och jag tror också att det gav mig ett ganska bra alibi. För att annars tror jag att jag hade blivit väldigt misstänkt."
  },
  {
    "speaker": null,
    "timestamp": "00:17:24",
    "line": "För att det är, många sa så här, det låter, det här känns som en grej Anton skulle ha gjort. Men han är ju så aktiv, det kan ju inte vara han, typ."
  },
  {
    "speaker": null,
    "timestamp": "00:17:30",
    "line": "Ja, men det är ju hundra procent för du hade ju liksom liknande grejer på, som vi körde på events liksom. Som du hade byggt hela. Så det är, det är verkligen Anton hela grejen."
  },
  {
    "speaker": null,
    "timestamp": "00:17:45",
    "line": "Ja, och sen så tog det ett år och så kom vi tillbaka igen. Och då var det den här panikfixen som jag tycker är en extremt rolig detalj."
  },
  {
    "speaker": null,
    "timestamp": "00:17:56",
    "line": "För det som var det året, eller det andra året, då var det lite mer genomtänkt. Då hade vi byggt en liten maskin, jag vet inte hur man ska förklara det."
  },
  {
    "speaker": null,
    "timestamp": "00:18:03",
    "line": "Men det var liksom en hemsida där man såg en typ tecknad maskin som hade en massa spakar och knappar och inputs och grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:18:09",
    "line": "Och den maskinen skulle man då ställa in på rätt sätt för att kunna stänga av den. Och så var det en liten countdown som räknade ner hur lång tid de hade på sig."
  },
  {
    "speaker": null,
    "timestamp": "00:18:17",
    "line": "Och en kollega till mig då tyckte att så här, men vad fan, det här borde vi liksom kunna bruteforcea det här. För den skickade ju bara en massa nätverksrequest."
  },
  {
    "speaker": null,
    "timestamp": "00:18:27",
    "line": "Och det upptäckte han att det kunde man göra. Samtidigt som jag stod bredvid honom och tittade på när han gjorde det här, så satt han och bara så här, fan jag tror att det här går."
  },
  {
    "speaker": null,
    "timestamp": "00:18:39",
    "line": "Han gjorde någon liten man in the middle på sig själv liksom. Och så stod jag bredvid och egentligen bara tittade på när han var på väg att göra det här."
  },
  {
    "speaker": null,
    "timestamp": "00:18:46",
    "line": "Och sen så sa han bara så här, om jag trycker det här nu, då kommer jag komma in. Och sen tvekade han lite grann, för han var så här, men vad fan jag kanske inte ska ändå."
  },
  {
    "speaker": null,
    "timestamp": "00:18:55",
    "line": "För det förstör ju lite grann om vi kommer till slutet. Och han tvekade lite grann, och jag bara, ja men vad fan vi kanske ska göra."
  },
  {
    "speaker": null,
    "timestamp": "00:19:05",
    "line": "Och sen så gick jag iväg till min dator typ, och panikpushade en uppdatering som gjorde så att det gick inte att stänga av maskinen."
  },
  {
    "speaker": null,
    "timestamp": "00:19:12",
    "line": "Eller så här, man kunde stänga av den, men man kom inte till slutet, eller man kom inte till det som var finalen."
  },
  {
    "speaker": null,
    "timestamp": "00:19:16",
    "line": "Utan då blev man typ redirektad till en YouTube-video av den här scenen från Jurassic Park, när han som hackar, jag kommer inte ihåg vad han heter nu."
  },
  {
    "speaker": null,
    "timestamp": "00:19:25",
    "line": "Han som stänger av sänkare systemet då. Och då är det typ så här, ah ah ah, you didn't say the magic word."
  },
  {
    "speaker": null,
    "timestamp": "00:19:31",
    "line": "Och så har han gjort det. Så jag redirektade dit i panik för att han skulle göra det där."
  },
  {
    "speaker": null,
    "timestamp": "00:19:37",
    "line": "Sen gick jag tillbaka till honom, och så stod han där, och då var det någon annan kollega som också var där och funderade på så här, men vad fan vi ska vi inte göra."
  },
  {
    "speaker": null,
    "timestamp": "00:19:43",
    "line": "Jag bara så här, jag tycker vi kör."
  },
  {
    "speaker": null,
    "timestamp": "00:19:47",
    "line": "Och han, alltså körde han, och så kom han dit."
  },
  {
    "speaker": null,
    "timestamp": "00:19:52",
    "line": "Och han var så jävla imponerad över att de hade tänkt på allt, de som hade byggt det här."
  },
  {
    "speaker": null,
    "timestamp": "00:20:01",
    "line": "Och det var så jävla svårt att hålla masken då, när jag stod där, och han var så oerhört imponerad över vad som hade hänt."
  },
  {
    "speaker": null,
    "timestamp": "00:20:12",
    "line": "Och så att din narcissistiska sida bara, jajjamen, här kan du inte komma och hacka med den här grejen."
  },
  {
    "speaker": null,
    "timestamp": "00:20:19",
    "line": "Jajjamen, nej det var ju bara tur. Alltså hade han gjort det när jag inte var där så hade han förmodligen kommit in."
  },
  {
    "speaker": null,
    "timestamp": "00:20:25",
    "line": "Så att vi lärde oss också saker av det där att bygga tjänster som inte är så lätta att liksom hacka."
  },
  {
    "speaker": null,
    "timestamp": "00:20:31",
    "line": "För det har också varit en utmaning i att vi vill inte ha så mycket JavaScript baserat, vi vill inte att det ska vara bara att man kan titta på nätverkstrafiken för att lösa saker."
  },
  {
    "speaker": null,
    "timestamp": "00:20:39",
    "line": "Typ en annan rolig, jag kommer inte att hela gå igenom allt, men en annan rolig som vi körde under tredje gången var ju då att vi"
  },
  {
    "speaker": null,
    "timestamp": "00:20:47",
    "line": "Byggde ett spel, eller typ ett pusselspel, alltså ett sådär gammalt klassiskt tvåligt spel där man kunde gå runt,"
  },
  {
    "speaker": null,
    "timestamp": "00:20:54",
    "line": "tänka att man går runt i en, man ser det uppifrån fast det är bara ASCII tecken."
  },
  {
    "speaker": null,
    "timestamp": "00:21:00",
    "line": "Och den byggde vi så att man styrde den med SMS."
  },
  {
    "speaker": null,
    "timestamp": "00:21:05",
    "line": "Så för att gå runt så skickade man SMS för att gå upp, ner, höger, vänster och sen så för att gå med."
  },
  {
    "speaker": null,
    "timestamp": "00:21:12",
    "line": "Och då blev man en liten prick på den här."
  },
  {
    "speaker": null,
    "timestamp": "00:21:14",
    "line": "Koden är helt okej, jag råkade överdriva hur robust den behövde vara för att jag byggde den så att"
  },
  {
    "speaker": null,
    "timestamp": "00:21:21",
    "line": "man spesar också hur varje nivå ska se ut i ASCII. Så att man kan rita allting i ASCII."
  },
  {
    "speaker": null,
    "timestamp": "00:21:27",
    "line": "Så att varje nivå är bara en sträng i koden."
  },
  {
    "speaker": null,
    "timestamp": "00:21:30",
    "line": "Och sen parsar jag den för att rita upp den här nivån."
  },
  {
    "speaker": null,
    "timestamp": "00:21:33",
    "line": "Och sen finns det lite olika funktioner som att det finns saker som man går på så dör man och så måste man börja om."
  },
  {
    "speaker": null,
    "timestamp": "00:21:38",
    "line": "Det finns dörrar och knappar som öppnar de här dörrarna."
  },
  {
    "speaker": null,
    "timestamp": "00:21:41",
    "line": "Och så finns det lite olika typer av knappar, typ att vissa knappar behöver man stå på två knappar för att öppna en dörr."
  },
  {
    "speaker": null,
    "timestamp": "00:21:46",
    "line": "Vissa måste man stå på hela tiden, vissa kan man stå på bara och klicka på och sen gå av."
  },
  {
    "speaker": null,
    "timestamp": "00:21:52",
    "line": "Vad var det byggt i?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:54",
    "line": "Det byggde Remix."
  },
  {
    "speaker": null,
    "timestamp": "00:21:57",
    "line": "Remix är väldigt trevligt för att du kan ta bort all client-side JavaScript genom att inte inkludera en scripts-komponent."
  },
  {
    "speaker": null,
    "timestamp": "00:22:08",
    "line": "Då skickar inte den någon JavaScript till klienten."
  },
  {
    "speaker": null,
    "timestamp": "00:22:12",
    "line": "Och här ville jag inte ha någon JavaScript."
  },
  {
    "speaker": null,
    "timestamp": "00:22:15",
    "line": "Så då byggde jag den så och tog bort all JavaScript."
  },
  {
    "speaker": null,
    "timestamp": "00:22:18",
    "line": "Och sen tänkte jag att det måste ändå uppdateras automatiskt på något sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:22:21",
    "line": "Och då har jag ett litet, litet, bara en liten script-tagg som kör en window, eller location, reload var femtio sekunder."
  },
  {
    "speaker": null,
    "timestamp": "00:22:29",
    "line": "Så det var hela klient-logiken."
  },
  {
    "speaker": null,
    "timestamp": "00:22:33",
    "line": "Och sen låg all logik i backen, så det uppdaterades i realtid egentligen i backen."
  },
  {
    "speaker": null,
    "timestamp": "00:22:37",
    "line": "Bara att så fort du refreshade så läste klienten upp det senaste statet och ritade ut det."
  },
  {
    "speaker": null,
    "timestamp": "00:22:43",
    "line": "Och det var också väldigt kul."
  },
  {
    "speaker": null,
    "timestamp": "00:22:46",
    "line": "Jag byggde den i tre olika nivåer så att man fick lära sig hur det funkade med dörrar och grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:22:51",
    "line": "Sen råkade jag göra nivå tre jättesvårt från början."
  },
  {
    "speaker": null,
    "timestamp": "00:22:55",
    "line": "Och så visade jag den för min kompis Emil som jag byggde med."
  },
  {
    "speaker": null,
    "timestamp": "00:22:58",
    "line": "Och räknade ut att man behövde skicka 1800 sms för att lösa den."
  },
  {
    "speaker": null,
    "timestamp": "00:23:04",
    "line": "Och då satte han stopp, som tur var. Så då byggde jag en lite lättare version som de fick lösa sen."
  },
  {
    "speaker": null,
    "timestamp": "00:23:10",
    "line": "Så det var också väldigt kul. Och det är väldigt kul att bygga lite med API-er som man kanske inte kör så mycket med i vanliga fall."
  },
  {
    "speaker": null,
    "timestamp": "00:23:17",
    "line": "Typ sms eller telefonsvarare. Det gjorde ju att folk blev väldigt imponerade."
  },
  {
    "speaker": null,
    "timestamp": "00:23:22",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:23:24",
    "line": "Det är en svår jävla användarbas att ha sådana som sitter på teknisk kompetens men också annan teknisk kompetens än vad man själv sitter på."
  },
  {
    "speaker": null,
    "timestamp": "00:23:36",
    "line": "Gud ja."
  },
  {
    "speaker": null,
    "timestamp": "00:23:38",
    "line": "Man får ju tänka igenom ordentligt. Vi har ju inga databaser, ingenting sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:45",
    "line": "Vi hade vissa formulär där man kunde fylla i saker."
  },
  {
    "speaker": null,
    "timestamp": "00:23:50",
    "line": "Vi hade något ställe där man kunde hacka sig in på organisationens adminsida."
  },
  {
    "speaker": null,
    "timestamp": "00:23:57",
    "line": "Där kunde man signa upp för att få deras interna kommunikation."
  },
  {
    "speaker": null,
    "timestamp": "00:24:00",
    "line": "Och då kunde man fylla i telefonnummer där. Och det använde vi för att skicka hints till dem sen."
  },
  {
    "speaker": null,
    "timestamp": "00:24:06",
    "line": "Men istället för att ha en databas så skickade vi bara en webhook till en Discord-server."
  },
  {
    "speaker": null,
    "timestamp": "00:24:13",
    "line": "Så varje gång någon skrev upp sig där fick vi en liten ping med att någon skrev upp sig."
  },
  {
    "speaker": null,
    "timestamp": "00:24:18",
    "line": "Och det fungerade alldeles utmärkt. Det var inga konstigheter."
  },
  {
    "speaker": null,
    "timestamp": "00:24:22",
    "line": "Fick ni numret på Discord?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:24",
    "line": "Ja. GDPR, man vet aldrig."
  },
  {
    "speaker": null,
    "timestamp": "00:24:27",
    "line": "Ja, eller hur? Vad har ni för?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:29",
    "line": "Vi talar tyst om sånt. Det behöver ingen veta."
  },
  {
    "speaker": null,
    "timestamp": "00:24:33",
    "line": "Så det är en sak... Vad fan var det mer vi gjorde?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:38",
    "line": "En sak som ändå var väldigt rolig var att år två och tre gjorde vi lite mer som var fysiskt också."
  },
  {
    "speaker": null,
    "timestamp": "00:24:45",
    "line": "År två var vi ut till Tantolunden i Stockholm och grävde ner en fakebok som har ett kassaskåp inuti sig."
  },
  {
    "speaker": null,
    "timestamp": "00:24:58",
    "line": "I typ ett dunge i Tantolunden. Och sen så kunde man hitta koordinaterna dit tillsammans med en liten gåta."
  },
  {
    "speaker": null,
    "timestamp": "00:25:05",
    "line": "Som man kunde lösa för att hitta vart den var."
  },
  {
    "speaker": null,
    "timestamp": "00:25:07",
    "line": "Och då var det kollegor som fick ta sig till Tantolunden, gräva upp den här och sen använda den för att ta sig vidare i mysteriet."
  },
  {
    "speaker": null,
    "timestamp": "00:25:13",
    "line": "År tre som var i år då hade vi en... Jag vet inte vad det heter. Kräftriket tror jag det heter."
  },
  {
    "speaker": null,
    "timestamp": "00:25:20",
    "line": "Men det ligger på motsats, andra sidan från Hagaparken om folk från Stockholm lyssnar."
  },
  {
    "speaker": null,
    "timestamp": "00:25:27",
    "line": "Och där sänkte vi en flaska i vattnet som vi sen knöt fast i ett träd."
  },
  {
    "speaker": null,
    "timestamp": "00:25:34",
    "line": "Som de fick ta sig dit och fiska upp för att ta sig vidare."
  },
  {
    "speaker": null,
    "timestamp": "00:25:38",
    "line": "Jag gillar att det var storm när ni gjorde det också."
  },
  {
    "speaker": null,
    "timestamp": "00:25:41",
    "line": "Ja, vi sänkte den där för vi trodde att imorgon kommer de dit. Så vi fick sänka den så nära in på oss som möjligt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:47",
    "line": "Och sen löste de det inte på tre dagar. Och under de dagarna var det verkligen storm."
  },
  {
    "speaker": null,
    "timestamp": "00:25:51",
    "line": "När de åkte dit hade vi ingen aning om det skulle vara kvar eller inte."
  },
  {
    "speaker": null,
    "timestamp": "00:25:56",
    "line": "Det var inte knutet med ett hårt rep utan det var lite snöre som satt i ett träd."
  },
  {
    "speaker": null,
    "timestamp": "00:26:01",
    "line": "Men den var kvar."
  },
  {
    "speaker": null,
    "timestamp": "00:26:03",
    "line": "Ja, ja. Stort."
  },
  {
    "speaker": null,
    "timestamp": "00:26:06",
    "line": "Ja, det var extremt roligt. Det här kanske är 10% av allt vi har gjort."
  },
  {
    "speaker": null,
    "timestamp": "00:26:13",
    "line": "Det har varit väldigt mycket saker. Vi har gömt saker på kontoret."
  },
  {
    "speaker": null,
    "timestamp": "00:26:18",
    "line": "Vi har haft ett riktigt 2D-plattformsspel som de skulle lösa eller spela tillsammans."
  },
  {
    "speaker": null,
    "timestamp": "00:26:25",
    "line": "Som ett multiplayer-spel."
  },
  {
    "speaker": null,
    "timestamp": "00:26:28",
    "line": "Det slutade med att på sista nivån skulle man stå på olika knappar tillsammans."
  },
  {
    "speaker": null,
    "timestamp": "00:26:32",
    "line": "Det var motsvarande det här textbaserade spelet fast lite mer avancerat."
  },
  {
    "speaker": null,
    "timestamp": "00:26:37",
    "line": "Så det har vi haft. Vi hade att de skulle hitta en FTP-server som jag hostade på en Raspberry Pi hemma i min lägenhet."
  },
  {
    "speaker": null,
    "timestamp": "00:26:47",
    "line": "Som det låg en massa filer på."
  },
  {
    "speaker": null,
    "timestamp": "00:26:49",
    "line": "Bland annat låg det en halvfärdig dokumentärfilm som vi hade klippt ihop med den här huvudkaraktären."
  },
  {
    "speaker": null,
    "timestamp": "00:26:59",
    "line": "Eller den här onda karaktären."
  },
  {
    "speaker": null,
    "timestamp": "00:27:01",
    "line": "Där dokumentärfilmaren ställde den här onda karaktären mot väggen för att han hade förfalskat historien om den här onda organisationen."
  },
  {
    "speaker": null,
    "timestamp": "00:27:08",
    "line": "Att henne inte hade startat den egentligen men henne påstod det."
  },
  {
    "speaker": null,
    "timestamp": "00:27:12",
    "line": "Så det fanns där och så fanns det ledtrådar i den där dokumentärfilmen."
  },
  {
    "speaker": null,
    "timestamp": "00:27:16",
    "line": "Men gjorde du inte AI-röster av människor också?"
  },
  {
    "speaker": null,
    "timestamp": "00:27:19",
    "line": "Just det! Det var ju också väldigt kul."
  },
  {
    "speaker": null,
    "timestamp": "00:27:21",
    "line": "Det här är ju lite på gränsen i integritetskränkande."
  },
  {
    "speaker": null,
    "timestamp": "00:27:25",
    "line": "Men det senaste året upptäckte jag ett API som heter Eleven Labs."
  },
  {
    "speaker": null,
    "timestamp": "00:27:31",
    "line": "Som är så att man kan generera röster."
  },
  {
    "speaker": null,
    "timestamp": "00:27:33",
    "line": "Eller det är liksom en text-to-speech men du kan också klona röster."
  },
  {
    "speaker": null,
    "timestamp": "00:27:37",
    "line": "Så jag gick in där och testade lite grann och klonade min egen röst."
  },
  {
    "speaker": null,
    "timestamp": "00:27:41",
    "line": "Då upptäckte jag att det blir ganska bra kvalitet."
  },
  {
    "speaker": null,
    "timestamp": "00:27:44",
    "line": "Vi hade ju en telefonsvarare här också."
  },
  {
    "speaker": null,
    "timestamp": "00:27:47",
    "line": "Då kunde man stänga av den här."
  },
  {
    "speaker": null,
    "timestamp": "00:27:50",
    "line": "För vi hade en datorgenererad röst som hade lite ont ljud."
  },
  {
    "speaker": null,
    "timestamp": "00:27:53",
    "line": "Det lät som att den var anonymiserad."
  },
  {
    "speaker": null,
    "timestamp": "00:27:56",
    "line": "Då kunde man stänga av det och man gick in på en viss inställning i den här knappvalsmenyn."
  },
  {
    "speaker": null,
    "timestamp": "00:28:03",
    "line": "Och om man gjorde det hade jag genererat upp alla de här texterna med en kollegas röst."
  },
  {
    "speaker": null,
    "timestamp": "00:28:08",
    "line": "Så då blev det hennes röst i hela telefonsvararen egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:28:11",
    "line": "Det var egentligen för att hon har varit väldigt misstänkt av alla andra."
  },
  {
    "speaker": null,
    "timestamp": "00:28:15",
    "line": "Så det var en blinkning till det."
  },
  {
    "speaker": null,
    "timestamp": "00:28:18",
    "line": "Vi hade ju Instagramkonton och allt möjligt för den här organisationen."
  },
  {
    "speaker": null,
    "timestamp": "00:28:24",
    "line": "Men vi hade bland annat upp ett klipp där som var som att någon hade råkat filma när de hade den i fickan."
  },
  {
    "speaker": null,
    "timestamp": "00:28:29",
    "line": "Då hade jag också datorerat upp ett par kollegors röster."
  },
  {
    "speaker": null,
    "timestamp": "00:28:32",
    "line": "Och en av dem var så här, fan det låter exakt som jag."
  },
  {
    "speaker": null,
    "timestamp": "00:28:35",
    "line": "Men jag har ju inte sagt det här, det låter exakt som mig."
  },
  {
    "speaker": null,
    "timestamp": "00:28:40",
    "line": "Så det var väldigt roligt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:45",
    "line": "Men det var ju mest en rolig grej, jag vill inte använda det till något mer seriöst."
  },
  {
    "speaker": null,
    "timestamp": "00:28:50",
    "line": "Freaky."
  },
  {
    "speaker": null,
    "timestamp": "00:28:52",
    "line": "Det var som sagt extremt roligt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:56",
    "line": "Jag tror att det var extremt lyckat. Det kändes så när vi avslöjade oss."
  },
  {
    "speaker": null,
    "timestamp": "00:28:59",
    "line": "Vilket var första gången jag var riktigt nervös."
  },
  {
    "speaker": null,
    "timestamp": "00:29:02",
    "line": "Jag har smugit runt på kontoret mycket på kvällar och helger."
  },
  {
    "speaker": null,
    "timestamp": "00:29:04",
    "line": "Och ljugit folk rakt upp i ansiktet under lunchen."
  },
  {
    "speaker": null,
    "timestamp": "00:29:10",
    "line": "Hur går det med det här mysteriet?"
  },
  {
    "speaker": null,
    "timestamp": "00:29:12",
    "line": "Eller att någon börjar prata om det och man måste sitta där och låtsas att man inte vet något."
  },
  {
    "speaker": null,
    "timestamp": "00:29:16",
    "line": "Men slutfilmen som vi hade i år var att de här karaktärerna gick genom vårt kontor."
  },
  {
    "speaker": null,
    "timestamp": "00:29:23",
    "line": "Och då hade vi filmat som om vi hade övervakningskamera på kontoret."
  },
  {
    "speaker": null,
    "timestamp": "00:29:27",
    "line": "Och då var det egentligen så att jag hade el-tapat upp min telefon i olika hörn i rummen."
  },
  {
    "speaker": null,
    "timestamp": "00:29:32",
    "line": "Som jag sen filmade. Det var en jävla jobb det där."
  },
  {
    "speaker": null,
    "timestamp": "00:29:36",
    "line": "Så de gick genom hela kontoret och sen in till rummet där avm var."
  },
  {
    "speaker": null,
    "timestamp": "00:29:41",
    "line": "Och i slutet så klippte den till svart."
  },
  {
    "speaker": null,
    "timestamp": "00:29:44",
    "line": "Men istället så kom jag och Emil, min kollega, in i rummet utklädda i samma utklädnad."
  },
  {
    "speaker": null,
    "timestamp": "00:29:50",
    "line": "Och sen tog av oss maskerna."
  },
  {
    "speaker": null,
    "timestamp": "00:29:53",
    "line": "Jag tror att jag hade 150 puls när jag skulle in där."
  },
  {
    "speaker": null,
    "timestamp": "00:29:57",
    "line": "Det bultade bra."
  },
  {
    "speaker": null,
    "timestamp": "00:30:01",
    "line": "Men det var kul."
  },
  {
    "speaker": null,
    "timestamp": "00:30:03",
    "line": "Men jag tänker fortfarande att folk måste ha vetat att det var ni."
  },
  {
    "speaker": null,
    "timestamp": "00:30:07",
    "line": "Folk verkade genuint förvånade."
  },
  {
    "speaker": null,
    "timestamp": "00:30:11",
    "line": "Nu tar jag det mest på att det har pågått över tre år och det är kanske inte så många sussare kvar."
  },
  {
    "speaker": null,
    "timestamp": "00:30:24",
    "line": "Nej exakt. Många som var med från början har slutat."
  },
  {
    "speaker": null,
    "timestamp": "00:30:30",
    "line": "Och det har gjort att folk har misstänkt andra."
  },
  {
    "speaker": null,
    "timestamp": "00:30:35",
    "line": "Men sen har folk trott, och det här är en ganska bra segway, att det är en inköpt produkt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:40",
    "line": "Och att det inte krävs så mycket från folk på Empyre."
  },
  {
    "speaker": null,
    "timestamp": "00:30:44",
    "line": "Så folk har tänkt att det kanske är någon av säljarna som ligger bakom det."
  },
  {
    "speaker": null,
    "timestamp": "00:30:48",
    "line": "Och sen får de kanske en del hjälp av någon."
  },
  {
    "speaker": null,
    "timestamp": "00:30:50",
    "line": "Och så är det allting inköpt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:53",
    "line": "Och det var det ju inte."
  },
  {
    "speaker": null,
    "timestamp": "00:30:56",
    "line": "Det gjorde att vi blev lite mindre misstänkta."
  },
  {
    "speaker": null,
    "timestamp": "00:31:00",
    "line": "Det är en så himla cool grej."
  },
  {
    "speaker": null,
    "timestamp": "00:31:04",
    "line": "Men var folk mer engagerade under pandemin?"
  },
  {
    "speaker": null,
    "timestamp": "00:31:07",
    "line": "För jag tänker att när folk var så isolerade så fanns det inte kanske lika mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:31:12",
    "line": "Det var inte annat som pockade uppmärksamhet."
  },
  {
    "speaker": null,
    "timestamp": "00:31:16",
    "line": "Nej, absolut. Men om jag ska jämföra så tror jag inte det var så stor skillnad på engagemanget."
  },
  {
    "speaker": null,
    "timestamp": "00:31:23",
    "line": "Kollar man Slack-kanalerna som har startats varje år så har de varit väldigt aktiva varje gång."
  },
  {
    "speaker": null,
    "timestamp": "00:31:29",
    "line": "Det har direkt blivit den mest aktiva kanalen på Slack när det pågår."
  },
  {
    "speaker": null,
    "timestamp": "00:31:33",
    "line": "Och väldigt många har gått med i kanalerna. I stort sett halva bolaget varje gång."
  },
  {
    "speaker": null,
    "timestamp": "00:31:37",
    "line": "Lite mer kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:31:40",
    "line": "Jag tror att folk hade lite lättare för att spendera tid på det."
  },
  {
    "speaker": null,
    "timestamp": "00:31:47",
    "line": "När det var under pandemin för att man bara satt hemma."
  },
  {
    "speaker": null,
    "timestamp": "00:31:50",
    "line": "Men folk har ändå varit väldigt engagerade i alla tillfällen."
  },
  {
    "speaker": null,
    "timestamp": "00:31:54",
    "line": "Ja, det är ju svinkul."
  },
  {
    "speaker": null,
    "timestamp": "00:31:56",
    "line": "Ja, det är ju fan stort alltså. Jag fattar inte att ni fick ihop det här."
  },
  {
    "speaker": null,
    "timestamp": "00:31:59",
    "line": "Nej, i och med att folk har varit så jävla mycket så här, det är ju en inköpp produkt."
  },
  {
    "speaker": null,
    "timestamp": "00:32:04",
    "line": "Så tänkte jag och Emil också att vi ska testa att sälja skiten."
  },
  {
    "speaker": null,
    "timestamp": "00:32:08",
    "line": "Så att om någon lyssnar och vill ha det här på sitt bolag så får man höra av sig."
  },
  {
    "speaker": null,
    "timestamp": "00:32:13",
    "line": "Det finns en mailadress i beskrivningen så kan man maila oss."
  },
  {
    "speaker": null,
    "timestamp": "00:32:17",
    "line": "Fy fan vilken skamlös plugg. Hur har vi hamnat här Anton?"
  },
  {
    "speaker": null,
    "timestamp": "00:32:21",
    "line": "Mitt bolag sponsrar det här avsnittet."
  },
  {
    "speaker": null,
    "timestamp": "00:32:25",
    "line": "Det gör det inte."
  },
  {
    "speaker": null,
    "timestamp": "00:32:28",
    "line": "Du kan få det i öl sen."
  },
  {
    "speaker": null,
    "timestamp": "00:32:32",
    "line": "Det är lugnt."
  },
  {
    "speaker": null,
    "timestamp": "00:32:36",
    "line": "Fy fan, jag tryckte an min reklam."
  },
  {
    "speaker": null,
    "timestamp": "00:32:40",
    "line": "Ja, det hade jag absolut inte dubbelkollat innan. Det hade jag inte gjort."
  },
  {
    "speaker": null,
    "timestamp": "00:32:44",
    "line": "Men det är sådana friheter man får ta sig ibland."
  },
  {
    "speaker": null,
    "timestamp": "00:32:50",
    "line": "Absolut."
  },
  {
    "speaker": null,
    "timestamp": "00:32:52",
    "line": "Du har en till godo till den gången du vill göra reklam för något."
  },
  {
    "speaker": null,
    "timestamp": "00:32:56",
    "line": "Ja, men jag är ju inte en person som engagerar mig i det här."
  },
  {
    "speaker": null,
    "timestamp": "00:33:04",
    "line": "Jag tror det är jobbigt för jag fattar ingenting."
  },
  {
    "speaker": null,
    "timestamp": "00:33:08",
    "line": "Jag är bättre på fysiska escape rooms och sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:33:12",
    "line": "Men engagemanget jag såg, att människor kom ihop i det här."
  },
  {
    "speaker": null,
    "timestamp": "00:33:16",
    "line": "Folk som aldrig snackar var tvungna att snacka och hänga."
  },
  {
    "speaker": null,
    "timestamp": "00:33:20",
    "line": "Det var en game changer."
  },
  {
    "speaker": null,
    "timestamp": "00:33:23",
    "line": "Jag tycker det var fantastiskt jävla gjort av er."
  },
  {
    "speaker": null,
    "timestamp": "00:33:27",
    "line": "Köp om ni vill ha."
  },
  {
    "speaker": null,
    "timestamp": "00:33:31",
    "line": "Ja, det där var din reklam också. Nu är vi kvitt."
  },
  {
    "speaker": null,
    "timestamp": "00:33:35",
    "line": "Det är ju fortfarande din grej."
  },
  {
    "speaker": null,
    "timestamp": "00:33:37",
    "line": "Vi har pratat alldeles för länge nu. Det här kanske är det längsta avsnittet vi har haft."
  },
  {
    "speaker": null,
    "timestamp": "00:33:40",
    "line": "Men jag skulle kunna prata i tre, fyra avsnitt till om det här."
  },
  {
    "speaker": null,
    "timestamp": "00:33:44",
    "line": "Vill man höra mig prata mer så får man väl höra av sig."
  },
  {
    "speaker": null,
    "timestamp": "00:33:49",
    "line": "Det finns så jävla mycket att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:33:52",
    "line": "Och så är det en tanke bakom."
  },
  {
    "speaker": null,
    "timestamp": "00:33:54",
    "line": "Men för den här gången så känns det som att vi rundar av."
  },
  {
    "speaker": null,
    "timestamp": "00:33:58",
    "line": "Ja, om du inte ska sälja mer, jag vet inte."
  },
  {
    "speaker": null,
    "timestamp": "00:34:04",
    "line": "Jo, men jag har tagit fram en energidryck här."
  },
  {
    "speaker": null,
    "timestamp": "00:34:08",
    "line": "Nej, det har jag absolut inte."
  },
  {
    "speaker": null,
    "timestamp": "00:34:10",
    "line": "Jag har en koppia som jag gärna skulle vilja låna."
  },
  {
    "speaker": null,
    "timestamp": "00:34:14",
    "line": "Den heter I, eller hur?"
  },
  {
    "speaker": null,
    "timestamp": "00:34:16",
    "line": "Ja, han är söt faktiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:34:20",
    "line": "Vilken jävla twist."
  },
  {
    "speaker": null,
    "timestamp": "00:34:22",
    "line": "Okej hörni, tack så hemskt mycket för att ni har lyssnat på mig rabbla på om det här."
  },
  {
    "speaker": null,
    "timestamp": "00:34:28",
    "line": "Det var säkert hyfsat sammanhängande."
  },
  {
    "speaker": null,
    "timestamp": "00:34:30",
    "line": "Men vi hörs väl igen om två veckor."
  },
  {
    "speaker": null,
    "timestamp": "00:34:35",
    "line": "Det gör vi. Ha det fint."
  },
  {
    "speaker": null,
    "timestamp": "00:34:37",
    "line": "Hej då. Bye bye.   "
  }
]
