[
  {
    "speaker": null,
    "timestamp": "00:00:00",
    "line": "Dagens skämt kommer från Lindhe."
  },
  {
    "speaker": null,
    "timestamp": "00:00:04",
    "line": "Och det är liksom inte ett utvecklingsskämt utan det är en kategori av skämt som han själv har hittat på."
  },
  {
    "speaker": null,
    "timestamp": "00:00:11",
    "line": "Som han kände att han var tvungen att leverera för han tyckte att våra skämt var undermåliga."
  },
  {
    "speaker": null,
    "timestamp": "00:00:16",
    "line": "Speciellt Antons skämt."
  },
  {
    "speaker": null,
    "timestamp": "00:00:18",
    "line": "Det är så långt intro nu, vi har aldrig haft så här långt intro innan skämtet."
  },
  {
    "speaker": null,
    "timestamp": "00:00:21",
    "line": "Nej jag vet men jag kände att det behöver förklaras."
  },
  {
    "speaker": null,
    "timestamp": "00:00:24",
    "line": "Ja absolut."
  },
  {
    "speaker": null,
    "timestamp": "00:00:25",
    "line": "Wow, what a lovely white wool jacket. Thanks, it was cheap."
  },
  {
    "speaker": null,
    "timestamp": "00:00:33",
    "line": "Ja absolut. Vi kan ju förklara att den här karaktären Linde som det här visar till är en produktägare."
  },
  {
    "speaker": null,
    "timestamp": "00:00:47",
    "line": "Jag vet inte vad hans rollriktigheter är, jag glömmer alltid bort."
  },
  {
    "speaker": null,
    "timestamp": "00:00:49",
    "line": "Men som både du och jag har jobbat med."
  },
  {
    "speaker": null,
    "timestamp": "00:00:52",
    "line": "Ja och han försöker verkligen få kategorin jackskämt att flyga."
  },
  {
    "speaker": null,
    "timestamp": "00:01:00",
    "line": "Så jag tänker att jag drar in det som ett test."
  },
  {
    "speaker": null,
    "timestamp": "00:01:04",
    "line": "Det finns någonting i att han kom på kategorin jackskämt i en dröm."
  },
  {
    "speaker": null,
    "timestamp": "00:01:10",
    "line": "Det ska vi absolut inte gå in på nu men det finns någonting där som jag inte riktigt vet vad jag tycker om."
  },
  {
    "speaker": null,
    "timestamp": "00:01:17",
    "line": "Ja och med det super otroliga introt så säger vi hej till 2024. Jag är Stef."
  },
  {
    "speaker": null,
    "timestamp": "00:01:24",
    "line": "Jajamän, nytt år, nya men. Eller vad är det man brukar säga?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:29",
    "line": "Jag vet inte, nya stukningar kanske?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:32",
    "line": "Nej jag tror att vi ska klara oss från fötter i år faktiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:01:36",
    "line": "Vad känner du inför 2024?"
  },
  {
    "speaker": null,
    "timestamp": "00:01:40",
    "line": "Jag vet inte. Jag vet faktiskt inte vad som ska hända."
  },
  {
    "speaker": null,
    "timestamp": "00:01:47",
    "line": "Det känns lite konstigt. För det känns lite som att vi har gått och väntat på att saker ska vända."
  },
  {
    "speaker": null,
    "timestamp": "00:01:51",
    "line": "Och så har de inte riktigt gjort det."
  },
  {
    "speaker": null,
    "timestamp": "00:01:54",
    "line": "Och så har man tänkt ännu mer att då vänder det nu men det känns fortfarande väldigt ovisst."
  },
  {
    "speaker": null,
    "timestamp": "00:01:59",
    "line": "Och jag menar Spotify, kickar en massa människor och saker går upp och ner."
  },
  {
    "speaker": null,
    "timestamp": "00:02:04",
    "line": "Jag vet verkligen inte. Jag är bara glad att vara här så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:02:10",
    "line": "Vad tänker du?"
  },
  {
    "speaker": null,
    "timestamp": "00:02:12",
    "line": "Det är väl en ganska bra inställning att ha. Jag är glad att vara här."
  },
  {
    "speaker": null,
    "timestamp": "00:02:17",
    "line": "Det skulle ju kunna vara ganska mycket värre så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:02:21",
    "line": "Jag vet inte, jag känner att det är väl så att man väntar på att saker ska vända och allting sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:02:26",
    "line": "Men det känns som att det är något nytt normalläge nu på något vis."
  },
  {
    "speaker": null,
    "timestamp": "00:02:30",
    "line": "Ja, men jag känner också att jag såg en artikel om någon som sa att AI tog våra jobb."
  },
  {
    "speaker": null,
    "timestamp": "00:02:37",
    "line": "Och det tror jag var programmerare i content management."
  },
  {
    "speaker": null,
    "timestamp": "00:02:41",
    "line": "Och nu det kommer bli samma sak som det blev för fabriksarbetare och grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:02:45",
    "line": "Att tekniken tar våra jobb och så."
  },
  {
    "speaker": null,
    "timestamp": "00:02:47",
    "line": "Och då kände jag bara, ja jag väntar in det."
  },
  {
    "speaker": null,
    "timestamp": "00:02:52",
    "line": "Och så kanske det är det som till slut får mig att liksom tvingas göra någonting annat."
  },
  {
    "speaker": null,
    "timestamp": "00:02:58",
    "line": "Att jobba som IT-forensiker kanske?"
  },
  {
    "speaker": null,
    "timestamp": "00:03:01",
    "line": "Nej, det blev ju så himla brutal truth av det där."
  },
  {
    "speaker": null,
    "timestamp": "00:03:08",
    "line": "Du fick ju någon fråga om, vill du verkligen sitta och titta på barnporn hela dagarna?"
  },
  {
    "speaker": null,
    "timestamp": "00:03:15",
    "line": "95% handlar om barnpornografibrott."
  },
  {
    "speaker": null,
    "timestamp": "00:03:21",
    "line": "Så jag tänker nej, men om jag hade fått vara färdighetsbildad, då hade jag velat vara make-up-artist."
  },
  {
    "speaker": null,
    "timestamp": "00:03:30",
    "line": "Är det jag kommit fram till."
  },
  {
    "speaker": null,
    "timestamp": "00:03:32",
    "line": "Och jobba på typ Sagan om ringen-grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:03:35",
    "line": "Fattar coolt."
  },
  {
    "speaker": null,
    "timestamp": "00:03:37",
    "line": "Ja, alltså det svängde lite grann där."
  },
  {
    "speaker": null,
    "timestamp": "00:03:41",
    "line": "Alltså att gå från make-up-artist och man tänker att det är typ lite blåa ögon och rosiga kinder"
  },
  {
    "speaker": null,
    "timestamp": "00:03:47",
    "line": "till, ja men jag vill göra orkar."
  },
  {
    "speaker": null,
    "timestamp": "00:03:51",
    "line": "Men det är ju samma kategori. Alltså alla är ju make-up-artister."
  },
  {
    "speaker": null,
    "timestamp": "00:03:55",
    "line": "Absolut, det säger ju mer om mina fördomar än om någonting annat."
  },
  {
    "speaker": null,
    "timestamp": "00:03:58",
    "line": "Men det var bara en sväng i min tankegång."
  },
  {
    "speaker": null,
    "timestamp": "00:04:04",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:04:06",
    "line": "Jag tror, jag vet inte, jag har liksom inga förväntningar på 2024 egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:04:10",
    "line": "Jag tror bara att det rullar på som det gör."
  },
  {
    "speaker": null,
    "timestamp": "00:04:13",
    "line": "Jag startade ju ett litet bolag förra året som jag tänker kommer ta lite av min tid, vilket känns ganska kul."
  },
  {
    "speaker": null,
    "timestamp": "00:04:19",
    "line": "Och det är väl allt i stort sett."
  },
  {
    "speaker": null,
    "timestamp": "00:04:24",
    "line": "Jaha, är vi klara nu då?"
  },
  {
    "speaker": null,
    "timestamp": "00:04:26",
    "line": "Ja, men tack för i år hörni. Vi hörs 2025."
  },
  {
    "speaker": null,
    "timestamp": "00:04:30",
    "line": "Vi har ett nytt upplägg. Vi har ett nytt upplägg på podden."
  },
  {
    "speaker": null,
    "timestamp": "00:04:32",
    "line": "Vi släpper ett fem minuters avsnitt varje år."
  },
  {
    "speaker": null,
    "timestamp": "00:04:38",
    "line": "Alltså min nya mantra, det enda jag hör i huvudet hela dagarna, eller när man får frågor så här, det är bara den här lilla killen."
  },
  {
    "speaker": null,
    "timestamp": "00:04:45",
    "line": "En sån här chans får man bara en gång i livet."
  },
  {
    "speaker": null,
    "timestamp": "00:04:49",
    "line": "Exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:04:51",
    "line": "Satte de inte upp, var det inte någon, det var någon bolag som sponsrade, de behöver inte få reklam här i podden,"
  },
  {
    "speaker": null,
    "timestamp": "00:04:58",
    "line": "men det var någon bolag som sponsrade att de skulle sätta upp något plakat för att hylla på de här platserna där det här hände."
  },
  {
    "speaker": null,
    "timestamp": "00:05:08",
    "line": "I vad det hände?"
  },
  {
    "speaker": null,
    "timestamp": "00:05:10",
    "line": "Där han sa det här."
  },
  {
    "speaker": null,
    "timestamp": "00:05:12",
    "line": "Jag tror att den var med, men också förutom den så tror jag det var han som pratade spanska."
  },
  {
    "speaker": null,
    "timestamp": "00:05:19",
    "line": "Det vet jag inte ens vilken det är."
  },
  {
    "speaker": null,
    "timestamp": "00:05:21",
    "line": "Jo, men det är en liten skolgrabb i mellanstadiet kanske, lågstadiet kanske, som sitter på spanska lektionen och så kommer någon som ska intervjua honom och säger \"\"kan du prata spanska?\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:05:31",
    "line": "Och så säger han \"\"si senorita, hola senor\"\" och sen, ja det var allt."
  },
  {
    "speaker": null,
    "timestamp": "00:05:39",
    "line": "Det är väl inte så illa?"
  },
  {
    "speaker": null,
    "timestamp": "00:05:41",
    "line": "Nej, Gud nej, det är typ lika mycket som jag kan."
  },
  {
    "speaker": null,
    "timestamp": "00:05:45",
    "line": "Det här är också kul för vi har passerat för länge länge sen där du hade sagt \"\"alltså hade jag lyssnat på den här podden så hade jag stängt av för länge sen, vi bara blajar\"\"."
  },
  {
    "speaker": null,
    "timestamp": "00:05:54",
    "line": "Ja, men det är första avsnittet 2024, det är liksom januari, det är ingen annan förväntningar."
  },
  {
    "speaker": null,
    "timestamp": "00:05:59",
    "line": "De är liksom lite trötta på oss efter en fantastisk julkalender och ett litet bonusavsnitt på nyår också för den delen."
  },
  {
    "speaker": null,
    "timestamp": "00:06:06",
    "line": "Ja, som vi räknade som ett avsnitt så att vi är en vecka efter."
  },
  {
    "speaker": null,
    "timestamp": "00:06:11",
    "line": "Ja, exakt. Jag vet inte, jag har liksom inga trendspaningar, för det känns som att alla gör det runt nyår."
  },
  {
    "speaker": null,
    "timestamp": "00:06:20",
    "line": "\"\"Ja men trendspana, vad tror vi om tekniken i 2024?\"\" Jag har ingenting i år."
  },
  {
    "speaker": null,
    "timestamp": "00:06:25",
    "line": "Alltså jag fattar inte varför vi skulle trendspana och göra sådana grejer nu, för är det inte som absolut mest dött kring jul och nyår?"
  },
  {
    "speaker": null,
    "timestamp": "00:06:35",
    "line": "För att typ sommaren i Sverige, den går ju ner på lågvarv, men det gör den ju inte riktigt på andra ställen, för andra människor får ju inte lika lång fabrikssemester som vi har."
  },
  {
    "speaker": null,
    "timestamp": "00:06:49",
    "line": "Men däremot så, jag har sett jäkligt många memes som är sådär \"\"forgotten everything after my two weeks of Christmas or holiday\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:07:00",
    "line": "Så det är ju nu det verkligen har varit ner i lågvarv."
  },
  {
    "speaker": null,
    "timestamp": "00:07:06",
    "line": "Ja, så är det ju verkligen. Men det känns bara som en grej att runt nyår, slutet på året, så ska man sammanfatta \"\"vad gjorde vi förra året?\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:07:15",
    "line": "Jag vet fan inte, jag har ingen aning. Vi poddade lite då och då, jag hade ganska trevligt på jobbet och startade ett bolag."
  },
  {
    "speaker": null,
    "timestamp": "00:07:21",
    "line": "Ja, jag börjar nytt jobb."
  },
  {
    "speaker": null,
    "timestamp": "00:07:24",
    "line": "Ja, jag vet fan inte. Jag fattar folk som vill \"\"nu ska jag göra någon typ av retro på hela 2023\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:07:33",
    "line": "\"\"Nu ska jag ta med mig vad jag har lärt mig under året\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:07:37",
    "line": "Visst, jag kan förstå det, men samtidigt känner jag bara \"\"lev livet lite\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:07:44",
    "line": "Och med det här menar jag liksom \"\"chilla\"\"."
  },
  {
    "speaker": null,
    "timestamp": "00:07:46",
    "line": "Man behöver inte mäta allting, man behöver inte utvärdera allting, man behöver inte hålla på och tänka att allting ska optimeras."
  },
  {
    "speaker": null,
    "timestamp": "00:07:55",
    "line": "Det känns så jävla skönt att bara säga \"\"ja, men 2023, helt okej år\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:08:00",
    "line": "\"\"2024, det blir nog också ett helt okej år, behöver inte ha några mål, behöver inte göra någonting\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:08:04",
    "line": "\"\"Inga förväntningar, ingenting\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:08:07",
    "line": "Alltså jag tänker ju mer att \"\"fan, någonting måste hända\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:08:12",
    "line": "Jag börjar bli så jävla uttråkad."
  },
  {
    "speaker": null,
    "timestamp": "00:08:14",
    "line": "Du vill ha mål, du vill ha drastiska förändringar i ditt liv."
  },
  {
    "speaker": null,
    "timestamp": "00:08:18",
    "line": "Nej, jag vill ha drama, tror jag."
  },
  {
    "speaker": null,
    "timestamp": "00:08:20",
    "line": "Ja, okej, drama. Vi kan lösa det här, vi kan ha drama-avsnitt nästa poddavsnitt, när vi ska hitta något saftigt."
  },
  {
    "speaker": null,
    "timestamp": "00:08:26",
    "line": "Nej, jag vill inte vara inblandad, jag vill bara att det stormar lite runt mig så jag har någonting att pyssla med."
  },
  {
    "speaker": null,
    "timestamp": "00:08:32",
    "line": "Ja, okej, du vill liksom sitta lite i periferin, liksom kunna peta i dramat utan att det påverkar dig något."
  },
  {
    "speaker": null,
    "timestamp": "00:08:39",
    "line": "Ja, men typ."
  },
  {
    "speaker": null,
    "timestamp": "00:08:41",
    "line": "Men alltså vad händer annars då? Jobbet, vad började det här uppdraget med egentligen?"
  },
  {
    "speaker": null,
    "timestamp": "00:08:45",
    "line": "Eller vad började jobbet med? Och det är absolut inget fel med det."
  },
  {
    "speaker": null,
    "timestamp": "00:08:48",
    "line": "Jag är bara glad att vara här, en sån här chans får man bara en gång i livet."
  },
  {
    "speaker": null,
    "timestamp": "00:08:53",
    "line": "Men det började liksom med att jaga in i en Angular-app."
  },
  {
    "speaker": null,
    "timestamp": "00:08:59",
    "line": "Och jag... Alltså en inte jätteny Angular-app."
  },
  {
    "speaker": null,
    "timestamp": "00:09:04",
    "line": "Ja, det är ju stjäladödande."
  },
  {
    "speaker": null,
    "timestamp": "00:09:07",
    "line": "Ja, det var liksom... Ja, jag vet inte, jag bara... Nej, ska det vara så här? Ska det vara så här?"
  },
  {
    "speaker": null,
    "timestamp": "00:09:18",
    "line": "Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:09:22",
    "line": "Jag har inget mer att säga om den, så jag bara känner att folk är så här \"\"Ska jag kickstarta det nya året? Ska jag göra det här?\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:09:27",
    "line": "Jag är mer \"\"Det är fett mörkt, det har varit fett jävla kallt, det är Angular, lägger sig grejer, vad är det för kickstart med det här?"
  },
  {
    "speaker": null,
    "timestamp": "00:09:35",
    "line": "Jag har varit sjuk i fyra veckor, jag börjar bli sjuk igen, jag är... Fan vad jag är bitter, alltså."
  },
  {
    "speaker": null,
    "timestamp": "00:09:42",
    "line": "Det är mitt 2024, jag är bitter. Det har svängt så otroligt mycket sedan starten av den här inspelningen, känner jag."
  },
  {
    "speaker": null,
    "timestamp": "00:09:50",
    "line": "Jag känner att jag kanske styr dig åt fel håll, kanske, i det här. Jag vet inte riktigt om..."
  },
  {
    "speaker": null,
    "timestamp": "00:09:56",
    "line": "Jag är inte den coachen man vill ha, direkt. Jag sänker dig istället för att hylla och utmana och höja dig."
  },
  {
    "speaker": null,
    "timestamp": "00:10:05",
    "line": "Men liksom, vad hände nu? För jag hade en diskussion häromdagen, där det var så här att \"\"Okej, men tiden att vara en React-utvecklare, att sälja sig som en React-utvecklare bara, den är förbi."
  },
  {
    "speaker": null,
    "timestamp": "00:10:18",
    "line": "Det finns inte längre. Är det så? Vad kommer ske?\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:10:23",
    "line": "Varför skulle den inte finnas längre, tänker jag?"
  },
  {
    "speaker": null,
    "timestamp": "00:10:26",
    "line": "Därför att allting handlar inte bara om React längre, och på det sättet. För att allting byggs inte bara en helg i React, kanske."
  },
  {
    "speaker": null,
    "timestamp": "00:10:38",
    "line": "Du behöver kunna väldigt mycket mer."
  },
  {
    "speaker": null,
    "timestamp": "00:10:40",
    "line": "Det känns väl som att... Jag tror att kraven kanske har gått upp för att marknaden är lite... Inte mättad, ska man väl säga."
  },
  {
    "speaker": null,
    "timestamp": "00:10:47",
    "line": "Men marknaden skriker ju inte efter fronten du utvecklar på samma sätt som du gjorde förut."
  },
  {
    "speaker": null,
    "timestamp": "00:10:54",
    "line": "Då fanns det ju roller för alla. Då kunde du säga \"\"Jag jobbar med vanilla JavaScript bara. Jag sitter ingenting i ramverket.\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:11:01",
    "line": "Då fick du uppdrag direkt. Eller \"\"Jag sitter med React, eller Vue, eller Svelte, eller vad fan det nu kan vara.\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:11:05",
    "line": "Så fanns det uppdrag, eller jobb, som hittade dig, så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:11:12",
    "line": "Men nu med tanke på att många fler söker jobb, så är det klart att det är svårare att få jobb."
  },
  {
    "speaker": null,
    "timestamp": "00:11:19",
    "line": "Och då om någon säger \"\"Jag är en duktig React-utvecklare, men jag kan backend också.\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:11:24",
    "line": "Så är det ju lätt att man väljer den personen innan man väljer en person som säger \"\"Jag är bara React.\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:11:30",
    "line": "Jo, men vad är ens bara React nu? Tänk att du bara är React-klienten."
  },
  {
    "speaker": null,
    "timestamp": "00:11:35",
    "line": "Du är ju svinbra på React, men förstår inte serverendering, då är det kanske kört, eller?"
  },
  {
    "speaker": null,
    "timestamp": "00:11:41",
    "line": "Då är det större problem än att säga. Då kan man ju inte säga att man är en React-utvecklare, eller?"
  },
  {
    "speaker": null,
    "timestamp": "00:11:46",
    "line": "- Det är klart man kan. - Varför det?"
  },
  {
    "speaker": null,
    "timestamp": "00:11:49",
    "line": "- För du kan ju React. Du kan bara inte React på servern. - Ja, fast det är ju en stor del av React."
  },
  {
    "speaker": null,
    "timestamp": "00:11:56",
    "line": "Nej, men du kan ju vara React-utvecklare i nära gränssnittet, tänker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:12:00",
    "line": "Du kanske är en jävla hjälte på one-div-utmaningar."
  },
  {
    "speaker": null,
    "timestamp": "00:12:06",
    "line": "Du kan bygga ett first-person-shooter-spel i HTML och CSS."
  },
  {
    "speaker": null,
    "timestamp": "00:12:12",
    "line": "På tal om det såg jag någon. Var det idag? Jag vet inte om det var idag."
  },
  {
    "speaker": null,
    "timestamp": "00:12:18",
    "line": "Vi ska komma tillbaka till det alldeles strax."
  },
  {
    "speaker": null,
    "timestamp": "00:12:20",
    "line": "Men det var någon idag som länkade något som de kallade för \"\"over-React\"\"."
  },
  {
    "speaker": null,
    "timestamp": "00:12:29",
    "line": "Som inte har någonting med React att göra, egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:12:36",
    "line": "Utan det är en 3D-motor som är skriven bara i..."
  },
  {
    "speaker": null,
    "timestamp": "00:12:42",
    "line": "Nej, den är skriven i React också."
  },
  {
    "speaker": null,
    "timestamp": "00:12:44",
    "line": "Men den är skriven i HTML och CSS som själva renderingsmotorn."
  },
  {
    "speaker": null,
    "timestamp": "00:12:50",
    "line": "Så att... Vänta, jag ska skicka dig den här länken."
  },
  {
    "speaker": null,
    "timestamp": "00:12:55",
    "line": "Den klickas frenetiskt, det hör jag."
  },
  {
    "speaker": null,
    "timestamp": "00:12:57",
    "line": "Ja, det hör nog våra lyssnare också."
  },
  {
    "speaker": null,
    "timestamp": "00:12:59",
    "line": "Kolla på den länken jag skickade."
  },
  {
    "speaker": null,
    "timestamp": "00:13:01",
    "line": "Det är alltså en klassisk Doom-design."
  },
  {
    "speaker": null,
    "timestamp": "00:13:04",
    "line": "Fast de har gjort en motor som man kan bygga spel som bara renderas med divar och CSS."
  },
  {
    "speaker": null,
    "timestamp": "00:13:11",
    "line": "Och som går att styra."
  },
  {
    "speaker": null,
    "timestamp": "00:13:13",
    "line": "Vilken jävla toppen-radio det här är."
  },
  {
    "speaker": null,
    "timestamp": "00:13:16",
    "line": "Fan, är inte det här den gamla screensavern? Den här i labyrinten?"
  },
  {
    "speaker": null,
    "timestamp": "00:13:21",
    "line": "Jo, det är väl nån... Fast jag tror inte den såg ut exakt så här."
  },
  {
    "speaker": null,
    "timestamp": "00:13:25",
    "line": "Men absolut, det är exakt den grafiken."
  },
  {
    "speaker": null,
    "timestamp": "00:13:28",
    "line": "Ja, det är så mycket nostalgi som bara sköljde över mig."
  },
  {
    "speaker": null,
    "timestamp": "00:13:31",
    "line": "Det tog mig tillbaka till tidiga tonår."
  },
  {
    "speaker": null,
    "timestamp": "00:13:34",
    "line": "Herregud."
  },
  {
    "speaker": null,
    "timestamp": "00:13:36",
    "line": "Nej, så den såg jag swisha förbi idag."
  },
  {
    "speaker": null,
    "timestamp": "00:13:40",
    "line": "Och det är ju ändå... Vill man bygga sånt, då kan man vara en front-of-the-front-end-utvecklare, så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:13:47",
    "line": "Ja, precis. Men inte på servern."
  },
  {
    "speaker": null,
    "timestamp": "00:13:50",
    "line": "Nej, absolut. Du har en poäng i att man kan vara React-utvecklare och säga att jag bara fokuserar på..."
  },
  {
    "speaker": null,
    "timestamp": "00:13:59",
    "line": "Men när du säger att jag bara är React-utvecklare och bara fokuserar på fronten, alltså bara på klienten."
  },
  {
    "speaker": null,
    "timestamp": "00:14:06",
    "line": "Då är du kanske mer än \"\"jag är en front-end-utvecklare\"\". Alltså för att du är duktig på HTML och CSS."
  },
  {
    "speaker": null,
    "timestamp": "00:14:12",
    "line": "Jo, men alltså... Jag vet inte, det är väl också lite så här tanken är att okej, men vi är förbi där du bara kan vara sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:20",
    "line": "Du måste kunna AI och du måste kunna language models och du måste kunna jobba med AI och inte ignorera det."
  },
  {
    "speaker": null,
    "timestamp": "00:14:32",
    "line": "Ja, alltså i den bubblan vi är i så finns det väl någon vind som blåser däråt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:40",
    "line": "Vi är konsulter, vi riktar oss mot stora tech-bolag i stort sett om man ska generalisera."
  },
  {
    "speaker": null,
    "timestamp": "00:14:47",
    "line": "Och alla bygger ju typ samma sak. Visst att det är olika produkter och olika saker, men alla bygger ju samma sak rent komplexitet-mässigt och teknik-mässigt."
  },
  {
    "speaker": null,
    "timestamp": "00:14:57",
    "line": "Sen finns det ju en hel radda andra saker man kan vara. Man kan vara en ganska kreativ front-end-utvecklare som bygger saker i 3D"
  },
  {
    "speaker": null,
    "timestamp": "00:15:04",
    "line": "eller bygger coola landningssidor för vad det nu kan vara. Man kan bygga reklamkampanjer som byggs av hemsidor."
  },
  {
    "speaker": null,
    "timestamp": "00:15:11",
    "line": "Det finns ju en massa sådana bitar som kanske inte vi berör så mycket, men som det kanske med sitter typ studios eller designbyråer och sådana saker."
  },
  {
    "speaker": null,
    "timestamp": "00:15:22",
    "line": "Ja, och jag kan ingenting av det. Ja, fy fan. Alltså nu börjar 2024 se fett mörkt ut. Jävlar i havet."
  },
  {
    "speaker": null,
    "timestamp": "00:15:34",
    "line": "2024, det började bra, men nu börjar det ordna upp sig så att säga."
  },
  {
    "speaker": null,
    "timestamp": "00:15:38",
    "line": "Ja, nu är vi tillbaka på standardnivåer, fy fan."
  },
  {
    "speaker": null,
    "timestamp": "00:15:43",
    "line": "Nej, men jag vet inte. Vi är ju inne i någon typ av inte en lågkonjunktur, kanske, om man frågar. Konjunktur, konjunktur, konjunktur."
  },
  {
    "speaker": null,
    "timestamp": "00:15:54",
    "line": "Hur fan säger man ordet? Jag har sagt det för många gånger. Det här jävla institutet. Då kanske man inte säger att det är en lågkonjunktur än."
  },
  {
    "speaker": null,
    "timestamp": "00:16:01",
    "line": "Men just om man tittar på IT-branschen och tech-branschen så är det absolut sämre än vad det var förut."
  },
  {
    "speaker": null,
    "timestamp": "00:16:09",
    "line": "Det går ju liksom inte att jämföra med hur det var, eller har varit i andra branscher förut, eller hur det var i IT-bubblan och den sprack och allting sånt."
  },
  {
    "speaker": null,
    "timestamp": "00:16:18",
    "line": "Nej, men det är ju inte också nu att allting går långsammare åt helvete. För i IT-bubblan, då sprack allt och då blir det kaos för allt."
  },
  {
    "speaker": null,
    "timestamp": "00:16:25",
    "line": "Vi är så här, de ni inte har spruckit för, de handlar fortfarande saker och det fuckar upp."
  },
  {
    "speaker": null,
    "timestamp": "00:16:33",
    "line": "Det finns en andel människor som skiter i att man ska spara sina pengar."
  },
  {
    "speaker": null,
    "timestamp": "00:16:40",
    "line": "Eller skiter i att inte fortsätta handla när det är dyrt och kaos. Då räknar jag in mig själv där, för jag är utråkad."
  },
  {
    "speaker": null,
    "timestamp": "00:16:51",
    "line": "Ja, du vill bara att någonting ska hända."
  },
  {
    "speaker": null,
    "timestamp": "00:16:53",
    "line": "Det har nätshoppats en del. Det har hänt."
  },
  {
    "speaker": null,
    "timestamp": "00:16:57",
    "line": "Ja, men det kanske är för att du står och sitter framför skärmen och skriker \"\"någonting måste hända\"\" och så nätshoppar du lite."
  },
  {
    "speaker": null,
    "timestamp": "00:17:04",
    "line": "Exakt. Exakt så är det. Jag har idag fått hem ett par byxor som i princip bara är plast."
  },
  {
    "speaker": null,
    "timestamp": "00:17:12",
    "line": "Och som skriker när jag går i dem. Det händer oljan, miljön."
  },
  {
    "speaker": null,
    "timestamp": "00:17:18",
    "line": "Det är inte poddvänliga byxor, helt enkelt."
  },
  {
    "speaker": null,
    "timestamp": "00:17:21",
    "line": "Nej, och inte miljövänliga byxor. Då måste ni cancela mig också."
  },
  {
    "speaker": null,
    "timestamp": "00:17:27",
    "line": "Jag vet inte ens vad jag är på för humör idag. Jag är ledsen. Herregud."
  },
  {
    "speaker": null,
    "timestamp": "00:17:31",
    "line": "Vi är lite ur synk bara. Vi har inte poddat på en och en halv månad eller något."
  },
  {
    "speaker": null,
    "timestamp": "00:17:37",
    "line": "Man blir ju trött av att inte göra saker."
  },
  {
    "speaker": null,
    "timestamp": "00:17:41",
    "line": "Okej, men har du gjort ingenting för att du inte poddat?"
  },
  {
    "speaker": null,
    "timestamp": "00:17:51",
    "line": "Podda är det du gör, sen gör du inget annat. Punkt."
  },
  {
    "speaker": null,
    "timestamp": "00:17:54",
    "line": "Nej, jag tänker bara att man blir trött i poddnerven, poddmuskeln."
  },
  {
    "speaker": null,
    "timestamp": "00:18:00",
    "line": "Om man inte använt poddmuskeln på ett tag."
  },
  {
    "speaker": null,
    "timestamp": "00:18:03",
    "line": "Alltså, man blir ju inte trött, man blir väl slapp?"
  },
  {
    "speaker": null,
    "timestamp": "00:18:06",
    "line": "Ja, man blir slapp. Man blir svag."
  },
  {
    "speaker": null,
    "timestamp": "00:18:10",
    "line": "Jag kämpar för att hitta den här metaforen, att den ska funka."
  },
  {
    "speaker": null,
    "timestamp": "00:18:16",
    "line": "Jag gör verkligen det."
  },
  {
    "speaker": null,
    "timestamp": "00:18:18",
    "line": "Du bara \"\"en muskel, hur använder jag den?\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:18:23",
    "line": "Jag förstår helt om man har stängt av det, hoppas inte vi är det här laget."
  },
  {
    "speaker": null,
    "timestamp": "00:18:27",
    "line": "Men, jag vet inte. Har du någon teknikspaning?"
  },
  {
    "speaker": null,
    "timestamp": "00:18:34",
    "line": "Vart blåser vindarna inom React-utveckling?"
  },
  {
    "speaker": null,
    "timestamp": "00:18:41",
    "line": "Jag har väl aldrig en endast liten spaning?"
  },
  {
    "speaker": null,
    "timestamp": "00:18:45",
    "line": "Jo, du brukar inte säga att det är spaningar, du brukar bara spana ibland."
  },
  {
    "speaker": null,
    "timestamp": "00:18:51",
    "line": "Nej, men jag fick nyligen lära mig om ZooStand."
  },
  {
    "speaker": null,
    "timestamp": "00:18:54",
    "line": "Jag har aldrig hört talas om det förut."
  },
  {
    "speaker": null,
    "timestamp": "00:18:57",
    "line": "Nu håller jag på med det."
  },
  {
    "speaker": null,
    "timestamp": "00:18:59",
    "line": "Det är ju trevligt. Det är från samma gäng, jag vet inte exakt vilken person som har gjort det."
  },
  {
    "speaker": null,
    "timestamp": "00:19:06",
    "line": "Men det är samma som har gjort React 3 Fiber."
  },
  {
    "speaker": null,
    "timestamp": "00:19:10",
    "line": "Det är ett väldigt avskalat sätt att persistera state. Man skapar upp en liten store."
  },
  {
    "speaker": null,
    "timestamp": "00:19:17",
    "line": "Ja, exakt. Du kan väl även använda statet både i React och utanför React, vilket är ganska trevligt."
  },
  {
    "speaker": null,
    "timestamp": "00:19:26",
    "line": "Alltså säkert. Men vem befinner sig utanför React?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:30",
    "line": "Nej, men hela det, statehantering, jag vet inte. Det känns som att det inte händer så mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:19:38",
    "line": "Nej, jag vet inte. Men på ett sätt känns det också som att det kommer tillbaka lite."
  },
  {
    "speaker": null,
    "timestamp": "00:19:43",
    "line": "Först hade vi supertunga grejer, och sen så försvann det helt. Vi har huggs för grejer."
  },
  {
    "speaker": null,
    "timestamp": "00:19:51",
    "line": "Allting frågade oss vad som skulle hända."
  },
  {
    "speaker": null,
    "timestamp": "00:19:53",
    "line": "Sen kom Overmind tillbaka."
  },
  {
    "speaker": null,
    "timestamp": "00:19:55",
    "line": "Sen kom Overmind tillbaka? Var det Overmind?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:57",
    "line": "Nej, men kommer du inte ihåg det?"
  },
  {
    "speaker": null,
    "timestamp": "00:19:59",
    "line": "Jo, men det var jättelänge sedan."
  },
  {
    "speaker": null,
    "timestamp": "00:20:01",
    "line": "Ja, men det var typ den bästa statehanteringen som har gjorts."
  },
  {
    "speaker": null,
    "timestamp": "00:20:04",
    "line": "Ja, fast det har ju inte hänt så mycket. Du har ju inte ens nämnt det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:07",
    "line": "Nej, men det är ju för att projektet är dött, tyvärr."
  },
  {
    "speaker": null,
    "timestamp": "00:20:10",
    "line": "Ja, exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:20:12",
    "line": "Han normannen som underhöll det tror inte att han gör det längre."
  },
  {
    "speaker": null,
    "timestamp": "00:20:16",
    "line": "Nej, fan, jag förstår det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:19",
    "line": "Jag tog med mig ett paket en gång som hade en uppsats om varför skaparen inte hade tid att maintaina det."
  },
  {
    "speaker": null,
    "timestamp": "00:20:28",
    "line": "Hon bara så här \"\"Jag har två barn och det är en pandemi och det här går inte alls, ni får fixa saker själva, skrik inte på mig!\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:20:35",
    "line": "Det var en sån lång uppsats, och jag förstår personerna."
  },
  {
    "speaker": null,
    "timestamp": "00:20:39",
    "line": "Jag verkligen är."
  },
  {
    "speaker": null,
    "timestamp": "00:20:41",
    "line": "Vad vill jag säga igen? Jag tror att vi kommer gå tillbaka till att bara göra mer saker i klienten."
  },
  {
    "speaker": null,
    "timestamp": "00:20:47",
    "line": "Nej, det tror jag inte riktigt. Eller?"
  },
  {
    "speaker": null,
    "timestamp": "00:20:50",
    "line": "Ja, det känns som en evig pendel, den här klient- och server-pendeln."
  },
  {
    "speaker": null,
    "timestamp": "00:20:57",
    "line": "Först var det bara server, sen gick det till bara klient, sen nu är det väl tillbaka till bara server på många sätt."
  },
  {
    "speaker": null,
    "timestamp": "00:21:07",
    "line": "Sen är det väl på väg till någonting mitt emellan, tittar man på React Server Components till exempel, det måste man säga, det är något ganska stort mellanting."
  },
  {
    "speaker": null,
    "timestamp": "00:21:16",
    "line": "Ja, och sen vad har vi på styling då? Var är vi egentligen på väg med styling?"
  },
  {
    "speaker": null,
    "timestamp": "00:21:21",
    "line": "Åh, vi måste ju tillbaka till Style Components. Det är ju den bästa lösningen."
  },
  {
    "speaker": null,
    "timestamp": "00:21:28",
    "line": "Men det är ju typ dött."
  },
  {
    "speaker": null,
    "timestamp": "00:21:30",
    "line": "Ja, det är inte dött. Nu får du, lugn, sitt i båten."
  },
  {
    "speaker": null,
    "timestamp": "00:21:34",
    "line": "Det är min spaning, alltså sluta hacka på mina spaningar."
  },
  {
    "speaker": null,
    "timestamp": "00:21:40",
    "line": "Nej, men absolut. Det finns ett problem med ganska många CSS i JS-lösningar, att de inte funkar när man renderar dem på servern med typ Style Components."
  },
  {
    "speaker": null,
    "timestamp": "00:21:52",
    "line": "Eller de funkar inte att streama, är väl egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:21:55",
    "line": "Nej, precis. Det är ju problematiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:21:58",
    "line": "Men det kommer ju en massa nya roliga. Det kommer till exempel Panda CSS som vi väl nämnt i podden. Vi har pratat om Stylex, har vi gjort det?"
  },
  {
    "speaker": null,
    "timestamp": "00:22:05",
    "line": "Vi har väl nämnt det. Det är väl Facebook som ska lösa alla problem i hela världen och blir den enda enväldiga medhärskaren."
  },
  {
    "speaker": null,
    "timestamp": "00:22:12",
    "line": "Exakt, och det släpptes ju publikt för inte så länge sedan."
  },
  {
    "speaker": null,
    "timestamp": "00:22:16",
    "line": "Jaha, jag har inte kollat det."
  },
  {
    "speaker": null,
    "timestamp": "00:22:19",
    "line": "Nej, den finns ju ute och är publik."
  },
  {
    "speaker": null,
    "timestamp": "00:22:22",
    "line": "Jag saknar fortfarande, jag tror inte att det kallas noga, att man kan använda template-strängen."
  },
  {
    "speaker": null,
    "timestamp": "00:22:28",
    "line": "För det är ju så jävla trevligt att kunna skriva CSS exakt som det var, men strössla in lite JavaScript heller."
  },
  {
    "speaker": null,
    "timestamp": "00:22:35",
    "line": "Det är faktiskt sant. Men spaningen på riktigt, är det inte HTML?"
  },
  {
    "speaker": null,
    "timestamp": "00:22:42",
    "line": "Nej."
  },
  {
    "speaker": null,
    "timestamp": "00:22:44",
    "line": "Jo!"
  },
  {
    "speaker": null,
    "timestamp": "00:22:45",
    "line": "Men det kommer aldrig slå."
  },
  {
    "speaker": null,
    "timestamp": "00:22:48",
    "line": "Jo, för det är till för alla..."
  },
  {
    "speaker": null,
    "timestamp": "00:22:52",
    "line": "Nu dödar vi HTML."
  },
  {
    "speaker": null,
    "timestamp": "00:22:54",
    "line": "Nej, men vet du vad det är? De riktar sig till alla, alla utvecklare som har någonsin hört som sagt \"\"Jag gillar att jobba nära browsern och browserns funktion, för vad farlig vi annars på med webben."
  },
  {
    "speaker": null,
    "timestamp": "00:23:04",
    "line": "Och jag gillar att vi är tillbaka till det, och man jobbar browsern nära med events och anrop och sånt.\"\""
  },
  {
    "speaker": null,
    "timestamp": "00:23:11",
    "line": "Det är HTML-användaren, och sådana finns massor av. Förståeligt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:20",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:23:22",
    "line": "Och de är en majoritet, tror jag, över resten."
  },
  {
    "speaker": null,
    "timestamp": "00:23:28",
    "line": "Inte en chans."
  },
  {
    "speaker": null,
    "timestamp": "00:23:30",
    "line": "Jo!"
  },
  {
    "speaker": null,
    "timestamp": "00:23:31",
    "line": "Nej! Alltså visst, HTML löser säkert nåt jättebra problem. Alltså det är säkert toppen, om man inte vill göra nånting som är ganska interaktivt och bra och känns lite mer app-likt."
  },
  {
    "speaker": null,
    "timestamp": "00:23:40",
    "line": "Ganska interaktivt och bra, alltså."
  },
  {
    "speaker": null,
    "timestamp": "00:23:44",
    "line": "Ja, men det är ju fan sant!"
  },
  {
    "speaker": null,
    "timestamp": "00:23:48",
    "line": "Nu är du på veva igen."
  },
  {
    "speaker": null,
    "timestamp": "00:23:50",
    "line": "Ja, men det är jag. Är det inte också ett jättestort problem med accessibility med HTML? Att det är svinjobbigt att få det att funka bra?"
  },
  {
    "speaker": null,
    "timestamp": "00:23:58",
    "line": "Alltså jag har ingen aning. Men alltså borde det verkligen vara svinjobbigt att få det att..."
  },
  {
    "speaker": null,
    "timestamp": "00:24:02",
    "line": "Då säger vi att det är sant."
  },
  {
    "speaker": null,
    "timestamp": "00:24:04",
    "line": "Men borde det verkligen vara svinjobbigt att få det att funka bra? För att liksom en sak med accessibility är ju att använda bra HTML."
  },
  {
    "speaker": null,
    "timestamp": "00:24:11",
    "line": "Ja."
  },
  {
    "speaker": null,
    "timestamp": "00:24:13",
    "line": "Ja. Vilket är det då?"
  },
  {
    "speaker": null,
    "timestamp": "00:24:15",
    "line": "Men om du ska göra saker som att du ska byta ut element, eller du ska sortera om element, eller liksom alla sådana interaktiva saker, det måste ju också annonsas till skärmläsare, till exempel."
  },
  {
    "speaker": null,
    "timestamp": "00:24:24",
    "line": "Och sådana saker. Och det har jag förstått, när jag kollade på det här för kanske ett år sedan, att det var jobbigt."
  },
  {
    "speaker": null,
    "timestamp": "00:24:30",
    "line": "Ja, okej. Alltså jag har ingen aning egentligen."
  },
  {
    "speaker": null,
    "timestamp": "00:24:36",
    "line": "Nej, absolut. Jag känner bara att HTML-hypen är till stor del tror jag den beror på att han som ligger bakom det, som jag inte kommer ihåg vad den heter nu, är bra på marknadsföring."
  },
  {
    "speaker": null,
    "timestamp": "00:24:49",
    "line": "Och att han har en väldigt tydlig målgrupp i folk som typ identifierar sig med liksom old man, screams at cloud-mimen."
  },
  {
    "speaker": null,
    "timestamp": "00:24:59",
    "line": "Exakt. Exakt. Och de är lite mer low key, men de är ändå där liksom. Och så är det. De säger inte hurraa, de säger typ kolla på det här. Ja, schysst. Och så sprider det sig."
  },
  {
    "speaker": null,
    "timestamp": "00:25:13",
    "line": "Ja, absolut. Men jag vet inte. Det är liksom lite, det finns ju någonting som går emot det. Alltså, ja men det ska vi följa browsen så nära möjligt."
  },
  {
    "speaker": null,
    "timestamp": "00:25:26",
    "line": "Går man in på deras hemsida, nu gick jag in på htmlx, jag har inte varit in där på jättelänge. Motivation. Why should only a-taggar and form-taggar be able to make HTTP requests?"
  },
  {
    "speaker": null,
    "timestamp": "00:25:40",
    "line": "Vad känner du om det?"
  },
  {
    "speaker": null,
    "timestamp": "00:25:43",
    "line": "Ja, det är sant. Men varför är det sant?"
  },
  {
    "speaker": null,
    "timestamp": "00:25:49",
    "line": "Jag har ingen aning. Jag bara känner mig så himla mycket som old man jäms att cloud nu."
  },
  {
    "speaker": null,
    "timestamp": "00:25:55",
    "line": "Ja, men bygg någonting med typ remix, eller bygg någonting med vanilja JavaScript, eller bygg någonting med liksom, inte fan vet jag, bara server-side renderad React utan att du liksom skeppar någon JavaScript i fronten."
  },
  {
    "speaker": null,
    "timestamp": "00:26:07",
    "line": "Alltså det finns så jävla många alternativ. Htmlx är liksom någonting som kommer, visst det kanske funkar på något enstaka pyttelite projekt, så fort det växer så måste man byta ut det."
  },
  {
    "speaker": null,
    "timestamp": "00:26:17",
    "line": "Men vet du vad jag tror det är också? Att jag har lite så här fatig av att sitta i bildtools och pipelines och workflows och grejer och inte fattat ett jota och monorepos och så här och bara varit förvirrad."
  },
  {
    "speaker": null,
    "timestamp": "00:26:31",
    "line": "Och jag tror att det kanske är en sån typ av fatig som gör att jag bara vill tillbaka till när saker var lite simplistiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:26:39",
    "line": "Ja, absolut. Alltså den längtan kan man ju ha utan att man säger att htmlx är lösningen på det. Och jag inser att jag kommer få massa haters på mig, eller massa av massa, minst en."
  },
  {
    "speaker": null,
    "timestamp": "00:26:51",
    "line": "Och han vet vem han är när han lyssnar på det här. Men jag vet inte, jag känner bara inte att htmlx ger mig så mycket."
  },
  {
    "speaker": null,
    "timestamp": "00:26:59",
    "line": "Jag är mest fascinerad över, för jag visste verkligen inte att det fanns så starka känslor kring htmlx i den här podden."
  },
  {
    "speaker": null,
    "timestamp": "00:27:09",
    "line": "Vet du vad, det visste inte jag heller när vi började prata om det här."
  },
  {
    "speaker": null,
    "timestamp": "00:27:17",
    "line": "Jag är lite fascinerad det, det måste man säga."
  },
  {
    "speaker": null,
    "timestamp": "00:27:21",
    "line": "Nej, det är spännande. Jag såg på tal om fatig så fanns det en liten haiku på htmlx hemsida."
  },
  {
    "speaker": null,
    "timestamp": "00:27:33",
    "line": "Javascript, fatig, longing for a hypertext already in hand."
  },
  {
    "speaker": null,
    "timestamp": "00:27:41",
    "line": "Himla stuffigt, alltså jag kan inte."
  },
  {
    "speaker": null,
    "timestamp": "00:27:51",
    "line": "Vi runder väl av där, vi kommer tillbaka i bättre form med en starkare poddmuskel om en sista två veckor."
  },
  {
    "speaker": null,
    "timestamp": "00:28:01",
    "line": "När vi startar 2024 starkt, det kan bara gå ut för det härifrån."
  },
  {
    "speaker": null,
    "timestamp": "00:28:05",
    "line": "Ja, vi får se om det återkommer lite jackskämt också, det är mycket möjligt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:09",
    "line": "Ja, det är en ny asdf podd i 2024."
  },
  {
    "speaker": null,
    "timestamp": "00:28:15",
    "line": "Och just det, en ny grej i podden, ett nytt sätt, ett jävla fantastiskt sätt att kontakta oss i podden."
  },
  {
    "speaker": null,
    "timestamp": "00:28:25",
    "line": "Jag har nämligen, vi ska sägas, jag har byggt oss en liten röstbrevlåda som man kan då helt enkelt ringa till om man vill."
  },
  {
    "speaker": null,
    "timestamp": "00:28:39",
    "line": "Och i den här röstbrevlådan, när man ringer så kan man få lämna ett lite meddelande och man får väl säga vad fan man vill tänker jag."
  },
  {
    "speaker": null,
    "timestamp": "00:28:47",
    "line": "Inte hat kanske, det skulle vara tråkigt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:49",
    "line": "Inget brottsligt."
  },
  {
    "speaker": null,
    "timestamp": "00:28:51",
    "line": "Nej, inget brottsligt, inget hat. Vi spelar ju såklart in det så att vi kan höra vad ni säger."
  },
  {
    "speaker": null,
    "timestamp": "00:28:55",
    "line": "Och ja, det är väl, ring och berätta något kul."
  },
  {
    "speaker": null,
    "timestamp": "00:29:03",
    "line": "Ni kan ju dra ett skämt, om ni drar ett skämt så kanske vi får spela upp det i podden. Det skulle vara kul."
  },
  {
    "speaker": null,
    "timestamp": "00:29:07",
    "line": "Och telefonnumret kanske man ska säga också."
  },
  {
    "speaker": null,
    "timestamp": "00:29:13",
    "line": "Är 076-6860507."
  },
  {
    "speaker": null,
    "timestamp": "00:29:17",
    "line": "Är det som man säger det? Nej. Vi kanske säger det som 0766-860507. Det var bättre va?"
  },
  {
    "speaker": null,
    "timestamp": "00:29:27",
    "line": "Ja, det var mycket bättre. Du har ju 0507 på slutet, varför skulle du göra något konstigt med dem?"
  },
  {
    "speaker": null,
    "timestamp": "00:29:33",
    "line": "Jag vet inte. Men det är 0766-860507. Det var jättebra."
  },
  {
    "speaker": null,
    "timestamp": "00:29:39",
    "line": "Ja, det är ju helt annat nummer det också. 0766-86, alltså gud."
  },
  {
    "speaker": null,
    "timestamp": "00:29:43",
    "line": "Ja, istället för 076-6860507."
  },
  {
    "speaker": null,
    "timestamp": "00:29:47",
    "line": "Okej, jag tror att alla har hört det här numret tillräckligt nu. Men det skulle vara jättekul om ni ringer och lämnar något."
  },
  {
    "speaker": null,
    "timestamp": "00:29:55",
    "line": "Det kan vara att det ibland tar lite tid att svara, för jag har den på någon gratis liten server som tar ett tag att snurra igång."
  },
  {
    "speaker": null,
    "timestamp": "00:30:01",
    "line": "Men om ni inte får något svar så ring igen bara. Så går det säkert bra."
  },
  {
    "speaker": null,
    "timestamp": "00:30:05",
    "line": "Ja, och en jack-skämtskran kan ju ringa in sina egna skämt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:09",
    "line": "Exakt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:11",
    "line": "Det är mer autentiskt."
  },
  {
    "speaker": null,
    "timestamp": "00:30:13",
    "line": "Gud ja, ring in och dra era skämt eller ställ oss frågor eller vad fan som helst. Vi får se hur det här funkar. Skrik på oss om det inte går bra."
  },
  {
    "speaker": null,
    "timestamp": "00:30:21",
    "line": "Så hörs vi om två veckor igen."
  },
  {
    "speaker": null,
    "timestamp": "00:30:25",
    "line": "Det gör vi. Ha det fint."
  },
  {
    "speaker": null,
    "timestamp": "00:30:27",
    "line": "Bye bye."
  },
  {
    "speaker": null,
    "timestamp": "00:30:29",
    "line": "(Outromusik)"
  }
]
